zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_sg_gc/pic32cm_sg00/atdf/PIC32CM5112SG00064.atdf
          </instance>
          <instance name="MPU_NS">
            <register-group name="MPU_NS" name-in-module="MPU" address-space="base" offset="0xE002ED90" />
            <parameters>
              <param name="__MPU_NS_REGIONS" value="8" caption="Number of MPU_NS regions" />
              <param name="__MPU_S_REGIONS" value="8" caption="Number of MPU_S regions" />
            </parameters>
          </instance>
        </module>
        <module name="NVIC" id="SYSTEM_IP" version="1.0.0">
          <instance name="NVIC">
            <register-group name="NVIC" name-in-module="NVIC" address-space="base" offset="0xE000E100" />
          </instance>
          <instance name="NVIC_NS">
            <register-group name="NVIC_NS" name-in-module="NVIC" address-space="base" offset="0xE002E100" />
            <parameters>
              <param name="NUM_IRQ" value="141" caption="Number of interrupt request lines" />
            </parameters>
          </instance>
        </module>
        <module name="OSC32KCTRL" id="03717" name2="osc_osc32kctrl_u2400_v2" version="2a0">
          <instance name="OSC32KCTRL">
            <register-group name="OSC32KCTRL" name-in-module="OSC32KCTRL" address-space="base" offset="0x45008000" />
            <signals>
              <signal group="CLKIN32" index="32" function="XOSC32K_XIN32_AMODE" pad="PB01" />
              <signal group="XIN32" index="32" function="XOSC32K_XIN32" pad="PB01" />
              <signal group="XOUT32" index="32" function="XOSC32K_XOUT32" pad="PB02" />
            </signals>
            <parameters>
              <param name="BRIDGE_ID" value="2" caption="H2PB Bridge ID" />
              <param name="PERIPH_ID" value="4" caption="H2PB Peripheral ID" />
              <param name="INSTANCE_ID" value="7" caption="Instance index for OSC32KCTRL" />
              <param name="MCLK_ID_APB" value="7" caption="Index for OSC32KCTRL APB clock" />
              <param name="PAC_ID" value="7" caption="Index for OSC32KCTRL registers write protection" />
            </parameters>
          </instance>
        </module>
        <module name="OSCCTRL" id="03718" name2="osc_oscctrl_u2401_v2" version="2b0">
          <instance name="OSCCTRL">
            <register-group name="OSCCTRL" name-in-module="OSCCTRL" address-space="base" offset="0x44006000" />
            <signals>
              <signal group="CLKIN" function="XOSC_XIN_AMODE" pad="PD05" />
              <signal group="XIN" function="XOSC_XIN" pad="PD05" />
              <signal group="XOUT" function="XOSC_XOUT" pad="PD04" />
            </signals>
            <parameters>
              <param name="DFLL48M_ATEST_IMPLEMENTED" value="1" caption="--" />
              <param name="DFLL48M_ATEST_SIZE" value="8" caption="--" />
              <param name="DFLL48M_IS_STARTUP_OSCILLATOR" value="1" caption="--" />
              <param name="DFLL48M_RC48MCAL0_PORVAL" value="0x00000000" caption="--" />
              <param name="DIV_8MHZ_NUM" value="2" caption="--" />
              <param name="FRACDIVS_NUM" value="0" caption="--" />
              <param name="FRACDIV_DIVIDER_RESET_VAL" value="0" caption="--" />
              <param name="FRACDIV_PLLSRC" value="0" caption="--" />
              <param name="PLLS_NUM" value="1" caption="--" />
              <param name="PLL0_OUTPUTS_NUM" value="5" caption="--" />
              <param name="PLL1_OUTPUTS_NUM" value="0" caption="--" />
              <param name="USBHS_NUM" value="1" caption="should be 0, but IP has bug" />
              <param name="XOSC_ATEST_IMPLEMENTED" value="1" caption="--" />
              <param name="XOSC_ATEST_SIZE" value="4" caption="--" />
              <param name="XOSC_CFD_CLK_SELECT_SIZE" value="4" caption="--" />
              <param name="XOSC_CFD_HAS_RETENTION" value="0" caption="--" />
              <param name="GCLK_ID_DFLL48M" value="0" />
              <param name="GCLK_ID_PLL" value="1" />
              <param name="BRIDGE_ID" value="0" caption="H2PB Bridge ID" />
              <param name="PERIPH_ID" value="3" caption="H2PB Peripheral ID" />
              <param name="INSTANCE_ID" value="6" caption="Instance index for OSCCTRL" />
              <param name="MCLK_ID_APB" value="6" caption="Index for OSCCTRL APB clock" />
              <param name="PAC_ID" value="6" caption="Index for OSCCTRL registers write protection" />
            </parameters>
          </instance>
        </module>
        <module name="PAC" id="04298" name2="sec_pac_apb_v1" version="1a0">
          <instance name="PAC">
            <register-group name="PAC" name-in-module="PAC" address-space="base" offset="0x44022000" />
            <parameters>
              <param name="PAC_PER_WRPROT_MASK" value="0xFFFFFFFF 0x0003FFFF 0x00000000 0x00000000" caption="Peripheral implemented mask. If PAC_PER_WRPROT_MASK[x]=1 then the PAC implements an SFR bit in INTFLAG, STATUS, and LOCK with the location of &lt;REG&gt;(x/32)[x mod 32]" />
              <param name="PAC_STATUS_RESET_VALUE" value="0x00000000 0x00000000 0x00000000 0x00000000" caption="WRP STATUS Reset Value for Peripherals. On reset STATUS(x/32)[x mod 32]=PAC_STATUS_RESET_VALUE[x]The reset value for each peripheral should always be 0. The parameter exists if there is an unforeseen circumstance requiring it to be 1. Test blocks are not one of them as they are protected by dsu_test_mode." />
              <param name="PAC_LOCK_RESET_VALUE" value="0x00000000 0x00000000 0x00000000 0x00000000" caption="--" />
              <param name="PAC_ERRORS_INBAND" value="1" caption="--" />
              <param name="PAC_CTRLAPRIV_IMPLEMENTED" value="1" caption="--" />
              <param name="PAC_INTFLAGSET_IMPLEMENTED" value="0" caption="--" />
              <param name="BRIDGE_ID" value="0" caption="H2PB Bridge ID" />
              <param name="PERIPH_ID" value="17" caption="H2PB Peripheral ID" />
              <param name="INSTANCE_ID" value="14" caption="Instance index for PAC" />
              <param name="MCLK_ID_APB" value="14" caption="Index for PAC APB clock" />
              <param name="PAC_ID" value="14" caption="Index for PAC registers write protection" />
            </parameters>
          </instance>
        </module>
