zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_sg_gc/pic32cm_sg00/atdf/PIC32CM5112SG00064.atdf
        <module name="PUF" id="04891" name2="sec_puf_v1" version="1a0">
          <instance name="PUF">
            <register-group name="PUF" name-in-module="PUF" address-space="base" offset="0x44834000" />
            <parameters>
              <param name="PUF_CTRLAPRIV_IMPLEMENTED" value="1" caption="Implement the CTRLA.PRIV bit and privilege access filtering to registers.0 = CTRLA.PRIV not implemented1 = CTRLA.PRIV implemented" />
              <param name="PUF_WPCTRL_IMPLEMENTED" value="0" caption="Implement the WPCTRL register for write protection. 1 = The WPCTRL register is present . Used to control write protection enable/disable. 0 = No WPCTRL register, only used in legacy device with a PACUse puf_s_wrprot to control write protection enable/disable" />
              <param name="PUF_WPCTRL_KEY" value="0x505546" caption="WPCTRL 24-bit key value. See register description for usage.Set to a unique value for each macro. ASCII of &quot;PUF&quot;" />
              <param name="DMAC_ID_PUFDI" value="41" />
              <param name="DMAC_ID_PUFDO" value="42" />
              <param name="BRIDGE_ID" value="1" caption="H2PB Bridge ID" />
              <param name="PERIPH_ID" value="26" caption="H2PB Peripheral ID" />
              <param name="INSTANCE_ID" value="49" caption="Instance index for PUF" />
              <param name="MCLK_ID_APB" value="63" caption="Index for PUF APB clock" />
              <param name="PAC_ID" value="49" caption="Index for PUF registers write protection" />
            </parameters>
          </instance>
        </module>
        <module name="RSTC" id="03926" name2="pwr_rpmu_rstc_v1" version="1c0">
          <instance name="RSTC">
            <register-group name="RSTC" name-in-module="RSTC" address-space="base" offset="0x45004000" />
            <parameters>
              <param name="BACKUP_IMPLEMENTED" value="1" />
              <param name="CM_DBGRESET_STRETCHED" value="3" caption="Reset stretcher size for Cortex CPU related to DBGRESET." />
              <param name="CM_HRESET_N_STRETCHED" value="3" caption="Reset stretcher size for Cortex CPU related to HRESETn." />
              <param name="CM_PORESET_STRETCHED" value="3" caption="Reset stretcher size for Cortex CPU related to PORESET." />
              <param name="HIB_IMPLEMENTED" value="1" />
              <param name="VBAT_IMPLEMENTED" value="0" caption="One if VBAT (Battery backup mode) is supported" />
              <param name="BRIDGE_ID" value="2" caption="H2PB Bridge ID" />
              <param name="PERIPH_ID" value="2" caption="H2PB Peripheral ID" />
              <param name="INSTANCE_ID" value="5" caption="Instance index for RSTC" />
              <param name="MCLK_ID_APB" value="5" caption="Index for RSTC APB clock" />
              <param name="PAC_ID" value="5" caption="Index for RSTC registers write protection" />
            </parameters>
          </instance>
        </module>
        <module name="RTC" id="03608" name2="tmr_rtc_u2250_v3" version="3b0">
          <instance name="RTC">
            <register-group name="RTC" name-in-module="RTC" address-space="base" offset="0x45006000" />
            <signals>
              <signal group="IN" index="0" function="RTC_PAD_IE" pad="PA07" />
              <signal group="IN" index="1" function="RTC_PAD_IE" pad="PA08" />
              <signal group="IN" index="2" function="RTC_PAD_IE" pad="PA09" />
              <signal group="IN" index="3" function="RTC_PAD_IE" pad="PB00" />
              <signal group="IN" index="4" function="RTC_PAD_IE" pad="PB07" />
              <signal group="IN" index="5" function="RTC_PAD_IE" pad="PB08" />
              <signal group="OUT" index="0" function="_RTC_PAD_OE_N" pad="PB03" />
              <signal group="OUT" index="1" function="_RTC_PAD_OE_N" pad="PB04" />
              <signal group="OUT" index="2" function="_RTC_PAD_OE_N" pad="PB05" />
              <signal group="OUT" index="3" function="_RTC_PAD_OE_N" pad="PB06" />
              <signal group="OUT" index="4" function="_RTC_PAD_OE_N" pad="PB09" />
              <signal group="OUT" index="5" function="_RTC_PAD_OE_N" pad="PB10" />
            </signals>
            <parameters>
              <param name="NUM_OF_ALARMS" value="2" caption="--" />
              <param name="NUM_OF_BKREGS" value="0" caption="--" />
              <param name="NUM_OF_COMP16" value="4" caption="=2 * RTC_NUM_OF_ALARMS" />
              <param name="NUM_OF_TAMPERS" value="8" caption="--" />
              <param name="DMAC_ID_TIMESTAMP" value="3" />
              <param name="BRIDGE_ID" value="2" caption="H2PB Bridge ID" />
              <param name="PERIPH_ID" value="3" caption="H2PB Peripheral ID" />
              <param name="INSTANCE_ID" value="12" caption="Instance index for RTC" />
              <param name="MCLK_ID_APB" value="12" caption="Index for RTC APB clock" />
              <param name="PAC_ID" value="12" caption="Index for RTC registers write protection" />
            </parameters>
          </instance>
        </module>
        <module name="SAU" id="SYSTEM_IP" version="1.0.0">
          <instance name="SAU">
            <register-group name="SAU" name-in-module="SAU" address-space="base" offset="0xE000EDD0" />
          </instance>
        </module>
        <module name="SCB" id="SYSTEM_IP" version="1.0.0">
          <instance name="SCB">
            <register-group name="SCB" name-in-module="SCB" address-space="base" offset="0xE000ED00" />
          </instance>
          <instance name="SCB_NS">
            <register-group name="SCB_NS" name-in-module="SCB" address-space="base" offset="0xE002ED00" />
          </instance>
        </module>
        <module name="SERCOM" id="03715" name2="com_sercom_u2201_v6" version="6c0">
          <instance name="SERCOM0">
            <register-group name="SERCOM0" name-in-module="SERCOM" address-space="base" offset="0x44808000" />
            <signals>
              <signal group="PAD" index="0" function="D" pad="PC00" ioset="1" />
              <signal group="PAD" index="1" function="D" pad="PC01" ioset="1" />
              <signal group="PAD" index="2" function="D" pad="PC02" ioset="1" />
              <signal group="PAD" index="3" function="D" pad="PC03" ioset="1" />
            </signals>
            <parameters>
              <param name="CLK_REDUCTION" value="1" caption="Reduce clock options to pin 1 for SPI and USART" />
              <param name="DMA" value="1" caption="DMA support implemented?" />
              <param name="FIFO_IMPLEMENTED" value="1" caption="FIFO Rx/Tx implemented?" />
              <param name="FIFO_SIZE" value="16" caption="Rx-Tx FIFO size in bytes" />
              <param name="FSYNC_IMPLEMENTED" value="1" caption="SPI Frame Synch mode implemented?" />
              <param name="SPI" value="1" caption="SPI mode implemented?" />
              <param name="TWIM" value="1" caption="TWI Master mode implemented?" />
              <param name="TWIS" value="1" caption="TWI Slave mode implemented?" />
              <param name="TWI_HSMODE" value="1" caption="TWI HighSpeed mode implemented?" />
              <param name="ULTRA_IMPLEMENTATION" value="0" caption="ULTRA platform compatibility?" />
              <param name="USART" value="1" caption="USART mode implemented?" />
              <param name="USART_AUTOBAUD" value="1" caption="USART autobaud implemented?" />
              <param name="USART_IRDA" value="1" caption="USART IrDA implemented?" />
              <param name="USART_LIN_MASTER" value="1" caption="USART LIN Master mode implemented?" />
              <param name="USART_RS485" value="1" caption="USART RS485 mode implemented?" />
              <param name="GCLK_ID_SLOW" value="20" />
              <param name="GCLK_ID_CORE" value="21" />
              <param name="DMAC_ID_RX" value="4" />
              <param name="DMAC_ID_TX" value="5" />
              <param name="BRIDGE_ID" value="1" caption="H2PB Bridge ID" />
              <param name="PERIPH_ID" value="4" caption="H2PB Peripheral ID" />
              <param name="INSTANCE_ID" value="26" caption="Instance index for SERCOM0" />
              <param name="MCLK_ID_APB" value="36" caption="Index for SERCOM0 APB clock" />
              <param name="PAC_ID" value="26" caption="Index for SERCOM0 registers write protection" />
            </parameters>
          </instance>
          <instance name="SERCOM1">
            <register-group name="SERCOM1" name-in-module="SERCOM" address-space="base" offset="0x4480A000" />
            <signals>
              <signal group="PAD" index="0" function="D" pad="PD01" />
              <signal group="PAD" index="1" function="D" pad="PD00" />
              <signal group="PAD" index="2" function="D" pad="PC06" ioset="1" />
              <signal group="PAD" index="2" function="D" pad="PD10" ioset="2" />
              <signal group="PAD" index="3" function="D" pad="PC05" ioset="1" />
              <signal group="PAD" index="3" function="D" pad="PD11" ioset="2" />
            </signals>
            <parameters>
              <param name="CLK_REDUCTION" value="1" caption="Reduce clock options to pin 1 for SPI and USART" />
              <param name="DMA" value="1" caption="DMA support implemented?" />
              <param name="FIFO_IMPLEMENTED" value="1" caption="FIFO Rx/Tx implemented?" />
              <param name="FIFO_SIZE" value="16" caption="Rx-Tx FIFO size in bytes" />
              <param name="FSYNC_IMPLEMENTED" value="1" caption="SPI Frame Synch mode implemented?" />
              <param name="SPI" value="1" caption="SPI mode implemented?" />
              <param name="TWIM" value="1" caption="TWI Master mode implemented?" />
              <param name="TWIS" value="1" caption="TWI Slave mode implemented?" />
              <param name="TWI_HSMODE" value="1" caption="TWI HighSpeed mode implemented?" />
              <param name="ULTRA_IMPLEMENTATION" value="0" caption="ULTRA platform compatibility?" />
              <param name="USART" value="1" caption="USART mode implemented?" />
              <param name="USART_AUTOBAUD" value="1" caption="USART autobaud implemented?" />
              <param name="USART_IRDA" value="1" caption="USART IrDA implemented?" />
              <param name="USART_LIN_MASTER" value="1" caption="USART LIN Master mode implemented?" />
              <param name="USART_RS485" value="1" caption="USART RS485 mode implemented?" />
              <param name="GCLK_ID_SLOW" value="20" />
              <param name="GCLK_ID_CORE" value="22" />
              <param name="DMAC_ID_RX" value="6" />
              <param name="DMAC_ID_TX" value="7" />
              <param name="BRIDGE_ID" value="1" caption="H2PB Bridge ID" />
              <param name="PERIPH_ID" value="5" caption="H2PB Peripheral ID" />
              <param name="INSTANCE_ID" value="27" caption="Instance index for SERCOM1" />
              <param name="MCLK_ID_APB" value="37" caption="Index for SERCOM1 APB clock" />
              <param name="PAC_ID" value="27" caption="Index for SERCOM1 registers write protection" />
            </parameters>
          </instance>
