zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_sg_gc/pic32cm_sg00/atdf/PIC32CM5112SG00064.atdf
          </instance>
          <instance name="SysTick_NS">
            <register-group name="SysTick_NS" name-in-module="SysTick" address-space="base" offset="0xE002E010" />
            <parameters>
              <param name="__SYST_NUM" value="2" caption="Number of implemented SysTick timers" />
            </parameters>
          </instance>
        </module>
        <module name="TCC" id="03610" name2="tmr_tcc_u2213_v4" version="4d0">
          <instance name="TCC0">
            <register-group name="TCC0" name-in-module="TCC" address-space="base" offset="0x44810000" />
            <signals>
              <signal group="WO" index="0" function="F" pad="PC00" ioset="1" />
              <signal group="WO" index="1" function="F" pad="PC01" ioset="1" />
            </signals>
            <parameters>
              <param name="CC_NUM" value="2" caption="Number of Compare/Capture units" />
              <param name="DITHERING" value="0" caption="Dithering feature implemented" />
              <param name="DTI" value="0" caption="Dead-Time-Insertion feature implemented" />
              <param name="MASTER_SLAVE_MODE" value="1" caption="TCC type 0 : NA, 1 : Master, 2 : Slave" />
              <param name="OTMX" value="0" caption="Output Matrix feature implemented" />
              <param name="OW_NUM" value="2" caption="Number of Output Waveforms" />
              <param name="PG" value="0" caption="Pattern Generation feature implemented" />
              <param name="SIZE" value="16" />
              <param name="SWAP" value="0" caption="DTI outputs swap feature implemented" />
              <param name="GCLK_ID_TCC01" value="25" />
              <param name="DMAC_ID_OVF" value="12" />
              <param name="DMAC_ID_MC0" value="13" />
              <param name="DMAC_ID_MC1" value="14" />
              <param name="BRIDGE_ID" value="1" caption="H2PB Bridge ID" />
              <param name="PERIPH_ID" value="8" caption="H2PB Peripheral ID" />
              <param name="INSTANCE_ID" value="30" caption="Instance index for TCC0" />
              <param name="MCLK_ID_APB" value="40" caption="Index for TCC0 APB clock" />
              <param name="PAC_ID" value="30" caption="Index for TCC0 registers write protection" />
            </parameters>
          </instance>
          <instance name="TCC1">
            <register-group name="TCC1" name-in-module="TCC" address-space="base" offset="0x44812000" />
            <signals>
              <signal group="WO" index="0" function="F" pad="PC02" ioset="1" />
              <signal group="WO" index="0" function="F" pad="PC09" ioset="2" />
              <signal group="WO" index="1" function="F" pad="PC03" ioset="1" />
              <signal group="WO" index="1" function="F" pad="PC10" ioset="2" />
            </signals>
            <parameters>
              <param name="CC_NUM" value="2" caption="Number of Compare/Capture units" />
              <param name="DITHERING" value="0" caption="Dithering feature implemented" />
              <param name="DTI" value="0" caption="Dead-Time-Insertion feature implemented" />
              <param name="MASTER_SLAVE_MODE" value="2" caption="TCC type 0 : NA, 1 : Master, 2 : Slave" />
              <param name="OTMX" value="0" caption="Output Matrix feature implemented" />
              <param name="OW_NUM" value="2" caption="Number of Output Waveforms" />
              <param name="PG" value="0" caption="Pattern Generation feature implemented" />
              <param name="SIZE" value="16" />
              <param name="SWAP" value="0" caption="DTI outputs swap feature implemented" />
              <param name="GCLK_ID_TCC01" value="25" />
              <param name="DMAC_ID_OVF" value="15" />
              <param name="DMAC_ID_MC0" value="16" />
              <param name="DMAC_ID_MC1" value="17" />
              <param name="BRIDGE_ID" value="1" caption="H2PB Bridge ID" />
              <param name="PERIPH_ID" value="9" caption="H2PB Peripheral ID" />
              <param name="INSTANCE_ID" value="31" caption="Instance index for TCC1" />
              <param name="MCLK_ID_APB" value="41" caption="Index for TCC1 APB clock" />
              <param name="PAC_ID" value="31" caption="Index for TCC1 registers write protection" />
            </parameters>
          </instance>
          <instance name="TCC2">
            <register-group name="TCC2" name-in-module="TCC" address-space="base" offset="0x44814000" />
            <signals>
              <signal group="WO" index="0" function="F" pad="PB09" ioset="2" />
              <signal group="WO" index="0" function="F" pad="PC04" ioset="1" />
              <signal group="WO" index="1" function="F" pad="PB08" ioset="2" />
              <signal group="WO" index="1" function="F" pad="PC05" ioset="1" />
            </signals>
            <parameters>
              <param name="CC_NUM" value="2" caption="Number of Compare/Capture units" />
              <param name="DITHERING" value="0" caption="Dithering feature implemented" />
              <param name="DTI" value="0" caption="Dead-Time-Insertion feature implemented" />
              <param name="MASTER_SLAVE_MODE" value="0" caption="TCC type 0 : NA, 1 : Master, 2 : Slave" />
              <param name="OTMX" value="0" caption="Output Matrix feature implemented" />
              <param name="OW_NUM" value="2" caption="Number of Output Waveforms" />
              <param name="PG" value="0" caption="Pattern Generation feature implemented" />
              <param name="SIZE" value="16" />
              <param name="SWAP" value="0" caption="DTI outputs swap feature implemented" />
              <param name="GCLK_ID" value="26" />
              <param name="DMAC_ID_OVF" value="18" />
              <param name="DMAC_ID_MC0" value="19" />
              <param name="DMAC_ID_MC1" value="20" />
              <param name="BRIDGE_ID" value="1" caption="H2PB Bridge ID" />
              <param name="PERIPH_ID" value="10" caption="H2PB Peripheral ID" />
              <param name="INSTANCE_ID" value="32" caption="Instance index for TCC2" />
              <param name="MCLK_ID_APB" value="42" caption="Index for TCC2 APB clock" />
              <param name="PAC_ID" value="32" caption="Index for TCC2 registers write protection" />
            </parameters>
          </instance>
          <instance name="TCC3">
            <register-group name="TCC3" name-in-module="TCC" address-space="base" offset="0x44816000" />
            <signals>
              <signal group="WO" index="0" function="F" pad="PD00" ioset="1" />
              <signal group="WO" index="1" function="F" pad="PD01" ioset="1" />
            </signals>
            <parameters>
              <param name="CC_NUM" value="2" caption="Number of Compare/Capture units" />
              <param name="DITHERING" value="0" caption="Dithering feature implemented" />
              <param name="DTI" value="0" caption="Dead-Time-Insertion feature implemented" />
              <param name="MASTER_SLAVE_MODE" value="0" caption="TCC type 0 : NA, 1 : Master, 2 : Slave" />
              <param name="OTMX" value="0" caption="Output Matrix feature implemented" />
              <param name="OW_NUM" value="2" caption="Number of Output Waveforms" />
              <param name="PG" value="0" caption="Pattern Generation feature implemented" />
              <param name="SIZE" value="16" />
              <param name="SWAP" value="0" caption="DTI outputs swap feature implemented" />
              <param name="GCLK_ID" value="27" />
              <param name="DMAC_ID_OVF" value="21" />
              <param name="DMAC_ID_MC0" value="22" />
              <param name="DMAC_ID_MC1" value="23" />
              <param name="BRIDGE_ID" value="1" caption="H2PB Bridge ID" />
              <param name="PERIPH_ID" value="11" caption="H2PB Peripheral ID" />
              <param name="INSTANCE_ID" value="33" caption="Instance index for TCC3" />
              <param name="MCLK_ID_APB" value="43" caption="Index for TCC3 APB clock" />
              <param name="PAC_ID" value="33" caption="Index for TCC3 registers write protection" />
            </parameters>
          </instance>
          <instance name="TCC4">
            <register-group name="TCC4" name-in-module="TCC" address-space="base" offset="0x44824000" />
            <signals>
              <signal group="WO" index="0" function="F" pad="PA10" ioset="2" />
              <signal group="WO" index="0" function="F" pad="PD07" ioset="1" />
              <signal group="WO" index="1" function="F" pad="PA11" ioset="2" />
              <signal group="WO" index="1" function="F" pad="PD08" ioset="1" />
            </signals>
            <parameters>
              <param name="CC_NUM" value="2" caption="Number of Compare/Capture units" />
              <param name="DITHERING" value="0" caption="Dithering feature implemented" />
              <param name="DTI" value="0" caption="Dead-Time-Insertion feature implemented" />
              <param name="MASTER_SLAVE_MODE" value="0" caption="TCC type 0 : NA, 1 : Master, 2 : Slave" />
              <param name="OTMX" value="0" caption="Output Matrix feature implemented" />
              <param name="OW_NUM" value="2" caption="Number of Output Waveforms" />
              <param name="PG" value="0" caption="Pattern Generation feature implemented" />
              <param name="SIZE" value="16" />
              <param name="SWAP" value="0" caption="DTI outputs swap feature implemented" />
              <param name="GCLK_ID" value="30" />
              <param name="DMAC_ID_OVF" value="28" />
              <param name="DMAC_ID_MC0" value="29" />
              <param name="DMAC_ID_MC1" value="30" />
              <param name="BRIDGE_ID" value="1" caption="H2PB Bridge ID" />
              <param name="PERIPH_ID" value="18" caption="H2PB Peripheral ID" />
              <param name="INSTANCE_ID" value="36" caption="Instance index for TCC4" />
              <param name="MCLK_ID_APB" value="46" caption="Index for TCC4 APB clock" />
              <param name="PAC_ID" value="36" caption="Index for TCC4 registers write protection" />
            </parameters>
          </instance>
          <instance name="TCC5">
            <register-group name="TCC5" name-in-module="TCC" address-space="base" offset="0x44826000" />
            <signals>
              <signal group="WO" index="0" function="F" pad="PD10" ioset="2" />
              <signal group="WO" index="0" function="F" pad="PD09" ioset="1" />
              <signal group="WO" index="1" function="F" pad="PA00" ioset="1" />
              <signal group="WO" index="1" function="F" pad="PD11" ioset="2" />
            </signals>
            <parameters>
              <param name="CC_NUM" value="2" caption="Number of Compare/Capture units" />
              <param name="DITHERING" value="0" caption="Dithering feature implemented" />
              <param name="DTI" value="0" caption="Dead-Time-Insertion feature implemented" />
              <param name="MASTER_SLAVE_MODE" value="0" caption="TCC type 0 : NA, 1 : Master, 2 : Slave" />
              <param name="OTMX" value="0" caption="Output Matrix feature implemented" />
              <param name="OW_NUM" value="2" caption="Number of Output Waveforms" />
              <param name="PG" value="0" caption="Pattern Generation feature implemented" />
              <param name="SIZE" value="16" />
              <param name="SWAP" value="0" caption="DTI outputs swap feature implemented" />
              <param name="GCLK_ID" value="31" />
              <param name="DMAC_ID_OVF" value="31" />
              <param name="DMAC_ID_MC0" value="32" />
              <param name="DMAC_ID_MC1" value="33" />
              <param name="BRIDGE_ID" value="1" caption="H2PB Bridge ID" />
              <param name="PERIPH_ID" value="19" caption="H2PB Peripheral ID" />
              <param name="INSTANCE_ID" value="37" caption="Instance index for TCC5" />
              <param name="MCLK_ID_APB" value="47" caption="Index for TCC5 APB clock" />
              <param name="PAC_ID" value="37" caption="Index for TCC5 registers write protection" />
            </parameters>
          </instance>
