zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_sg_gc/pic32cm_sg00/atdf/PIC32CM5112SG00064.atdf
  </devices>
  <modules>
    <module name="AC" id="03784" name2="cmp_ac_u2501_v2" version="2a0" caption="Analog Comparator Controller">
      <register-group name="CHANNEL" size="0x10">
        <register name="COMPCTRL" offset="0x0" rw="RW" access="WSYNC" size="4" count="2" initval="0x00000000" caption="Pair n Comparator Control 0">
          <bitfield name="ENABLE" caption="Enable" mask="0x2" />
          <bitfield name="SINGLE" caption="Single-Shot Mode" mask="0x8" />
          <bitfield name="INTSEL" caption="Interrupt Selection" mask="0x30" values="COMPCTRL__INTSEL" />
          <bitfield name="RUNSTDBY" caption="Run in Standby" mask="0x40" />
          <bitfield name="MUXNEG" caption="Negative Input Mux Selection" mask="0x700" values="COMPCTRL__MUXNEG" />
          <bitfield name="MUXPOS" caption="Positive Input Mux Selection" mask="0x7000" values="COMPCTRL__MUXPOS" />
          <bitfield name="SWAP" caption="Swap Inputs and Invert" mask="0x10000" />
          <bitfield name="SPEED" caption="Speed Selection" mask="0x20000" values="COMPCTRL__SPEED" />
          <bitfield name="HYST" caption="Hysteresis Level" mask="0x180000" values="COMPCTRL__HYST" />
          <bitfield name="FLEN" caption="Filter Length" mask="0xE00000" values="COMPCTRL__FLEN" />
          <bitfield name="OUT" caption="Output" mask="0x3000000" values="COMPCTRL__OUT" />
          <bitfield name="SUT" caption="Start-up Time" mask="0xFC000000" />
        </register>
        <register name="DACCTRL" offset="0x8" rw="RW" size="4" initval="0x00000000" caption="Dac n Control">
          <bitfield name="VALUE0" caption="DAC0 Output Value" mask="0x7F" />
          <bitfield name="SHEN0" caption="DAC0 Sample and Hold Enable Operating Mode" mask="0x8000" />
          <bitfield name="VALUE1" caption="DAC1 Output Value" mask="0x7F0000" />
          <bitfield name="SHEN1" caption="DAC1 Sample and Hold Enable Operating Mode" mask="0x80000000" />
        </register>
        <register name="WINCTRL" offset="0xC" rw="RW" access="WSYNC" size="4" initval="0x00000000" caption="Window Monitor  n Control">
          <bitfield name="WEN" caption="Window n Mode Enable" mask="0x1" />
          <bitfield name="WINTSEL" caption="Window n Interrupt Selection" mask="0x6" values="WINCTRL__WINTSEL" />
        </register>
      </register-group>
      <register-group name="AC" caption="Analog Comparator Controller">
        <register name="CTRLA" offset="0x0" rw="RW" access="WSYNC" size="4" initval="0x00000000" caption="Control A">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1" />
          <bitfield name="ENABLE" caption="Enable" mask="0x2" />
        </register>
        <register name="CTRLB" offset="0x4" rw="RW" size="4" initval="0x00000000" caption="Control B">
          <bitfield name="START0" caption="Comparator 0 Start Comparison" mask="0x1" />
          <bitfield name="START1" caption="Comparator 1 Start Comparison" mask="0x2" />
        </register>
        <register name="CTRLC" offset="0x8" rw="RW" size="4" initval="0x00000000" caption="Control C">
          <bitfield name="WIDTH" caption="Sample and Hold Clock Pulse Width" mask="0x3FF" />
          <bitfield name="PER" caption="Sample and Hold Clock Period" mask="0x3FF000" />
          <bitfield name="PRESCALER" caption="Prescaling Factor" mask="0x7000000" values="CTRLC__PRESCALER" />
          <bitfield name="AIPMPEN" caption="Analog Input Charge Pump Enable" mask="0x8000000" />
          <bitfield name="CONFIG" caption="Configuration Extension" mask="0xF0000000" />
        </register>
        <register name="EVCTRL" offset="0xC" rw="RW" size="4" initval="0x00000000" caption="Event Control">
          <bitfield name="COMPEO0" caption="Comparator 0 Event Output Enable" mask="0x1" />
          <bitfield name="COMPEO1" caption="Comparator 1 Event Output Enable" mask="0x2" />
          <bitfield name="WINEO0" caption="Window 0 Event Output Enable" mask="0x100" />
          <bitfield name="COMPEI0" caption="Comparator 0 Event Input Enable" mask="0x10000" />
          <bitfield name="COMPEI1" caption="Comparator 1 Event Input Enable" mask="0x20000" />
          <bitfield name="INVEI0" caption="Inverted Event Input Enable 0" mask="0x1000000" />
          <bitfield name="INVEI1" caption="Inverted Event Input Enable 1" mask="0x2000000" />
        </register>
        <register name="INTENCLR" offset="0x10" rw="RW" size="4" atomic-op="clear:INTENCLR" initval="0x00000000" caption="Interrupt Enable Clear">
          <bitfield name="COMP0" caption="Comparator 0 Interrupt Enable" mask="0x1" />
          <bitfield name="COMP1" caption="Comparator 1 Interrupt Enable" mask="0x2" />
          <bitfield name="WIN0" caption="Window 0 Interrupt Enable" mask="0x100" />
        </register>
        <register name="INTENSET" offset="0x14" rw="RW" size="4" atomic-op="set:INTENSET" initval="0x00000000" caption="Interrupt Enable Set">
          <bitfield name="COMP0" caption="Comparator 0 Interrupt Enable" mask="0x1" />
          <bitfield name="COMP1" caption="Comparator 1 Interrupt Enable" mask="0x2" />
          <bitfield name="WIN0" caption="Window 0 Interrupt Enable" mask="0x100" />
        </register>
        <register name="INTFLAG" offset="0x18" rw="RW" size="4" atomic-op="clear:INTFLAG" initval="0x00000000" caption="Interrupt Flag Status and Clear">
          <bitfield name="COMP0" caption="Comparator 0" mask="0x1" />
          <bitfield name="COMP1" caption="Comparator 1" mask="0x2" />
          <bitfield name="WIN0" caption="Window 0" mask="0x100" />
        </register>
        <register name="STATUSA" offset="0x1C" rw="R" size="4" initval="0x00000000" caption="Status A">
          <bitfield name="STATE0" caption="Comparator 0 Current State" mask="0x1" />
          <bitfield name="STATE1" caption="Comparator 1 Current State" mask="0x2" />
          <bitfield name="WSTATE0" caption="Window 0 Current State" mask="0x30000" values="STATUSA__WSTATE" />
        </register>
        <register name="STATUSB" offset="0x20" rw="R" size="4" initval="0x00000000" caption="Status B">
          <bitfield name="READY0" caption="Comparator 0 Ready" mask="0x1" />
          <bitfield name="READY1" caption="Comparator 1 Ready" mask="0x2" />
        </register>
        <register name="DBGCTRL" offset="0x24" rw="RW" size="4" initval="0x00000000" caption="Debug Control">
          <bitfield name="DBGRUN" caption="Debug Run" mask="0x1" />
        </register>
