zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_sg_gc/pic32cm_sg00/atdf/PIC32CM5112SG00064.atdf
        <register name="SYNCBUSY" offset="0x28" rw="R" size="4" initval="0x00000000" caption="Synchronization Busy">
          <bitfield name="SWRST" caption="Software Reset Synchronization Busy" mask="0x1" />
          <bitfield name="ENABLE" caption="Enable Synchronization Busy" mask="0x2" />
          <bitfield name="COMPCTRL0" caption="COMPCTRL 0 Synchronization Busy" mask="0x4" />
          <bitfield name="COMPCTRL1" caption="COMPCTRL 1 Synchronization Busy" mask="0x8" />
          <bitfield name="WINCTRL0" caption="WINCTRL 0 Synchronization Busy" mask="0x400" />
        </register>
        <register-group name="CHANNEL" name-in-module="CHANNEL" offset="0x30" size="0x10" count="1" />
      </register-group>
      <value-group name="COMPCTRL__INTSEL">
        <value name="TOGGLE" caption="Interrupt on comparator output toggle" value="0" />
        <value name="RISING" caption="Interrupt on comparator output rising" value="1" />
        <value name="FALLING" caption="Interrupt on comparator output falling" value="2" />
        <value name="EOC" caption="Interrupt on end of comparison (single-shot mode only)" value="3" />
      </value-group>
      <value-group name="COMPCTRL__MUXNEG">
        <value name="PIN0" caption="I/O pin 0" value="0" />
        <value name="PIN1" caption="I/O pin 1" value="1" />
        <value name="PIN2" caption="I/O pin 2" value="2" />
        <value name="PIN3" caption="I/O pin 3" value="3" />
        <value name="INT0" caption="Internal connection 0, device specific" value="4" />
        <value name="BANDGAP" caption="Bangap" value="5" />
        <value name="GND" caption="Ground" value="6" />
        <value name="INTDAC" caption="Internal DAC" value="7" />
      </value-group>
      <value-group name="COMPCTRL__MUXPOS">
        <value name="PIN0" caption="I/O pin 0" value="0" />
        <value name="PIN1" caption="I/O pin 1" value="1" />
        <value name="PIN2" caption="I/O pin 2" value="2" />
        <value name="PIN3" caption="I/O pin 3" value="3" />
        <value name="INT0" caption="Internal connection 0, device specific" value="4" />
        <value name="INT1" caption="Internal connection 1, device specific" value="5" />
        <value name="INT2" caption="Internal connection 2, device specific" value="6" />
        <value name="INTDAC" caption="Internal DAC" value="7" />
      </value-group>
      <value-group name="COMPCTRL__SPEED">
        <value name="HIGH" caption="High speed, high power" value="0" />
        <value name="LOW" caption="Low speed, low power" value="1" />
      </value-group>
      <value-group name="COMPCTRL__HYST">
        <value name="HYST10" caption="10mV" value="0" />
        <value name="HYST20" caption="20mV" value="1" />
        <value name="HYST40" caption="40mV" value="2" />
        <value name="HYST60" caption="60mV" value="3" />
      </value-group>
      <value-group name="COMPCTRL__FLEN">
        <value name="OFF" caption="No filtering" value="0" />
        <value name="MAJ3" caption="3-bit majority function (2 of 3)" value="1" />
        <value name="MAJ5" caption="5-bit majority function (3 of 5)" value="2" />
      </value-group>
      <value-group name="COMPCTRL__OUT">
        <value name="OFF" caption="The output of COMPn is not routed to the COMPn I/O port" value="0" />
        <value name="ASYNC" caption="The asynchronous output of COMPn is routed to the COMPn I/O port" value="1" />
        <value name="SYNC" caption="The synchronous output (including filtering) of COMPn is routed to the COMPn I/O port" value="2" />
      </value-group>
      <value-group name="WINCTRL__WINTSEL">
        <value name="ABOVE" caption="Interrupt on signal above window" value="0" />
        <value name="INSIDE" caption="Interrupt on signal inside window" value="1" />
        <value name="BELOW" caption="Interrupt on signal below window" value="2" />
        <value name="OUTSIDE" caption="Interrupt on signal outside window" value="3" />
      </value-group>
      <value-group name="CTRLC__PRESCALER">
        <value name="DIV1" caption="Sampling rate is GCLK_AC (No division)" value="0x0" />
        <value name="DIV2" caption="Sampling rate is GCLK_AC/2" value="0x1" />
        <value name="DIV4" caption="Sampling rate is GCLK_AC/4" value="0x2" />
        <value name="DIV8" caption="Sampling rate is GCLK_AC/8" value="0x3" />
        <value name="DIV16" caption="Sampling rate is GCLK_AC/16" value="0x4" />
        <value name="DIV32" caption="Sampling rate is GCLK_AC/32" value="0x5" />
        <value name="DIV64" caption="Sampling rate is GCLK_AC/64" value="0x6" />
        <value name="DIV128" caption="Sampling rate is GCLK_AC/128" value="0x7" />
      </value-group>
      <value-group name="STATUSA__WSTATE">
        <value name="ABOVE" caption="Signal is above window" value="0" />
        <value name="INSIDE" caption="Signal is inside window" value="1" />
        <value name="BELOW" caption="Signal is below window" value="2" />
      </value-group>
    </module>
    <module name="ADC" id="03620" name2="adc_msh_ctrl_apb_v1" version="1b0" caption="ADC Controller">
      <register-group name="CONFIG" size="0x20">
        <register name="CORCTRL" offset="0x0" rw="RW" size="4" initval="0x00000C00" caption="SARCORE Control">
          <bitfield name="SAMC" caption="Sample Count" mask="0x3FF" />
          <bitfield name="SELRES" caption="Selects Resolution" mask="0xC00" values="CORCTRL__SELRES" />
          <bitfield name="EIS" caption="Early Interrupt Select" mask="0x7000" />
          <bitfield name="EIRQOVR" caption="Interrupt Type Select" mask="0x8000" />
          <bitfield name="STRGSRC" caption="SCAN trigger source selection" mask="0xF0000" values="CORCTRL__STRGSRC" />
          <bitfield name="STRGLVL" caption="Scan Trigger Level Sensitivity" mask="0x200000" />
          <bitfield name="SCNRTDS" caption="SCAN Re-trigger Disable" mask="0x400000" />
          <bitfield name="ADCDIV" caption="Division Ratio for SARCORE clock" mask="0x7F000000" />
        </register>
        <register name="CHNCFG1" offset="0x4" rw="RW" size="4" initval="0x00000000" caption="Channel Configuration 1 (LVL/CMPEN)">
          <bitfield name="CHNCMPEN" caption="Channel Comparator Enable" mask="0xFFFF" />
          <bitfield name="LVL" caption="Channel Level" mask="0xFFFF0000" />
        </register>
        <register name="CHNCFG2" offset="0x8" rw="RW" size="4" initval="0x00000000" caption="Channel Configuration 2(FRACT/CSS)">
          <bitfield name="CSS" caption="Channel SCAN Select" mask="0xFFFF" />
          <bitfield name="FRACT" caption="Channel Fractional" mask="0xFFFF0000" />
        </register>
