zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_sg_gc/pic32cm_sg00/atdf/PIC32CM5112SG00064.atdf
      <value-group name="FLTCTRL__OVRSAM">
        <value name="4_SAMPLES" caption="(If FMODE is 0) 4 samples (shift sum 1 bit to right, output data is 13-bits) / (If FMODE is 1) 2 samples to be averaged" value="0" />
        <value name="16_SAMPLES" caption="(If FMODE is 0) 16 samples (shift sum 2 bits to right, output data is 14-bits) / (If FMODE is 1) 4 samples to be averaged" value="1" />
        <value name="64_SAMPLES" caption="(If FMODE is 0) 64 samples (shift sum 3 bits to right, output data is 15-bits) / (If FMODE is 1) 8 samples to be averaged" value="2" />
        <value name="256_SAMPLES" caption="(If FMODE is 0) 256 samples (shift sum 4 bits to right, output data is 16-bits) / (If FMODE is 1) 16 samples to be averaged" value="3" />
        <value name="2_SAMPLES" caption="(If FMODE is 0) 2 samples (shift sum 0 bits to right, output data is 12.1 format) / (If FMODE is 1) 32 samples to be averaged" value="4" />
        <value name="8_SAMPLES" caption="(If FMODE is 0) 8 samples (shift sum 1 bit to right, output data is 13.1 format) / (If FMODE is 1) 64 samples to be averaged" value="5" />
        <value name="32_SAMPLES" caption="(If FMODE is 0) 32 samples (shift sum 2 bits to right, output data is 14.1 format) / (If FMODE is 1) 128 samples to be averaged" value="6" />
        <value name="128_SAMPLES" caption="(If FMODE is 0) 128 samples (shift sum 3 bits to right, output data is 15.1 format) / (If FMODE is 1) 256 samples to be averaged" value="7" />
      </value-group>
      <value-group name="PFFCTRL__PFFRDYDM">
        <value name="CTLINTFLAG_PFFHFUL" caption="Selects CTLINTFLAG.PFFHFUL for the ADC DMA PFFRDY trigger signal to the DMAC" value="0" />
        <value name="CTLINTFLAG_PFFRDY" caption="Selects CTLINTFLAG.PFFRDY for the ADC DMA PFFRDY trigger signal to the DMAC" value="1" />
      </value-group>
    </module>
    <module name="AT" id="04932" name2="sec_anti_tamper_v1" version="1a0" caption="Anti-Tamper Controller (AT)">
      <register-group name="AT" caption="Anti-Tamper Controller (AT)">
        <register name="CTRLA" offset="0x0" rw="RW" size="4" initval="0x00000000" caption="Control Register A">
          <bitfield name="SWRST" caption="Software Reset1 = Reset registers , Bus I/F and internal state0 = No effect" mask="0x1" />
          <bitfield name="PRIV" caption="Privileged Access Only" mask="0x4" values="CTRLA__PRIV" />
          <bitfield name="RUNSTDBY" caption="RUNSTDBY Enable Bit" mask="0x40" />
        </register>
        <register name="TAMPER_KEY" offset="0x100" rw="RW" size="4" count="16" initval="0x00000000" caption="Tamper Key n Register">
          <bitfield name="TAMPERKEY" caption="Tamper Key Value" mask="0xFFFFFFFF" />
        </register>
        <register name="anti_tamper__LEVELA" offset="0x200" rw="R" size="4" initval="0x00000000" caption="Tamper levels 0 to 7.">
          <bitfield name="LEVEL0" caption="Level 0." mask="0xF" />
          <bitfield name="LEVEL1" caption="Level 1." mask="0xF0" />
          <bitfield name="LEVEL2" caption="Level 2." mask="0xF00" />
          <bitfield name="LEVEL3" caption="Level 3." mask="0xF000" />
          <bitfield name="LEVEL4" caption="Level 4." mask="0xF0000" />
          <bitfield name="LEVEL5" caption="Level 5." mask="0xF00000" />
          <bitfield name="LEVEL6" caption="Level 6." mask="0xF000000" />
          <bitfield name="LEVEL7" caption="Level 7." mask="0xF0000000" />
        </register>
        <register name="anti_tamper__LEVELB" offset="0x204" rw="R" size="4" initval="0x00000000" caption="Tamper levels 8 to 15.">
          <bitfield name="LEVEL8" caption="Level 8." mask="0xF" />
          <bitfield name="LEVEL9" caption="Level 9." mask="0xF0" />
          <bitfield name="LEVEL10" caption="Level 10." mask="0xF00" />
          <bitfield name="LEVEL11" caption="Level 11." mask="0xF000" />
          <bitfield name="LEVEL12" caption="Level 12." mask="0xF0000" />
          <bitfield name="LEVEL13" caption="Level 13." mask="0xF00000" />
          <bitfield name="LEVEL14" caption="Level 14." mask="0xF000000" />
          <bitfield name="LEVEL15" caption="Level 15." mask="0xF0000000" />
        </register>
        <register name="anti_tamper__LEVELC" offset="0x208" rw="R" size="4" initval="0x00000000" caption="Tamper levels 16 to 23.">
          <bitfield name="LEVEL16" caption="Level 16." mask="0xF" />
          <bitfield name="LEVEL17" caption="Level 17." mask="0xF0" />
          <bitfield name="LEVEL18" caption="Level 18." mask="0xF00" />
          <bitfield name="LEVEL19" caption="Level 19." mask="0xF000" />
          <bitfield name="LEVEL20" caption="Level 20." mask="0xF0000" />
          <bitfield name="LEVEL21" caption="Level 21." mask="0xF00000" />
          <bitfield name="LEVEL22" caption="Level 22." mask="0xF000000" />
          <bitfield name="LEVEL23" caption="Level 23." mask="0xF0000000" />
        </register>
        <register name="anti_tamper__LEVELD" offset="0x20C" rw="R" size="4" initval="0x00000000" caption="Tamper levels 24 to 31.">
          <bitfield name="LEVEL24" caption="Level 24." mask="0xF" />
          <bitfield name="LEVEL25" caption="Level 25." mask="0xF0" />
          <bitfield name="LEVEL26" caption="Level 26." mask="0xF00" />
          <bitfield name="LEVEL27" caption="Level 27." mask="0xF000" />
          <bitfield name="LEVEL28" caption="Level 28." mask="0xF0000" />
          <bitfield name="LEVEL29" caption="Level 29." mask="0xF00000" />
          <bitfield name="LEVEL30" caption="Level 30." mask="0xF000000" />
          <bitfield name="LEVEL31" caption="Level 31." mask="0xF0000000" />
        </register>
        <register name="anti_tamper__SETLEVEL" offset="0x210" rw="W" size="4" initval="0x00000000" caption="Set tamper level.">
          <bitfield name="LEVEL" caption="Tamper level." mask="0x7" />
          <bitfield name="ID" caption="Tamper ID." mask="0x1F00" />
          <bitfield name="PROTKEY" caption="Protection key (0xA84C)." mask="0xFFFF0000" />
        </register>
