zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_sg_gc/pic32cm_sg00/atdf/PIC32CM5112SG00064.atdf
        <register name="DAUTHSTATUS" offset="0x8" rw="R" size="4" access-size="4" caption="Debug Authentication Status Register">
          <bitfield name="NSID" caption="" mask="0x3" values="DAUTHSTATUS__NSID" />
          <bitfield name="NSNID" caption="" mask="0xC" values="DAUTHSTATUS__NSNID" />
          <bitfield name="SID" caption="" mask="0x30" values="DAUTHSTATUS__SID" />
          <bitfield name="SNID" caption="" mask="0xC0" values="DAUTHSTATUS__SNID" />
        </register>
        <register name="DDEVARCH" offset="0xC" rw="R" size="4" access-size="4" initval="0x47702A04" caption="SCS Device Architecture Register">
          <bitfield name="ARCHPART" caption="Architecture Part" mask="0xFFF" />
          <bitfield name="ARCHVER" caption="Architecture Version" mask="0xF000" />
          <bitfield name="REVISION" caption="Revision" mask="0xF0000" />
          <bitfield name="PRESENT" caption="DEVARCH Present" mask="0x100000" />
          <bitfield name="ARCHITECT" caption="Architect" mask="0xFFE00000" />
        </register>
        <register name="DDEVTYPE" offset="0x1C" rw="R" size="4" access-size="4" initval="0x00000000" caption="SCS Device Type Register">
          <bitfield name="MAJOR" caption="Major type" mask="0xF" />
          <bitfield name="SUB" caption="Sub-type" mask="0xF0" />
        </register>
        <register name="DPIDR4" offset="0x20" rw="R" size="4" access-size="4" caption="SCS Peripheral Identification Register 4">
          <bitfield name="DES_2" caption="JEP106 continuation code" mask="0xF" />
          <bitfield name="SIZE" caption="4KB count" mask="0xF0" />
        </register>
        <register name="DPIDR5" offset="0x24" rw="R" size="4" access-size="4" initval="0x00000000" caption="SCS Peripheral Identification Register 5" />
        <register name="DPIDR6" offset="0x28" rw="R" size="4" access-size="4" initval="0x00000000" caption="SCS Peripheral Identification Register 6" />
        <register name="DPIDR7" offset="0x2C" rw="R" size="4" access-size="4" initval="0x00000000" caption="SCS Peripheral Identification Register 7" />
        <register name="DPIDR0" offset="0x30" rw="R" size="4" access-size="4" caption="SCS Peripheral Identification Register 0">
          <bitfield name="PART_0" caption="Part number bits[7:0]" mask="0xFF" />
        </register>
        <register name="DPIDR1" offset="0x34" rw="R" size="4" access-size="4" caption="SCS Peripheral Identification Register 1">
          <bitfield name="PART_1" caption="Part number bits[11:8]" mask="0xF" />
          <bitfield name="DES_0" caption="JEP106 identification code bits [3:0]" mask="0xF0" />
        </register>
        <register name="DPIDR2" offset="0x38" rw="R" size="4" access-size="4" caption="SCS Peripheral Identification Register 2">
          <bitfield name="DES_1" caption="JEP106 identification code bits[6:4]" mask="0x7" />
          <bitfield name="JEDEC" caption="JEDEC assignee value is used" mask="0x8" />
          <bitfield name="REVISION" caption="Component revision" mask="0xF0" />
        </register>
        <register name="DPIDR3" offset="0x3C" rw="R" size="4" access-size="4" caption="SCS Peripheral Identification Register 3">
          <bitfield name="CMOD" caption="Customer Modified" mask="0xF" />
          <bitfield name="REVAND" caption="RevAnd" mask="0xF0" />
        </register>
        <register name="DCIDR0" offset="0x40" rw="R" size="4" access-size="4" initval="0x0000000D" caption="SCS Component Identification Register 0">
          <bitfield name="PRMBL_0" caption="CoreSight component identification preamble" mask="0xFF" />
        </register>
        <register name="DCIDR1" offset="0x44" rw="R" size="4" access-size="4" initval="0x00000090" caption="SCS Component Identification Register 1">
          <bitfield name="PRMBL_1" caption="CoreSight component identification preamble" mask="0xF" />
          <bitfield name="CLASS" caption="CoreSight component class" mask="0xF0" />
        </register>
        <register name="DCIDR2" offset="0x48" rw="R" size="4" access-size="4" initval="0x00000005" caption="SCS Component Identification Register 2">
          <bitfield name="PRMBL_2" caption="CoreSight component identification preamble" mask="0xFF" />
        </register>
        <register name="DCIDR3" offset="0x4C" rw="R" size="4" access-size="4" initval="0x000000B1" caption="SCS Component Identification Register 3">
          <bitfield name="PRMBL_3" caption="CoreSight component identification preamble" mask="0xFF" />
        </register>
      </register-group>
      <value-group name="DLAR__KEY">
        <value name="UNLOCK" caption="Unlock key value" value="0xC5ACCE55" />
      </value-group>
      <value-group name="DAUTHSTATUS__NSID">
        <value name="NO" caption="Non-secure invasive debug prohibited" value="2" />
        <value name="YES" caption="Non-secure invasive debug allowed" value="3" />
      </value-group>
      <value-group name="DAUTHSTATUS__NSNID">
        <value name="NO" caption="Non-secure non-invasive debug prohibited" value="2" />
        <value name="YES" caption="Non-secure non-invasive debug allowed" value="3" />
      </value-group>
      <value-group name="DAUTHSTATUS__SID">
        <value name="NOSEC" caption="Security Extension not implemented" value="0" />
        <value name="NO" caption="Secure invasive debug prohibited" value="2" />
        <value name="YES" caption="Secure invasive debug allowed" value="3" />
      </value-group>
      <value-group name="DAUTHSTATUS__SNID">
        <value name="NOSEC" caption="Security Extension not implemented" value="0" />
        <value name="NO" caption="Secure non-invasive debug prohibited" value="2" />
        <value name="YES" caption="Secure non-invasive debug allowed" value="3" />
      </value-group>
    </module>
    <module name="DMAC" id="dma_u2223_v2" name2="dma_u2223_v2" version="2i0" caption="Direct Memory Access Controller">
      <register-group name="DMAC" caption="Direct Memory Access Controller">
        <register name="CTRL" offset="0x0" rw="RW" size="2" initval="0x0000" caption="Control">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1" />
          <bitfield name="DMAENABLE" caption="DMA Enable" mask="0x2" />
          <bitfield name="CRCENABLE" caption="CRC Enable" mask="0x4" />
          <bitfield name="LVLEN0" caption="Priority Level 0 Enable" mask="0x100" />
          <bitfield name="LVLEN1" caption="Priority Level 1 Enable" mask="0x200" />
          <bitfield name="LVLEN2" caption="Priority Level 2 Enable" mask="0x400" />
          <bitfield name="LVLEN3" caption="Priority Level 3 Enable" mask="0x800" />
        </register>
        <register name="CRCCTRL" offset="0x2" rw="RW" size="2" initval="0x0000" caption="CRC Control">
          <bitfield name="CRCBEATSIZE" caption="CRC Beat Size" mask="0x3" values="CRCCTRL__CRCBEATSIZE" />
          <bitfield name="CRCPOLY" caption="CRC Polynomial Type" mask="0xC" values="CRCCTRL__CRCPOLY" />
          <bitfield name="CRCSRC" caption="CRC Input Source" mask="0x3F00" values="CRCCTRL__CRCSRC" />
        </register>
        <register name="CRCDATAIN" offset="0x4" rw="RW" size="4" initval="0x00000000" caption="CRC Data Input">
          <bitfield name="CRCDATAIN" caption="CRC Data Input" mask="0xFFFFFFFF" />
        </register>
        <register name="CRCCHKSUM" offset="0x8" rw="RW" size="4" initval="0x00000000" caption="CRC Checksum">
          <bitfield name="CRCCHKSUM" caption="CRC Checksum" mask="0xFFFFFFFF" />
        </register>
        <register name="CRCSTATUS" offset="0xC" rw="RW" size="1" initval="0x00" caption="CRC Status">
          <bitfield name="CRCBUSY" caption="CRC Module Busy" mask="0x1" />
          <bitfield name="CRCZERO" caption="CRC Zero" mask="0x2" />
        </register>
        <register name="DBGCTRL" offset="0xD" rw="RW" size="1" initval="0x00" caption="Debug Control">
          <bitfield name="DBGRUN" caption="Debug Run" mask="0x1" />
        </register>
        <register name="QOSCTRL" offset="0xE" rw="RW" size="1" initval="0x2A" caption="QOS Control">
          <bitfield name="WRBQOS" caption="Write-Back Quality of Service" mask="0x3" values="QOSCTRL__WRBQOS" />
          <bitfield name="FQOS" caption="Fetch Quality of Service" mask="0xC" values="QOSCTRL__FQOS" />
          <bitfield name="DQOS" caption="Data Transfer Quality of Service" mask="0x30" values="QOSCTRL__DQOS" />
        </register>
        <register name="SWTRIGCTRL" offset="0x10" rw="RW" size="4" initval="0x00000000" caption="Software Trigger Control">
          <bitfield name="SWTRIG0" caption="Channel 0 Software Trigger" mask="0x1" />
          <bitfield name="SWTRIG1" caption="Channel 1 Software Trigger" mask="0x2" />
          <bitfield name="SWTRIG2" caption="Channel 2 Software Trigger" mask="0x4" />
          <bitfield name="SWTRIG3" caption="Channel 3 Software Trigger" mask="0x8" />
          <bitfield name="SWTRIG4" caption="Channel 4 Software Trigger" mask="0x10" />
          <bitfield name="SWTRIG5" caption="Channel 5 Software Trigger" mask="0x20" />
          <bitfield name="SWTRIG6" caption="Channel 6 Software Trigger" mask="0x40" />
          <bitfield name="SWTRIG7" caption="Channel 7 Software Trigger" mask="0x80" />
        </register>
