zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_sg_gc/pic32cm_sg00/atdf/PIC32CM5112SG00064.atdf
        <register name="BTCNT" offset="0x2" rw="RW" size="2" caption="Block Transfer Count">
          <bitfield name="BTCNT" caption="Block Transfer Count" mask="0xFFFF" />
        </register>
        <register name="SRCADDR" offset="0x4" rw="RW" size="4" caption="Block Transfer Source Address">
          <bitfield name="SRCADDR" caption="Transfer Source Address" mask="0xFFFFFFFF" />
        </register>
        <register name="DSTADDR" offset="0x8" rw="RW" size="4" caption="Block Transfer Destination Address">
          <bitfield name="DSTADDR" caption="Transfer Destination Address" mask="0xFFFFFFFF" />
        </register>
        <register name="DESCADDR" offset="0xC" rw="RW" size="4" caption="Next Descriptor Address">
          <bitfield name="DESCADDR" caption="Next Descriptor Address" mask="0xFFFFFFFF" />
        </register>
      </register-group>
      <value-group name="CRCCTRL__CRCBEATSIZE">
        <value name="BYTE" caption="8-bit bus transfer" value="0x0" />
        <value name="HWORD" caption="16-bit bus transfer" value="0x1" />
        <value name="WORD" caption="32-bit bus transfer" value="0x2" />
      </value-group>
      <value-group name="CRCCTRL__CRCPOLY">
        <value name="CRC16" caption="CRC-16 (CRC-CCITT)" value="0x0" />
        <value name="CRC32" caption="CRC32 (IEEE 802.3)" value="0x1" />
      </value-group>
      <value-group name="CRCCTRL__CRCSRC">
        <value name="NOACT" caption="No action" value="0x00" />
        <value name="IO" caption="I/O interface" value="0x01" />
      </value-group>
      <value-group name="QOSCTRL__WRBQOS">
        <value name="DISABLE" caption="Background (no sensitive operation)" value="0x0" />
        <value name="LOW" caption="Sensitive Bandwidth" value="0x1" />
        <value name="MEDIUM" caption="Sensitive Latency" value="0x2" />
        <value name="HIGH" caption="Critical Latency" value="0x3" />
      </value-group>
      <value-group name="QOSCTRL__FQOS">
        <value name="DISABLE" caption="Background (no sensitive operation)" value="0x0" />
        <value name="LOW" caption="Sensitive Bandwidth" value="0x1" />
        <value name="MEDIUM" caption="Sensitive Latency" value="0x2" />
        <value name="HIGH" caption="Critical Latency" value="0x3" />
      </value-group>
      <value-group name="QOSCTRL__DQOS">
        <value name="DISABLE" caption="Background (no sensitive operation)" value="0x0" />
        <value name="LOW" caption="Sensitive Bandwidth" value="0x1" />
        <value name="MEDIUM" caption="Sensitive Latency" value="0x2" />
        <value name="HIGH" caption="Critical Latency" value="0x3" />
      </value-group>
      <value-group name="CHCTRLB__EVACT">
        <value name="NOACT" caption="No action" value="0x0" />
        <value name="TRIG" caption="Transfer and periodic transfer trigger" value="0x1" />
        <value name="CTRIG" caption="Conditional transfer trigger" value="0x2" />
        <value name="CBLOCK" caption="Conditional block transfer" value="0x3" />
        <value name="SUSPEND" caption="Channel suspend operation" value="0x4" />
        <value name="RESUME" caption="Channel resume operation" value="0x5" />
        <value name="SSKIP" caption="Skip next block suspend action" value="0x6" />
      </value-group>
      <value-group name="CHCTRLB__TRIGSRC">
        <value name="DISABLE" caption="Only software/event triggers" value="0x00" />
      </value-group>
      <value-group name="CHCTRLB__TRIGACT">
        <value name="BLOCK" caption="One trigger required for each block transfer" value="0x0" />
        <value name="BEAT" caption="One trigger required for each beat transfer" value="0x2" />
        <value name="TRANSACTION" caption="One trigger required for each transaction" value="0x3" />
      </value-group>
      <value-group name="CHCTRLB__CMD">
        <value name="NOACT" caption="No action" value="0x0" />
        <value name="SUSPEND" caption="Channel suspend operation" value="0x1" />
        <value name="RESUME" caption="Channel resume operation" value="0x2" />
      </value-group>
      <value-group name="BTCTRL__EVOSEL">
        <value name="DISABLE" caption="Event generation disabled" value="0x0" />
        <value name="BLOCK" caption="Event strobe when block transfer complete" value="0x1" />
        <value name="BEAT" caption="Event strobe when beat transfer complete" value="0x3" />
      </value-group>
      <value-group name="BTCTRL__BLOCKACT">
        <value name="NOACT" caption="Channel will be disabled if it is the last block transfer in the transaction" value="0x0" />
        <value name="INT" caption="Channel will be disabled if it is the last block transfer in the transaction and block interrupt" value="0x1" />
        <value name="SUSPEND" caption="Channel suspend operation is completed" value="0x2" />
        <value name="BOTH" caption="Both channel suspend operation and block interrupt" value="0x3" />
      </value-group>
      <value-group name="BTCTRL__BEATSIZE">
        <value name="BYTE" caption="8-bit bus transfer" value="0x0" />
        <value name="HWORD" caption="16-bit bus transfer" value="0x1" />
        <value name="WORD" caption="32-bit bus transfer" value="0x2" />
      </value-group>
      <value-group name="BTCTRL__STEPSEL">
        <value name="DST" caption="Step size settings apply to the destination address" value="0x0" />
        <value name="SRC" caption="Step size settings apply to the source address" value="0x1" />
      </value-group>
      <value-group name="BTCTRL__STEPSIZE">
        <value name="X1" caption="Next ADDR = ADDR + (BEATSIZE+1) * 1" value="0x0" />
        <value name="X2" caption="Next ADDR = ADDR + (BEATSIZE+1) * 2" value="0x1" />
        <value name="X4" caption="Next ADDR = ADDR + (BEATSIZE+1) * 4" value="0x2" />
        <value name="X8" caption="Next ADDR = ADDR + (BEATSIZE+1) * 8" value="0x3" />
        <value name="X16" caption="Next ADDR = ADDR + (BEATSIZE+1) * 16" value="0x4" />
        <value name="X32" caption="Next ADDR = ADDR + (BEATSIZE+1) * 32" value="0x5" />
        <value name="X64" caption="Next ADDR = ADDR + (BEATSIZE+1) * 64" value="0x6" />
        <value name="X128" caption="Next ADDR = ADDR + (BEATSIZE+1) * 128" value="0x7" />
      </value-group>
    </module>
    <module name="DSU" id="04465" name2="icd_dsu_v1" version="1a0" caption="Polaris Device Services Unit Macro DOS">
      <register-group name="DSU" caption="Polaris Device Services Unit Macro DOS">
        <register name="CTRLA" offset="0x0" rw="RW" size="4" initval="0x00000000" caption="Control A REGISTER">
          <bitfield name="PRIV" caption="Privileged Access Only for APB Interface" mask="0x4" values="CTRLA__PRIV" />
        </register>
        <register name="CTRLB" offset="0x4" rw="RW" size="4" initval="0x00000000" caption="Control B REGISTER">
          <bitfield name="DCCDMALVL0" caption="DMA Trigger n Level" mask="0x1" values="CTRLB__DCCDMALVL" />
          <bitfield name="DCCDMALVL1" caption="DMA Trigger n Level" mask="0x2" values="CTRLB__DCCDMALVL" />
          <bitfield name="MISC" caption="Device Specific Configuration Register" mask="0xFFFFFF00" />
        </register>
        <register name="CTRLC" offset="0x100" rw="RW" size="4" initval="0x00000000" caption="Control C REGISTER">
          <bitfield name="DBGRW0" caption="CPUn Debug R/W" mask="0x1" values="CTRLC__DBGRW" />
        </register>
        <register name="STATUSA" offset="0x104" rw="RW" size="4" atomic-op="clear:STATUSA" initval="0x00000000" caption="Status A REGISTER">
          <bitfield name="DONE" caption="Done Status" mask="0x1" values="STATUSA__DONE" />
          <bitfield name="BERR" caption="Bus Error Status" mask="0x4" values="STATUSA__BERR" />
          <bitfield name="PERR" caption="Protection Error Status" mask="0x8" values="STATUSA__PERR" />
          <bitfield name="ROMCRC" caption="Boot ROM CRC Self-Check Status" mask="0xC0" values="STATUSA__ROMCRC" />
          <bitfield name="CRSTEXT0" caption="CPUx Reset Extension Status" mask="0x100" values="STATUSA__CRSTEXT" />
          <bitfield name="BREXT0" caption="BootRom 0 Phase Extension Status" mask="0x10000" values="STATUSA__BREXT" />
        </register>
        <register name="STATUSB" offset="0x108" rw="R" size="4" initval="0x00000000" caption="Status B REGISTER">
          <bitfield name="BCCD0" caption="Boot ROM Communication Channel 0 Dirty" mask="0x1" values="STATUSB__BCCD" />
          <bitfield name="BCCD1" caption="Boot ROM Communication Channel 1 Dirty" mask="0x2" values="STATUSB__BCCD" />
          <bitfield name="DCCD0" caption="Debug Communication Channel 0 Dirty" mask="0x4" values="STATUSB__DCCD" />
          <bitfield name="DCCD1" caption="Debug Communication Channel 1 Dirty" mask="0x8" values="STATUSB__DCCD" />
          <bitfield name="DBGPRES" caption="Debugger Present Status" mask="0x100" values="STATUSB__DBGPRES" />
          <bitfield name="HPS" caption="Hot-Plugging Status" mask="0x400" values="STATUSB__HPS" />
        </register>
        <register name="BCC" offset="0x110" rw="RW" size="4" count="2" initval="0x00000000" caption="Boot ROM Channel n REGISTER">
          <bitfield name="DATA" caption="Data" mask="0xFFFFFFFF" />
        </register>
