zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_sg_gc/pic32cm_sg00/atdf/PIC32CM5112SG00064.atdf
      <value-group name="FFLTSYN__PERR">
        <value name="NONE" caption="No Parity Error on Word n" value="0" />
        <value name="ERROR" caption="Parity Error on Word n" value="1" />
      </value-group>
      <value-group name="CRP__BC1ARP">
        <value name="DISABLE" caption="Read Protection for this Page is Disabled" value="0" />
        <value name="ENABLE" caption="Read Protection for this Page is Enabled" value="1" />
      </value-group>
      <value-group name="CRP__UO1RP">
        <value name="DISABLE" caption="Read Protection for this Page is Disabled" value="0" />
      </value-group>
      <value-group name="CRP__BC1RP">
        <value name="DISABLE" caption="Read Protection for this Page is Disabled" value="0" />
        <value name="ENABLE" caption="Read Protection for this Page is Enabled" value="1" />
      </value-group>
      <value-group name="CRP__RCRP">
        <value name="DISABLE" caption="Read Protection for this Page is Disabled" value="0" />
        <value name="ENABLE" caption="Read Protection for this Page is Enabled" value="1" />
      </value-group>
      <value-group name="CRP__VSSRP">
        <value name="DISABLE" caption="Read Protection for this Page is Disabled" value="0" />
        <value name="ENABLE" caption="Read Protection for this Page is Enabled" value="1" />
      </value-group>
      <value-group name="CRP__TRP">
        <value name="DISABLE" caption="Read Protection for this Page is Disabled" value="0" />
        <value name="ENABLE" caption="Read Protection for this Page is Enabled" value="1" />
      </value-group>
      <value-group name="CRP__CORP">
        <value name="DISABLE" caption="Read Protection for this Page is Disabled" value="0" />
        <value name="ENABLE" caption="Read Protection for this Page is Enabled" value="1" />
      </value-group>
      <value-group name="CRP__BC1ARPLOCK">
        <value name="UNLOCKED" caption="The Lock &amp;amp; Read Protect bits for this Page are NOT Locked and can be modified" value="0" />
        <value name="LOCKED" caption="The Lock &amp;amp; Read Protect bits for this Page are Locked and cannot be modified" value="1" />
      </value-group>
      <value-group name="CRP__UO1RPLOCK">
        <value name="LOCKED" caption="The Lock &amp;amp; Read Protect bits for this Page are Locked and cannot be modified" value="1" />
      </value-group>
      <value-group name="CRP__BC1RPLOCK">
        <value name="UNLOCKED" caption="The Lock &amp;amp; Read Protect bits for this Page are NOT Locked and can be modified" value="0" />
        <value name="LOCKED" caption="The Lock &amp;amp; Read Protect bits for this Page are Locked and cannot be modified" value="1" />
      </value-group>
      <value-group name="CRP__RCRPLOCK">
        <value name="UNLOCKED" caption="The Lock &amp;amp; Read Protect bits for this Page are NOT Locked and can be modified" value="0" />
        <value name="LOCKED" caption="The Lock &amp;amp; Read Protect bits for this Page are Locked and cannot be modified" value="1" />
      </value-group>
      <value-group name="CRP__VSSRPLOCK">
        <value name="UNLOCKED" caption="The Lock &amp;amp; Read Protect bits for this Page are NOT Locked and can be modified" value="0" />
        <value name="LOCKED" caption="The Lock &amp;amp; Read Protect bits for this Page are Locked and cannot be modified" value="1" />
      </value-group>
      <value-group name="CRP__TRPLOCK">
        <value name="LOCKED" caption="The Lock &amp;amp; Read Protect bits for this Page are Locked and cannot be modified" value="1" />
      </value-group>
      <value-group name="CRP__CORPLOCK">
        <value name="LOCKED" caption="The Lock &amp;amp; Read Protect bits for this Page are Locked and cannot be modified" value="1" />
      </value-group>
    </module>
    <module name="FCW" id="04971" name2="pfm_ctrlw_apb_v2" version="2a0" caption="Polaris Flash Write Controller">
      <register-group name="FCW" caption="Polaris Flash Write Controller">
        <register name="CTRLA" offset="0x0" rw="RW" size="4" initval="0x00000000" caption="Control A REGISTER">
          <bitfield name="PRIV" caption="Privileged Access Only" mask="0x4" values="CTRLA__PRIV" />
        </register>
        <register name="CTRLOP" offset="0x4" rw="RW" size="4" initval="0x00000000" caption="Control Operation REGISTER">
          <bitfield name="NVMOP" caption="NVM Operation" mask="0xF" values="CTRLOP__NVMOP" />
          <bitfield name="PREPG" caption="NVM Pre-Program Configuration Bit" mask="0x80" values="CTRLOP__PREPG" />
        </register>
        <register name="MUTEX" offset="0x8" rw="RW" size="4" initval="0x00000000" caption="MUTEX REGISTER">
          <bitfield name="LOCK" caption="Flash Write Controller (FCW) Lock by Owner" mask="0x1" values="MUTEX__LOCK" />
          <bitfield name="OWNER" caption="Flash Write Controller (FCW) Owner ID" mask="0x6" values="MUTEX__OWNER" />
        </register>
        <register name="INTENCLR" offset="0xC" rw="RW" size="4" atomic-op="clear:INTENCLR" initval="0x00000000" caption="Interrupt Enable Clear REGISTER">
          <bitfield name="DONE" caption="NVM Operation Done Interrupt Enable" mask="0x1" values="INTENCLR__DONE" />
          <bitfield name="KEYERR" caption="Key Error Interrupt Enable" mask="0x2" values="INTENCLR__KEYERR" />
          <bitfield name="CFGERR" caption="Configuration Error Interrupt Enable" mask="0x4" values="INTENCLR__CFGERR" />
          <bitfield name="FIFOERR" caption="FIFO Underrun during Row Write Interrupt Enable" mask="0x8" values="INTENCLR__FIFOERR" />
          <bitfield name="BUSERR" caption="AHB Bus Error during Row Write Interrupt Enable" mask="0x10" values="INTENCLR__BUSERR" />
          <bitfield name="WPERR" caption="Write Protection Error Interrupt Enable" mask="0x20" values="INTENCLR__WPERR" />
          <bitfield name="OPERR" caption="NVMOP Error Interrupt Enable" mask="0x40" values="INTENCLR__OPERR" />
          <bitfield name="HTDPGM" caption="High Temperature Detect Error Interrupt Enable" mask="0x100" values="INTENCLR__HTDPGM" />
          <bitfield name="RSTERR" caption="Reset or Brown Out Detect Error Interrupt Enable" mask="0x1000" values="INTENCLR__RSTERR" />
          <bitfield name="WRERR" caption="Write Error Interrupt Enable" mask="0x2000" values="INTENCLR__WRERR" />
        </register>
        <register name="INTENSET" offset="0x10" rw="RW" size="4" atomic-op="set:INTENSET" initval="0x00000000" caption="Interrupt Enable Set REGISTER">
          <bitfield name="DONE" caption="NVM Operation Done Interrupt Set Enable" mask="0x1" values="INTENSET__DONE" />
          <bitfield name="KEYERR" caption="Key Error Interrupt Set Enable" mask="0x2" values="INTENSET__KEYERR" />
          <bitfield name="CFGERR" caption="Configuration Error Interrupt Set Enable" mask="0x4" values="INTENSET__CFGERR" />
          <bitfield name="FIFOERR" caption="FIFO Underrun during Row Write Interrupt Set Enable" mask="0x8" values="INTENSET__FIFOERR" />
          <bitfield name="BUSERR" caption="AHB Bus Error during Row Write Interrupt Enable" mask="0x10" values="INTENSET__BUSERR" />
          <bitfield name="WPERR" caption="Write Protection Error Interrupt Enable" mask="0x20" values="INTENSET__WPERR" />
          <bitfield name="OPERR" caption="NVMOP Error Interrupt Enable" mask="0x40" values="INTENSET__OPERR" />
          <bitfield name="HTDPGM" caption="High Temperature Detect Error Interrupt Enable" mask="0x100" values="INTENSET__HTDPGM" />
          <bitfield name="RSTERR" caption="Reset or Brown Out Detect Error Interrupt Enable" mask="0x1000" values="INTENSET__RSTERR" />
          <bitfield name="WRERR" caption="Write Error Interrupt Enable" mask="0x2000" values="INTENSET__WRERR" />
        </register>
        <register name="INTFLAG" offset="0x14" rw="RW" size="4" atomic-op="clear:INTFLAG" initval="0x00000000" caption="Interrupt Flag REGISTER">
          <bitfield name="DONE" caption="NVM Operation Done Flag Bit" mask="0x1" values="INTFLAG__DONE" />
          <bitfield name="KEYERR" caption="Key Error Flag Bit" mask="0x2" values="INTFLAG__KEYERR" />
          <bitfield name="CFGERR" caption="Configuration Error Flag Bit" mask="0x4" values="INTFLAG__CFGERR" />
          <bitfield name="FIFOERR" caption="FIFO Underrun during Row Write Flag Bit" mask="0x8" values="INTFLAG__FIFOERR" />
          <bitfield name="BUSERR" caption="AHB Bus Error during Row Write Flag Bit" mask="0x10" values="INTFLAG__BUSERR" />
          <bitfield name="WPERR" caption="Write Protection Error Flag Bit" mask="0x20" values="INTFLAG__WPERR" />
          <bitfield name="OPERR" caption="NVMOP Error Flag Bit" mask="0x40" values="INTFLAG__OPERR" />
          <bitfield name="HTDPGM" caption="High Temperature Detect Error Flag Bit" mask="0x100" values="INTFLAG__HTDPGM" />
          <bitfield name="RSTERR" caption="Reset or Brown Out Detect Error Flag Bit" mask="0x1000" values="INTFLAG__RSTERR" />
          <bitfield name="WRERR" caption="Write Error Flag Bit" mask="0x2000" values="INTFLAG__WRERR" />
        </register>
        <register name="INTFLAGSET" offset="0x18" rw="RW" size="4" atomic-op="clear:INTFLAGSET" initval="0x00000000" caption="Interrupt Flag Set REGISTER">
          <bitfield name="DONE" caption="NVM Operation Done Set Flag Bit" mask="0x1" values="INTFLAGSET__DONE" />
          <bitfield name="KEYERR" caption="Key Error Set Flag Bit" mask="0x2" values="INTFLAGSET__KEYERR" />
          <bitfield name="CFGERR" caption="Configuration Error Set Flag Bit" mask="0x4" values="INTFLAGSET__CFGERR" />
          <bitfield name="FIFOERR" caption="FIFO Underrun during Row Write Set Flag Bit" mask="0x8" values="INTFLAGSET__FIFOERR" />
          <bitfield name="BUSERR" caption="AHB Bus Error during Row Write Set Flag Bit" mask="0x10" values="INTFLAGSET__BUSERR" />
          <bitfield name="WPERR" caption="Write Protection Error Set Flag Bit" mask="0x20" values="INTFLAGSET__WPERR" />
          <bitfield name="OPERR" caption="NVMOP Error Set Flag Bit" mask="0x40" values="INTFLAGSET__OPERR" />
          <bitfield name="HTDPGM" caption="High Temperature Detect Error Set Flag Bit" mask="0x100" values="INTFLAGSET__HTDPGM" />
          <bitfield name="RSTERR" caption="Reset or Brown Out Detect Error Set Flag Bit" mask="0x1000" values="INTFLAGSET__RSTERR" />
          <bitfield name="WRERR" caption="Write Error Set Flag Bit" mask="0x2000" values="INTFLAGSET__WRERR" />
        </register>
        <register name="STATUS" offset="0x1C" rw="R" size="4" initval="0x00000000" caption="Status REGISTER">
          <bitfield name="BUSY" caption="NVM Busy Status" mask="0x1" values="STATUS__BUSY" />
          <bitfield name="HTDRDY" caption="High Temp Detect Ready Status" mask="0x100" values="STATUS__HTDRDY" />
        </register>
