zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_sg_gc/pic32cm_sg00/atdf/PIC32CM5112SG00064.atdf
        <register name="KEY" offset="0x20" rw="RW" size="4" initval="0x00000000" caption="Feature Unlock Key REGISTER">
          <bitfield name="FEATURE" caption="Feature Select" mask="0xFF" values="KEY__FEATURE" />
          <bitfield name="CODE" caption="Unlock Code" mask="0xFFFFFF00" />
        </register>
        <register name="ADDR" offset="0x24" rw="RW" size="4" initval="0x00000000" caption="Flash Destination Address REGISTER">
          <bitfield name="ADDR" caption="Flash Address used by NVMOP" mask="0xFFFFFFFF" />
        </register>
        <register name="SRCADDR" offset="0x28" rw="RW" size="4" initval="0x00000000" caption="System Source Address REGISTER">
          <bitfield name="SRCADDR" caption="Source Data (Word) Address" mask="0xFFFFFFFF" />
        </register>
        <register name="DATA" offset="0x2C" rw="RW" size="4" count="4" initval="0x00000000" caption="Flash Write Data n REGISTER">
          <bitfield name="DATA" caption="Flash Write Data" mask="0xFFFFFFFF" />
        </register>
        <register name="SWAP" offset="0x4C" rw="RW" size="4" initval="0x00000000" caption="NVM Panel Swap REGISTER">
          <bitfield name="BFSWAP" caption="BFM Swap Status/Control Bit" mask="0x1" values="SWAP__BFSWAP" />
          <bitfield name="BFSLOCK" caption="BFM Swap Lock Bit" mask="0x2" values="SWAP__BFSLOCK" />
          <bitfield name="PFSWAP" caption="PFM Swap Status/Control Bit" mask="0x100" values="SWAP__PFSWAP" />
          <bitfield name="PFSLOCK" caption="PFM Swap Lock Bit" mask="0x200" values="SWAP__PFSLOCK" />
        </register>
        <register name="PWP" offset="0x50" rw="RW" size="4" count="4" initval="0x00000000" caption="PFM Write Protect Region n REGISTER">
          <bitfield name="PWPSIZE" caption="PWP Size in 4KB pages" mask="0x7F" />
          <bitfield name="PWPMIR" caption="Mirror PWP bit" mask="0x2000" values="PWP__PWPMIR" />
          <bitfield name="PWPLOCK" caption="PWP Lock Bit" mask="0x4000" values="PWP__PWPLOCK" />
          <bitfield name="PWPEN" caption="PWP Enable Bit" mask="0x8000" values="PWP__PWPEN" />
          <bitfield name="PWPBASE" caption="PWP Base Address - 4KB Page Aligned" mask="0x7F0000" />
        </register>
        <register name="LBWP" offset="0x70" rw="RW" size="4" initval="0x00000003" caption="Lower BFM Write Protect REGISTER">
          <bitfield name="LBWP" caption="Lower Boot Pages Write Protect Bits" mask="0x3" values="LBWP__LBWP" />
          <bitfield name="LBWPLOCK" caption="LBWP Lock Bit" mask="0x80000000" values="LBWP__LBWPLOCK" />
        </register>
        <register name="UBWP" offset="0x74" rw="RW" size="4" initval="0x00000003" caption="Upper BFM Write Protect REGISTER">
          <bitfield name="UBWP" caption="Upper Boot Pages Write Protect Bits" mask="0x3" values="UBWP__UBWP" />
          <bitfield name="UBWPLOCK" caption="UBWP Lock Bit" mask="0x80000000" values="UBWP__UBWPLOCK" />
        </register>
        <register name="UOWP" offset="0x78" rw="RW" size="4" initval="0x0000000F" caption="User OTP Write protection REGISTER">
          <bitfield name="UO1WPR" caption="User OTP Page 1 Write Protect Row Bit" mask="0xF" values="UOWP__UO1WPR" />
          <bitfield name="UO1WPRLOCK" caption="User OTP Page 1 WP Row Lock Bit" mask="0xF0000" values="UOWP__UO1WPRLOCK" />
        </register>
        <register name="CWP" offset="0x7C" rw="RW" size="4" initval="0x08C008FD" caption="CFM Page Write Protect REGISTER">
          <bitfield name="BC1AWP" caption="Panel 1 Write Protect BootCfg1A" mask="0x1" values="CWP__BC1AWP" />
          <bitfield name="BC1WP" caption="Panel 1 Write Protect BootCfg1" mask="0x4" values="CWP__BC1WP" />
          <bitfield name="RCWP" caption="Panel 1 Write Protect ROMCfg" mask="0x8" values="CWP__RCWP" />
          <bitfield name="VSSWP0" caption="Panel 1 Write Protect VSSn" mask="0x10" values="CWP__VSSWP" />
          <bitfield name="VSSWP1" caption="Panel 1 Write Protect VSSn" mask="0x20" values="CWP__VSSWP" />
          <bitfield name="TWP" caption="Panel 1 Write Protect Test" mask="0x40" values="CWP__TWP" />
          <bitfield name="COWP" caption="Panel 1 Write Protect CalOTP" mask="0x80" values="CWP__COWP" />
          <bitfield name="BC1AWPLOCK" caption="Panel 1 Lock Write Protection BootCfg1A" mask="0x10000" values="CWP__BC1AWPLOCK" />
          <bitfield name="BC1WPLOCK" caption="Panel 1 Lock Write Protection BootCfg1" mask="0x40000" values="CWP__BC1WPLOCK" />
          <bitfield name="RCWPLOCK" caption="Panel 1 Lock Write Protection ROMCfg" mask="0x80000" values="CWP__RCWPLOCK" />
          <bitfield name="VSSWPLOCK0" caption="Panel 1 Lock Write Protection VSSn" mask="0x100000" values="CWP__VSSWPLOCK" />
          <bitfield name="VSSWPLOCK1" caption="Panel 1 Lock Write Protection VSSn" mask="0x200000" values="CWP__VSSWPLOCK" />
          <bitfield name="TWPLOCK" caption="Panel 1 Lock Write Protection Test" mask="0x400000" values="CWP__TWPLOCK" />
          <bitfield name="COWPLOCK" caption="Panel 1 Lock Write Protection CalOTP" mask="0x800000" values="CWP__COWPLOCK" />
        </register>
      </register-group>
      <value-group name="CTRLA__PRIV">
        <value name="DISABLE" caption="Macro register accessible in privileged and unprivileged accesses." value="0" />
        <value name="ENABLE" caption="Macro registers only accessible in privileged accesses" value="1" />
      </value-group>
      <value-group name="CTRLOP__NVMOP">
        <value name="NOP" caption="No Operation" value="0" />
        <value name="SINGLEWRITE" caption="Single (Word) Program Operation: Programs word selected by ADDR" value="1" />
        <value name="QUADWRITE" caption="Quad (Word) Program Operation: Programs flash word selected by ADDR" value="2" />
        <value name="ROWWRITE" caption="Row Write Operation: Programs row selected by ADDR" value="3" />
        <value name="PAGEERASE" caption="Page Erase Operation: Erases page selected by ADDR" value="4" />
        <value name="LPFMERASE" caption="Lower PFM Erase Operation: (RSVD NVMOP for Single Panel Devices)" value="5" />
        <value name="UPFMERASE" caption="Upper PFM Erase Operation: (RSVD NVMOP for Single Panel Devices)" value="6" />
        <value name="PFMERASE" caption="PFM Erase Operation: Upper &amp;amp; Lower PFM Erase" value="7" />
        <value name="CE" caption="Chip Erase Operation: Erases PFM+SRF, BFM, CFM (except for CalOTP, Test, VSS pages if HSM is Present, UserOTP, &amp;amp; ROMCFG)." value="14" />
      </value-group>
