zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_sg_gc/pic32cm_sg00/atdf/PIC32CM5112SG00064.atdf
            <register name="PAC_WRCTRL_H2PB0" offset="0x830" rw="RW" size="4" initval="0x00000013" caption="Write Control Register">
            <bitfield name="PERID" caption="Peripheral Identifier" mask="0xFF" />
            <bitfield name="KEY" caption="Peripheral Access Control Key" mask="0xFF0000" values="PAC_WRCTRL_H2PB0__KEY" />
            </register>
            <register name="H2PB1_NONSECCLRA" offset="0x834" rw="RW" size="4" initval="0xFFFFFFFF" caption="Non-Security Clear Register A">
            <bitfield name="NONSEC0" caption="non-security bit for APB Slave k, k=0..31" mask="0x1" />
            <bitfield name="NONSEC1" caption="non-security bit for APB Slave k, k=0..31" mask="0x2" />
            <bitfield name="NONSEC2" caption="non-security bit for APB Slave k, k=0..31" mask="0x4" />
            <bitfield name="NONSEC3" caption="non-security bit for APB Slave k, k=0..31" mask="0x8" />
            <bitfield name="NONSEC4" caption="non-security bit for APB Slave k, k=0..31" mask="0x10" />
            <bitfield name="NONSEC5" caption="non-security bit for APB Slave k, k=0..31" mask="0x20" />
            <bitfield name="NONSEC6" caption="non-security bit for APB Slave k, k=0..31" mask="0x40" />
            <bitfield name="NONSEC7" caption="non-security bit for APB Slave k, k=0..31" mask="0x80" />
            <bitfield name="NONSEC8" caption="non-security bit for APB Slave k, k=0..31" mask="0x100" />
            <bitfield name="NONSEC9" caption="non-security bit for APB Slave k, k=0..31" mask="0x200" />
            <bitfield name="NONSEC10" caption="non-security bit for APB Slave k, k=0..31" mask="0x400" />
            <bitfield name="NONSEC11" caption="non-security bit for APB Slave k, k=0..31" mask="0x800" />
            <bitfield name="NONSEC12" caption="non-security bit for APB Slave k, k=0..31" mask="0x1000" />
            <bitfield name="NONSEC13" caption="non-security bit for APB Slave k, k=0..31" mask="0x2000" />
            <bitfield name="NONSEC14" caption="non-security bit for APB Slave k, k=0..31" mask="0x4000" />
            <bitfield name="NONSEC15" caption="non-security bit for APB Slave k, k=0..31" mask="0x8000" />
            <bitfield name="NONSEC16" caption="non-security bit for APB Slave k, k=0..31" mask="0x10000" />
            <bitfield name="NONSEC17" caption="non-security bit for APB Slave k, k=0..31" mask="0x20000" />
            <bitfield name="NONSEC18" caption="non-security bit for APB Slave k, k=0..31" mask="0x40000" />
            <bitfield name="NONSEC19" caption="non-security bit for APB Slave k, k=0..31" mask="0x80000" />
            <bitfield name="NONSEC20" caption="non-security bit for APB Slave k, k=0..31" mask="0x100000" />
            <bitfield name="NONSEC21" caption="non-security bit for APB Slave k, k=0..31" mask="0x200000" />
            <bitfield name="NONSEC22" caption="non-security bit for APB Slave k, k=0..31" mask="0x400000" />
            <bitfield name="NONSEC23" caption="non-security bit for APB Slave k, k=0..31" mask="0x800000" />
            <bitfield name="NONSEC24" caption="non-security bit for APB Slave k, k=0..31" mask="0x1000000" />
            <bitfield name="NONSEC25" caption="non-security bit for APB Slave k, k=0..31" mask="0x2000000" />
            <bitfield name="NONSEC26" caption="non-security bit for APB Slave k, k=0..31" mask="0x4000000" />
            <bitfield name="NONSEC27" caption="non-security bit for APB Slave k, k=0..31" mask="0x8000000" />
            <bitfield name="NONSEC28" caption="non-security bit for APB Slave k, k=0..31" mask="0x10000000" />
            <bitfield name="NONSEC29" caption="non-security bit for APB Slave k, k=0..31" mask="0x20000000" />
            <bitfield name="NONSEC30" caption="non-security bit for APB Slave k, k=0..31" mask="0x40000000" />
            <bitfield name="NONSEC31" caption="non-security bit for APB Slave k, k=0..31" mask="0x80000000" />
            </register>
            <register name="H2PB1_NONSECSETA" offset="0x838" rw="RW" size="4" initval="0x00000000" caption="Non-Security SET Register A">
            <bitfield name="NONSEC0" caption="non-security bit for APB Slave k, k=0..31" mask="0x1" />
            <bitfield name="NONSEC1" caption="non-security bit for APB Slave k, k=0..31" mask="0x2" />
            <bitfield name="NONSEC2" caption="non-security bit for APB Slave k, k=0..31" mask="0x4" />
            <bitfield name="NONSEC3" caption="non-security bit for APB Slave k, k=0..31" mask="0x8" />
            <bitfield name="NONSEC4" caption="non-security bit for APB Slave k, k=0..31" mask="0x10" />
            <bitfield name="NONSEC5" caption="non-security bit for APB Slave k, k=0..31" mask="0x20" />
            <bitfield name="NONSEC6" caption="non-security bit for APB Slave k, k=0..31" mask="0x40" />
            <bitfield name="NONSEC7" caption="non-security bit for APB Slave k, k=0..31" mask="0x80" />
            <bitfield name="NONSEC8" caption="non-security bit for APB Slave k, k=0..31" mask="0x100" />
            <bitfield name="NONSEC9" caption="non-security bit for APB Slave k, k=0..31" mask="0x200" />
            <bitfield name="NONSEC10" caption="non-security bit for APB Slave k, k=0..31" mask="0x400" />
            <bitfield name="NONSEC11" caption="non-security bit for APB Slave k, k=0..31" mask="0x800" />
            <bitfield name="NONSEC12" caption="non-security bit for APB Slave k, k=0..31" mask="0x1000" />
            <bitfield name="NONSEC13" caption="non-security bit for APB Slave k, k=0..31" mask="0x2000" />
            <bitfield name="NONSEC14" caption="non-security bit for APB Slave k, k=0..31" mask="0x4000" />
            <bitfield name="NONSEC15" caption="non-security bit for APB Slave k, k=0..31" mask="0x8000" />
            <bitfield name="NONSEC16" caption="non-security bit for APB Slave k, k=0..31" mask="0x10000" />
            <bitfield name="NONSEC17" caption="non-security bit for APB Slave k, k=0..31" mask="0x20000" />
            <bitfield name="NONSEC18" caption="non-security bit for APB Slave k, k=0..31" mask="0x40000" />
            <bitfield name="NONSEC19" caption="non-security bit for APB Slave k, k=0..31" mask="0x80000" />
            <bitfield name="NONSEC20" caption="non-security bit for APB Slave k, k=0..31" mask="0x100000" />
            <bitfield name="NONSEC21" caption="non-security bit for APB Slave k, k=0..31" mask="0x200000" />
            <bitfield name="NONSEC22" caption="non-security bit for APB Slave k, k=0..31" mask="0x400000" />
            <bitfield name="NONSEC23" caption="non-security bit for APB Slave k, k=0..31" mask="0x800000" />
            <bitfield name="NONSEC24" caption="non-security bit for APB Slave k, k=0..31" mask="0x1000000" />
            <bitfield name="NONSEC25" caption="non-security bit for APB Slave k, k=0..31" mask="0x2000000" />
            <bitfield name="NONSEC26" caption="non-security bit for APB Slave k, k=0..31" mask="0x4000000" />
            <bitfield name="NONSEC27" caption="non-security bit for APB Slave k, k=0..31" mask="0x8000000" />
            <bitfield name="NONSEC28" caption="non-security bit for APB Slave k, k=0..31" mask="0x10000000" />
            <bitfield name="NONSEC29" caption="non-security bit for APB Slave k, k=0..31" mask="0x20000000" />
            <bitfield name="NONSEC30" caption="non-security bit for APB Slave k, k=0..31" mask="0x40000000" />
            <bitfield name="NONSEC31" caption="non-security bit for APB Slave k, k=0..31" mask="0x80000000" />
            </register>
            <register name="PAC_WRCTRL_H2PB1" offset="0x848" rw="RW" size="4" initval="0x0000002E" caption="Write Control Register">
            <bitfield name="PERID" caption="Peripheral Identifier" mask="0xFF" />
            <bitfield name="KEY" caption="Peripheral Access Control Key" mask="0xFF0000" values="PAC_WRCTRL_H2PB1__KEY" />
            </register>
            <register name="H2PB2_NONSECCLRA" offset="0x84C" rw="RW" size="4" initval="0xFFFFFFFF" caption="Non-Security Clear Register A">
            <bitfield name="NONSEC0" caption="non-security bit for APB Slave k, k=0..31" mask="0x1" />
            <bitfield name="NONSEC1" caption="non-security bit for APB Slave k, k=0..31" mask="0x2" />
            <bitfield name="NONSEC2" caption="non-security bit for APB Slave k, k=0..31" mask="0x4" />
            <bitfield name="NONSEC3" caption="non-security bit for APB Slave k, k=0..31" mask="0x8" />
            <bitfield name="NONSEC4" caption="non-security bit for APB Slave k, k=0..31" mask="0x10" />
            <bitfield name="NONSEC5" caption="non-security bit for APB Slave k, k=0..31" mask="0x20" />
            <bitfield name="NONSEC6" caption="non-security bit for APB Slave k, k=0..31" mask="0x40" />
            <bitfield name="NONSEC7" caption="non-security bit for APB Slave k, k=0..31" mask="0x80" />
            <bitfield name="NONSEC8" caption="non-security bit for APB Slave k, k=0..31" mask="0x100" />
            <bitfield name="NONSEC9" caption="non-security bit for APB Slave k, k=0..31" mask="0x200" />
            <bitfield name="NONSEC10" caption="non-security bit for APB Slave k, k=0..31" mask="0x400" />
            <bitfield name="NONSEC11" caption="non-security bit for APB Slave k, k=0..31" mask="0x800" />
            <bitfield name="NONSEC12" caption="non-security bit for APB Slave k, k=0..31" mask="0x1000" />
            <bitfield name="NONSEC13" caption="non-security bit for APB Slave k, k=0..31" mask="0x2000" />
            <bitfield name="NONSEC14" caption="non-security bit for APB Slave k, k=0..31" mask="0x4000" />
            <bitfield name="NONSEC15" caption="non-security bit for APB Slave k, k=0..31" mask="0x8000" />
            <bitfield name="NONSEC16" caption="non-security bit for APB Slave k, k=0..31" mask="0x10000" />
            <bitfield name="NONSEC17" caption="non-security bit for APB Slave k, k=0..31" mask="0x20000" />
            <bitfield name="NONSEC18" caption="non-security bit for APB Slave k, k=0..31" mask="0x40000" />
            <bitfield name="NONSEC19" caption="non-security bit for APB Slave k, k=0..31" mask="0x80000" />
            <bitfield name="NONSEC20" caption="non-security bit for APB Slave k, k=0..31" mask="0x100000" />
            <bitfield name="NONSEC21" caption="non-security bit for APB Slave k, k=0..31" mask="0x200000" />
            <bitfield name="NONSEC22" caption="non-security bit for APB Slave k, k=0..31" mask="0x400000" />
            <bitfield name="NONSEC23" caption="non-security bit for APB Slave k, k=0..31" mask="0x800000" />
            <bitfield name="NONSEC24" caption="non-security bit for APB Slave k, k=0..31" mask="0x1000000" />
            <bitfield name="NONSEC25" caption="non-security bit for APB Slave k, k=0..31" mask="0x2000000" />
            <bitfield name="NONSEC26" caption="non-security bit for APB Slave k, k=0..31" mask="0x4000000" />
            <bitfield name="NONSEC27" caption="non-security bit for APB Slave k, k=0..31" mask="0x8000000" />
            <bitfield name="NONSEC28" caption="non-security bit for APB Slave k, k=0..31" mask="0x10000000" />
            <bitfield name="NONSEC29" caption="non-security bit for APB Slave k, k=0..31" mask="0x20000000" />
            <bitfield name="NONSEC30" caption="non-security bit for APB Slave k, k=0..31" mask="0x40000000" />
            <bitfield name="NONSEC31" caption="non-security bit for APB Slave k, k=0..31" mask="0x80000000" />
            </register>
            <register name="H2PB2_NONSECSETA" offset="0x850" rw="RW" size="4" initval="0x00000000" caption="Non-Security SET Register A">
            <bitfield name="NONSEC0" caption="non-security bit for APB Slave k, k=0..31" mask="0x1" />
            <bitfield name="NONSEC1" caption="non-security bit for APB Slave k, k=0..31" mask="0x2" />
            <bitfield name="NONSEC2" caption="non-security bit for APB Slave k, k=0..31" mask="0x4" />
            <bitfield name="NONSEC3" caption="non-security bit for APB Slave k, k=0..31" mask="0x8" />
            <bitfield name="NONSEC4" caption="non-security bit for APB Slave k, k=0..31" mask="0x10" />
            <bitfield name="NONSEC5" caption="non-security bit for APB Slave k, k=0..31" mask="0x20" />
            <bitfield name="NONSEC6" caption="non-security bit for APB Slave k, k=0..31" mask="0x40" />
            <bitfield name="NONSEC7" caption="non-security bit for APB Slave k, k=0..31" mask="0x80" />
            <bitfield name="NONSEC8" caption="non-security bit for APB Slave k, k=0..31" mask="0x100" />
            <bitfield name="NONSEC9" caption="non-security bit for APB Slave k, k=0..31" mask="0x200" />
            <bitfield name="NONSEC10" caption="non-security bit for APB Slave k, k=0..31" mask="0x400" />
            <bitfield name="NONSEC11" caption="non-security bit for APB Slave k, k=0..31" mask="0x800" />
            <bitfield name="NONSEC12" caption="non-security bit for APB Slave k, k=0..31" mask="0x1000" />
            <bitfield name="NONSEC13" caption="non-security bit for APB Slave k, k=0..31" mask="0x2000" />
            <bitfield name="NONSEC14" caption="non-security bit for APB Slave k, k=0..31" mask="0x4000" />
            <bitfield name="NONSEC15" caption="non-security bit for APB Slave k, k=0..31" mask="0x8000" />
            <bitfield name="NONSEC16" caption="non-security bit for APB Slave k, k=0..31" mask="0x10000" />
            <bitfield name="NONSEC17" caption="non-security bit for APB Slave k, k=0..31" mask="0x20000" />
            <bitfield name="NONSEC18" caption="non-security bit for APB Slave k, k=0..31" mask="0x40000" />
            <bitfield name="NONSEC19" caption="non-security bit for APB Slave k, k=0..31" mask="0x80000" />
            <bitfield name="NONSEC20" caption="non-security bit for APB Slave k, k=0..31" mask="0x100000" />
            <bitfield name="NONSEC21" caption="non-security bit for APB Slave k, k=0..31" mask="0x200000" />
            <bitfield name="NONSEC22" caption="non-security bit for APB Slave k, k=0..31" mask="0x400000" />
            <bitfield name="NONSEC23" caption="non-security bit for APB Slave k, k=0..31" mask="0x800000" />
            <bitfield name="NONSEC24" caption="non-security bit for APB Slave k, k=0..31" mask="0x1000000" />
            <bitfield name="NONSEC25" caption="non-security bit for APB Slave k, k=0..31" mask="0x2000000" />
            <bitfield name="NONSEC26" caption="non-security bit for APB Slave k, k=0..31" mask="0x4000000" />
            <bitfield name="NONSEC27" caption="non-security bit for APB Slave k, k=0..31" mask="0x8000000" />
            <bitfield name="NONSEC28" caption="non-security bit for APB Slave k, k=0..31" mask="0x10000000" />
            <bitfield name="NONSEC29" caption="non-security bit for APB Slave k, k=0..31" mask="0x20000000" />
            <bitfield name="NONSEC30" caption="non-security bit for APB Slave k, k=0..31" mask="0x40000000" />
            <bitfield name="NONSEC31" caption="non-security bit for APB Slave k, k=0..31" mask="0x80000000" />
            </register>
            <register name="PAC_WRCTRL_H2PB2" offset="0x860" rw="RW" size="4" initval="0x0000002F" caption="Write Control Register">
            <bitfield name="PERID" caption="Peripheral Identifier" mask="0xFF" />
            <bitfield name="KEY" caption="Peripheral Access Control Key" mask="0xFF0000" values="PAC_WRCTRL_H2PB2__KEY" />
            </register>
