zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_sg_gc/pic32cm_sg00/atdf/PIC32CM5112SG00064.atdf
        <value-group name="IDAU_RCTRL_PFMANSC_WATERMARK__CMD">
            <value name="WRSZ" caption="Write IDAU region x Size (RSTATUSB[x].SIZE=ARG)" value="0x5C" />
        </value-group>
        <value-group name="IDAU_RCTRL_DRM_BLOCK__CMD">
            <value name="CLRNONSEC" caption="Clear IDAU region x Non-Secure State of block ARG (RSTATUSB[x].NONSEC[ARG]=0)" value="0x5A" />
            <value name="SETNONSEC" caption="Set IDAU region x Non-Secure State of block ARG (RSTATUSB[x].NONSEC[ARG]=1)" value="0x5B" />
        </value-group>
        <value-group name="IDAU_RCTRL_DRM_WATERMARK__CMD">
            <value name="WRSZ" caption="Write IDAU region x Size (RSTATUSB[x].SIZE=ARG)" value="0x5C" />
        </value-group>
        <value-group name="IDAU_CTRL_EN__CMD">
            <value name="ENABLE" caption="Module Enable" value="0xA501" />
            <value name="DISABLE" caption="Module Disable" value="0xA502" />
        </value-group>
        <value-group name="IDAU_CTRL_WLCK__CMD">
            <value name="WLCK" caption="Write Lock" value="0xA503" />
        </value-group>
        <value-group name="FCW_CWP__BC1AWP">
            <value name="DISABLE" caption="Erase and Write Protection for this Page is Disabled" value="0" />
            <value name="ENABLE" caption="Erase and Write Protection for this Page is Enabled" value="1" />
        </value-group>
        <value-group name="FCW_CWP__BC1WP">
            <value name="DISABLE" caption="Erase and Write Protection for this Page is Disabled" value="0" />
            <value name="ENABLE" caption="Erase and Write Protection for this Page is Enabled" value="1" />
        </value-group>
        <value-group name="FCW_CWP__RCWP">
            <value name="DISABLE" caption="Erase and Write Protection for this Page is Disabled" value="0" />
            <value name="ENABLE" caption="Erase and Write Protection for this Page is Enabled" value="1" />
        </value-group>
        <value-group name="FCW_CWP__VSSWP">
            <value name="DISABLE" caption="Erase and Write Protection for this Page is Disabled" value="0" />
            <value name="ENABLE" caption="Erase and Write Protection for this Page is Enabled" value="1" />
        </value-group>
        <value-group name="FCW_CWP__BC1AWPLOCK">
            <value name="UNLOCKED" caption="The Lock &amp;amp;amp; Write Protect bits for this Page are NOT Locked and can be modified" value="0" />
            <value name="LOCKED" caption="The Lock &amp;amp;amp; Write Protect bits for this Page are Locked and cannot be modified" value="1" />
        </value-group>
        <value-group name="FCW_CWP__BC1WPLOCK">
            <value name="UNLOCKED" caption="The Lock &amp;amp;amp; Write Protect bits for this Page are NOT Locked and can be modified" value="0" />
            <value name="LOCKED" caption="The Lock &amp;amp;amp; Write Protect bits for this Page are Locked and cannot be modified" value="1" />
        </value-group>
        <value-group name="FCW_CWP__RCWPLOCK">
            <value name="UNLOCKED" caption="The Lock &amp;amp;amp; Write Protect bits for this Page are NOT Locked and can be modified" value="0" />
            <value name="LOCKED" caption="The Lock &amp;amp;amp; Write Protect bits for this Page are Locked and cannot be modified" value="1" />
        </value-group>
        <value-group name="FCW_CWP__VSSWPLOCK">
            <value name="UNLOCKED" caption="The Lock &amp;amp;amp; Write Protect bits for this Page are NOT Locked and can be modified" value="0" />
            <value name="LOCKED" caption="The Lock &amp;amp;amp; Write Protect bits for this Page are Locked and cannot be modified" value="1" />
        </value-group>
        <value-group name="FCR_CRP__BC1ARP">
            <value name="DISABLE" caption="Read Protection for this Page is Disabled" value="0" />
            <value name="ENABLE" caption="Read Protection for this Page is Enabled" value="1" />
        </value-group>
        <value-group name="FCR_CRP__BC1RP">
            <value name="DISABLE" caption="Read Protection for this Page is Disabled" value="0" />
            <value name="ENABLE" caption="Read Protection for this Page is Enabled" value="1" />
        </value-group>
        <value-group name="FCR_CRP__RCRP">
            <value name="DISABLE" caption="Read Protection for this Page is Disabled" value="0" />
            <value name="ENABLE" caption="Read Protection for this Page is Enabled" value="1" />
        </value-group>
        <value-group name="FCR_CRP__VSSRP">
            <value name="DISABLE" caption="Read Protection for this Page is Disabled" value="0" />
            <value name="ENABLE" caption="Read Protection for this Page is Enabled" value="1" />
        </value-group>
        <value-group name="FCR_CRP__BC1ARPLOCK">
            <value name="UNLOCKED" caption="The Lock &amp;amp;amp; Read Protect bits for this Page are NOT Locked and can be modified" value="0" />
            <value name="LOCKED" caption="The Lock &amp;amp;amp; Read Protect bits for this Page are Locked and cannot be modified" value="1" />
        </value-group>
        <value-group name="FCR_CRP__BC1RPLOCK">
            <value name="UNLOCKED" caption="The Lock &amp;amp;amp; Read Protect bits for this Page are NOT Locked and can be modified" value="0" />
            <value name="LOCKED" caption="The Lock &amp;amp;amp; Read Protect bits for this Page are Locked and cannot be modified" value="1" />
        </value-group>
        <value-group name="FCR_CRP__RCRPLOCK">
            <value name="UNLOCKED" caption="The Lock &amp;amp;amp; Read Protect bits for this Page are NOT Locked and can be modified" value="0" />
            <value name="LOCKED" caption="The Lock &amp;amp;amp; Read Protect bits for this Page are Locked and cannot be modified" value="1" />
        </value-group>
        <value-group name="FCR_CRP__VSSRPLOCK">
            <value name="UNLOCKED" caption="The Lock &amp;amp;amp; Read Protect bits for this Page are NOT Locked and can be modified" value="0" />
            <value name="LOCKED" caption="The Lock &amp;amp;amp; Read Protect bits for this Page are Locked and cannot be modified" value="1" />
        </value-group>
        <value-group name="FCR_ECCCTRL__ECCCTL">
            <value name="STRICT" caption="ECC Writes with ECC Reads (NVMOP = Single Program Operation disabled)" value="0" />
            <value name="DYNAMIC" caption="Dynamic Writes with Dynamic Reads" value="1" />
            <value name="ECC" caption="ECC Writes with Dynamic Reads (NVMOP = Single Program Operation disabled)" value="2" />
            <value name="DISABLE" caption="Dynamic Writes with No Error Check Reads" value="3" />
        </value-group>
        <value-group name="FCR_ECCCTRL__ECCUNLCK">
            <value name="LOCKED" caption="ECCUNLCK and ECCCTL[1:0] cannot be written" value="0" />
            <value name="UNLOCKED" caption="ECCUNLCK and ECCCTL[1:0] can be written" value="1" />
        </value-group>
        <value-group name="SUPC_BRCFGUSMOR_BOR__HYST_BOR_VDDIO">
            <value name="LOW" caption="Low Hysteresis (default)" value="0" />
            <value name="HIGH" caption="High Hysteresis" value="1" />
        </value-group>
        <value-group name="SUPC_BRCFGUSMOR_BOR__BOR_TRIP_VDDIO">
            <value name="0" caption="1.68V (default)" value="0" />
            <value name="1" caption="2.2V" value="1" />
            <value name="2" caption="2.64V" value="2" />
            <value name="3" caption="2.93V" value="3" />
        </value-group>
        <value-group name="SUPC_BRCFGUSMOR_BOR__HYST_BOR_VDDREG">
            <value name="LOW" caption="Low Hysteresis (default)" value="0" />
            <value name="HIGH" caption="High Hysteresis" value="1" />
        </value-group>
