zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_sg_gc/pic32cm_sg00/atdf/PIC32CM5112SG00064.atdf
      <value-group name="F1RR__RR1DIS">
        <value name="0" caption="FCR maps the redundant page 1 into the address defined by RR1ADDR" value="0" />
        <value name="1" caption="Redundant page 1 mapping is Disabled" value="1" />
      </value-group>
      <value-group name="FCCFG32__PFM_SZ">
        <value name="6" caption="512KB" value="6" />
      </value-group>
      <value-group name="FCCFG32__DRM_SZ">
        <value name="0" caption="Rsvd" value="0" />
        <value name="1" caption="128KB" value="1" />
      </value-group>
      <value-group name="FCCFG32__FPACKAGE">
        <value name="5" caption="48 pins" value="5" />
        <value name="6" caption="64 pins" value="6" />
        <value name="7" caption="Rsvd" value="7" />
        <value name="8" caption="100 pins" value="8" />
      </value-group>
      <value-group name="FCCFG33__ME_HSM">
        <value name="0" caption="Module is Disabled" value="0" />
        <value name="1" caption="Module is Enabled" value="1" />
      </value-group>
      <value-group name="FCCFG33__ME_TCC0">
        <value name="0" caption="Module is Disabled" value="0" />
        <value name="1" caption="Module is Enabled" value="1" />
      </value-group>
      <value-group name="FCCFG33__ME_TCC1">
        <value name="0" caption="Module is Disabled" value="0" />
        <value name="1" caption="Module is Enabled" value="1" />
      </value-group>
      <value-group name="FCCFG33__ME_TCC2">
        <value name="0" caption="Module is Disabled" value="0" />
        <value name="1" caption="Module is Enabled" value="1" />
      </value-group>
      <value-group name="FCCFG33__ME_TCC3">
        <value name="0" caption="Module is Disabled" value="0" />
        <value name="1" caption="Module is Enabled" value="1" />
      </value-group>
      <value-group name="FCCFG33__ME_TCC4">
        <value name="0" caption="Module is Disabled" value="0" />
        <value name="1" caption="Module is Enabled" value="1" />
      </value-group>
      <value-group name="FCCFG33__ME_TCC5">
        <value name="0" caption="Module is Disabled" value="0" />
        <value name="1" caption="Module is Enabled" value="1" />
      </value-group>
      <value-group name="FCCFG33__ME_TCC6">
        <value name="0" caption="Module is Disabled" value="0" />
        <value name="1" caption="Module is Enabled" value="1" />
      </value-group>
      <value-group name="FCCFG33__ME_SERCOM0">
        <value name="0" caption="Module is Disabled" value="0" />
        <value name="1" caption="Module is Enabled" value="1" />
      </value-group>
      <value-group name="FCCFG33__ME_SERCOM1">
        <value name="0" caption="Module is Disabled" value="0" />
        <value name="1" caption="Module is Enabled" value="1" />
      </value-group>
      <value-group name="FCCFG33__ME_SERCOM2">
        <value name="0" caption="Module is Disabled" value="0" />
        <value name="1" caption="Module is Enabled" value="1" />
      </value-group>
      <value-group name="FCCFG33__ME_SERCOM3">
        <value name="0" caption="Module is Disabled" value="0" />
        <value name="1" caption="Module is Enabled" value="1" />
      </value-group>
      <value-group name="FCCFG33__ME_SERCOM4">
        <value name="0" caption="Module is Disabled" value="0" />
        <value name="1" caption="Module is Enabled" value="1" />
      </value-group>
      <value-group name="FCCFG33__ME_SERCOM5">
        <value name="0" caption="Module is Disabled" value="0" />
        <value name="1" caption="Module is Enabled" value="1" />
      </value-group>
      <value-group name="FCCFG33__ME_PTC">
        <value name="0" caption="Module is Disabled" value="0" />
        <value name="1" caption="Module is Enabled" value="1" />
      </value-group>
      <value-group name="FCCFG34__ME_CAN0">
        <value name="0" caption="Module is Disabled" value="0" />
        <value name="1" caption="Module is Enabled" value="1" />
      </value-group>
      <value-group name="FCCFG34__ME_CAN1">
        <value name="0" caption="Module is Disabled" value="0" />
        <value name="1" caption="Module is Enabled" value="1" />
      </value-group>
      <value-group name="FCCFG34__ME_USBFS">
        <value name="0" caption="Module is Disabled" value="0" />
        <value name="1" caption="Module is Enabled" value="1" />
      </value-group>
      <value-group name="FCCFG34__ME_DPA">
        <value name="0" caption="DPA is Disabled" value="0" />
        <value name="1" caption="DPA functions in HSM is Operational" value="1" />
      </value-group>
      <value-group name="FCCFG34__ME_TRAM">
        <value name="0" caption="Module is Disabled" value="0" />
        <value name="1" caption="Module is Enabled" value="1" />
      </value-group>
      <value-group name="FCCFG34__ME_PUF">
        <value name="0" caption="Module is Disabled" value="0" />
        <value name="1" caption="Module is Enabled" value="1" />
      </value-group>
      <value-group name="FCCFG49__RAMC_EMAW">
        <value name="0" caption="Slowest Access" value="0" />
        <value name="1" caption="" value="1" />
        <value name="2" caption="" value="2" />
        <value name="3" caption="Fastest Access; Default (reset)" value="3" />
      </value-group>
      <value-group name="FCCFG49__RAMC_EMA">
        <value name="0" caption="" value="0" />
        <value name="1" caption="" value="1" />
        <value name="2" caption="Slowest Access" value="2" />
        <value name="3" caption="" value="3" />
        <value name="4" caption="" value="4" />
        <value name="5" caption="Fastest Access" value="5" />
        <value name="6" caption="" value="6" />
        <value name="7" caption="Default (reset)" value="7" />
      </value-group>
      <value-group name="FCCFG49__TRAM_EMAS">
        <value name="0" caption="Sense Amp Pulse Not Extended" value="0" />
        <value name="1" caption="Sense Amp Pulse Extended; Default (reset)" value="1" />
      </value-group>
      <value-group name="FCCFG49__PUF_EMAS">
        <value name="0" caption="Sense Amp Pulse Not Extended" value="0" />
        <value name="1" caption="Sense Amp Pulse Extended; Default (reset)" value="1" />
      </value-group>
      <value-group name="FCCFG56__BRINGOSC">
        <value name="0" caption="Ring oscillator depth is default (DLY0)" value="0" />
        <value name="1" caption="Ring oscillator depth is default + 1 ORDLY15 (DLY1)" value="1" />
        <value name="2" caption="Ring oscillator depth is default + 2 ORDLY15 (DLY2)" value="2" />
        <value name="3" caption="Ring oscillator depth is default + 3 ORDLY15 (DLY3)" value="3" />
      </value-group>
      <value-group name="FCCFG56__VLP2FPST">
        <value name="0" caption="5us -32 clock cycles based on 6Mhz clock (5US)" value="0" />
        <value name="1" caption="10us -64 clock cycles based on 6Mhz clock (10US)" value="1" />
        <value name="2" caption="21us -128 clock cycles based on 6Mhz clock (21US)" value="2" />
        <value name="3" caption="1.3us -8 clock cycles based on 6Mhz clock (1US)" value="3" />
      </value-group>
      <value-group name="FCCFG56__VLPMST">
        <value name="0" caption="1.3us -8 clock cycles based on 6Mhz clock (1US)" value="0" />
        <value name="1" caption="2.6us -16 clock cycles based on 6Mhz clock (2US)" value="1" />
        <value name="2" caption="5us -32 clock cycles based on 6Mhz clock (5US)" value="2" />
        <value name="3" caption="0.166us -1 clock cycles based on 6Mhz clock (0US)" value="3" />
      </value-group>
      <value-group name="FCCFG56__VTONST">
        <value name="0" caption="31us -192 clock cycles based on 6Mhz clock (31US)" value="0" />
        <value name="1" caption="42us -256 clock cycles based on 6Mhz clock (42US)" value="1" />
        <value name="2" caption="84us -512 clock cycles based on 6Mhz clock (84US)" value="2" />
        <value name="3" caption="10.6us -64 clock cycles based on 6Mhz clock (10US)" value="3" />
      </value-group>
      <value-group name="FCCFG56__VPDDST">
        <value name="0" caption="21us -128 clock cycles based on 6Mhz clock (21US)" value="0" />
        <value name="1" caption="42us -256 clock cycles based on 6Mhz clock (42US)" value="1" />
        <value name="2" caption="84us -512 clock cycles based on 6Mhz clock (84US)" value="2" />
        <value name="3" caption="10.6us -64 clock cycles based on 6Mhz clock (10US)" value="3" />
      </value-group>
