zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_sg_gc/pic32cm_sg00/atdf/PIC32CM5112SG00064.atdf
      <value-group name="FCCFG56__VDVSST">
        <value name="0" caption="32us -192 clock cycles based on 6Mhz clock (32US)" value="0" />
        <value name="1" caption="42us -256 clock cycles based on 6Mhz clock (42US)" value="1" />
        <value name="2" caption="84us -512 clock cycles based on 6Mhz clock (84US)" value="2" />
        <value name="3" caption="10us -64 clock cycles based on 6Mhz clock (10US)" value="3" />
      </value-group>
      <value-group name="FCCFG57__IGNACK">
        <value name="0" caption="Power Switch acknowledge signal is taken into account when entering/exiting retention mode. According to the DLYVAL field, a supplementary delay is also added (from 0 to 127 digital ring oscillator period)" value="0" />
        <value name="1" caption="Power Switch acknowledge signal is ignored when entering/exiting retention mode, and is replaced by a overflow counter signal clocked on internal digital ring oscillator. The overflow counter is programmable by using the DLYVAL field" value="1" />
      </value-group>
      <value-group name="FCCFG58__BRINGOSC">
        <value name="0" caption="Ring Oscillator depth is default (DLY0)" value="0" />
        <value name="1" caption="Ring Oscillator depth is default + 1 ORDLY15 (DLY1)" value="1" />
        <value name="2" caption="Ring Oscillator depth is default + 2 ORDLU15 (DLY2)" value="2" />
        <value name="3" caption="Ring Oscillator depth is default + 3 ORDLY15 (DLY3)" value="3" />
      </value-group>
      <value-group name="FCCFG59__IDAU_EN">
        <value name="0" caption="GC device. All IDAU regions exempt. The boot code will initialize the IDAU, H2PB and PAC as described in Section 2.9.2" value="0" />
        <value name="1" caption="IDAU regions enabled. The boot code will initialize the IDAU, H2PB and PAC to the values set by customer and referred to in USERCFG as described in Section 2.9.3" value="1" />
      </value-group>
    </module>
    <module name="GCLK" id="03588" name2="clk_gclk_u2122_v1" version="1d0" caption="Generic Clock Generator">
      <register-group name="GCLK" caption="Generic Clock Generator">
        <register name="CTRLA" offset="0x0" rw="RW" access="WSYNC" size="1" initval="0x00" caption="Control">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1" />
        </register>
        <register name="SYNCBUSY" offset="0x4" rw="R" size="4" initval="0x00000000" caption="Synchronization Busy">
          <bitfield name="SWRST" caption="Software Reset Synchronization Busy bit" mask="0x1" />
          <bitfield name="GENCTRL0" caption="Generic Clock Generator Control 0 Synchronization Busy bit" mask="0x4" />
          <bitfield name="GENCTRL1" caption="Generic Clock Generator Control 1 Synchronization Busy bit" mask="0x8" />
          <bitfield name="GENCTRL2" caption="Generic Clock Generator Control 2 Synchronization Busy bit" mask="0x10" />
          <bitfield name="GENCTRL3" caption="Generic Clock Generator Control 3 Synchronization Busy bit" mask="0x20" />
          <bitfield name="GENCTRL4" caption="Generic Clock Generator Control 4 Synchronization Busy bit" mask="0x40" />
          <bitfield name="GENCTRL5" caption="Generic Clock Generator Control 5 Synchronization Busy bit" mask="0x80" />
          <bitfield name="GENCTRL6" caption="Generic Clock Generator Control 6 Synchronization Busy bit" mask="0x100" />
          <bitfield name="GENCTRL7" caption="Generic Clock Generator Control 7 Synchronization Busy bit" mask="0x200" />
          <bitfield name="GENCTRL8" caption="Generic Clock Generator Control 8 Synchronization Busy bit" mask="0x400" />
          <bitfield name="GENCTRL9" caption="Generic Clock Generator Control 9 Synchronization Busy bit" mask="0x800" />
          <bitfield name="GENCTRL10" caption="Generic Clock Generator Control 10 Synchronization Busy bit" mask="0x1000" />
          <bitfield name="GENCTRL11" caption="Generic Clock Generator Control 11 Synchronization Busy bit" mask="0x2000" />
        </register>
        <register name="GENCTRL" offset="0x20" rw="RW" access="WSYNC" size="4" count="12" initval="0x00000000" caption="Generic Clock Generator Control">
          <bitfield name="SRC" caption="Source Select" mask="0xF" values="GENCTRL__SRC" />
          <bitfield name="GENEN" caption="Generic Clock Generator Enable" mask="0x100" />
          <bitfield name="IDC" caption="Improve Duty Cycle" mask="0x200" />
          <bitfield name="OOV" caption="Output Off Value" mask="0x400" />
          <bitfield name="OE" caption="Output Enable" mask="0x800" />
          <bitfield name="DIVSEL" caption="Divide Selection" mask="0x1000" values="GENCTRL__DIVSEL" />
          <bitfield name="RUNSTDBY" caption="Run in Standby" mask="0x2000" />
          <bitfield name="DIV" caption="Division Factor" mask="0xFFFF0000" />
        </register>
        <register name="PCHCTRL" offset="0x80" rw="RW" size="4" count="39" initval="0x00000000" caption="Peripheral Clock Control">
          <bitfield name="GEN" caption="Generic Clock Generator" mask="0xF" values="PCHCTRL__GEN" />
          <bitfield name="CHEN" caption="Channel Enable" mask="0x40" />
          <bitfield name="WRTLOCK" caption="Write Lock" mask="0x80" />
        </register>
      </register-group>
      <value-group name="GENCTRL__SRC">
        <value name="XOSC" caption="XOSC oscillator output" value="0x00" />
        <value name="GCLK_IN" caption="Generator input pad (GCLK_IO)" value="0x01" />
        <value name="GCLK_GEN1" caption="Generic clock generator 1 output" value="0x02" />
        <value name="OSCULP32K" caption="OSCULP32K oscillator output" value="0x03" />
        <value name="XOSC32K" caption="XOSC32K oscillator output" value="0x04" />
        <value name="DFLL48M" caption="DFLL oscillator output" value="0x05" />
        <value name="PLL0_CLKOUT1" caption="PLL 0 port CLKOUT1" value="0x06" />
        <value name="PLL0_CLKOUT2" caption="PLL 0 port CLKOUT2" value="0x07" />
        <value name="PLL0_CLKOUT3" caption="PLL 0 port CLKOUT3" value="0x08" />
        <value name="PLL0_CLKOUT4" caption="PLL 0 port CLKOUT4" value="0x09" />
        <value name="PLL0_CLKOUT5" caption="PLL 0 port CLKOUT5" value="0x0A" />
      </value-group>
      <value-group name="GENCTRL__DIVSEL">
        <value name="DIV1" caption="Divide input directly by divider factor" value="0" />
        <value name="DIV2" caption="Divide input by 2^(divider factor+ 1)" value="1" />
      </value-group>
      <value-group name="PCHCTRL__GEN">
        <value name="GCLK0" caption="Generic clock generator 0" value="0x0" />
        <value name="GCLK1" caption="Generic clock generator 1" value="0x1" />
        <value name="GCLK2" caption="Generic clock generator 2" value="0x2" />
        <value name="GCLK3" caption="Generic clock generator 3" value="0x3" />
        <value name="GCLK4" caption="Generic clock generator 4" value="0x4" />
        <value name="GCLK5" caption="Generic clock generator 5" value="0x5" />
        <value name="GCLK6" caption="Generic clock generator 6" value="0x6" />
        <value name="GCLK7" caption="Generic clock generator 7" value="0x7" />
        <value name="GCLK8" caption="Generic clock generator 8" value="0x8" />
        <value name="GCLK9" caption="Generic clock generator 9" value="0x9" />
        <value name="GCLK10" caption="Generic clock generator 10" value="0xA" />
        <value name="GCLK11" caption="Generic clock generator 11" value="0xB" />
      </value-group>
    </module>
    <module name="H2PB" id="04947" name2="bus_ahb2apb_v1" version="1a0" caption="AHB To APB Bridge">
      <register-group name="H2PB" caption="AHB To APB Bridge">
        <register name="CTRLA" offset="0x0" rw="RW" size="4" initval="0x00000000" caption="H2PB CONTROL Register">
          <bitfield name="PRIV" caption="PRIV privileged access protection bit" mask="0x4" />
          <bitfield name="SECEN" caption="SECEN security enable bit" mask="0x8" />
        </register>
        <register name="NONSECCLRA" offset="0x8" rw="RW" size="4" atomic-op="clear:NONSECCLRA" initval="0x00000000" caption="Non-Security Clear Register A">
          <bitfield name="NONSEC0" caption="non-security bit for APB Slave k, k=0..31" mask="0x1" />
          <bitfield name="NONSEC1" caption="non-security bit for APB Slave k, k=0..31" mask="0x2" />
          <bitfield name="NONSEC2" caption="non-security bit for APB Slave k, k=0..31" mask="0x4" />
          <bitfield name="NONSEC3" caption="non-security bit for APB Slave k, k=0..31" mask="0x8" />
          <bitfield name="NONSEC4" caption="non-security bit for APB Slave k, k=0..31" mask="0x10" />
          <bitfield name="NONSEC5" caption="non-security bit for APB Slave k, k=0..31" mask="0x20" />
          <bitfield name="NONSEC6" caption="non-security bit for APB Slave k, k=0..31" mask="0x40" />
          <bitfield name="NONSEC7" caption="non-security bit for APB Slave k, k=0..31" mask="0x80" />
          <bitfield name="NONSEC8" caption="non-security bit for APB Slave k, k=0..31" mask="0x100" />
          <bitfield name="NONSEC9" caption="non-security bit for APB Slave k, k=0..31" mask="0x200" />
          <bitfield name="NONSEC10" caption="non-security bit for APB Slave k, k=0..31" mask="0x400" />
          <bitfield name="NONSEC11" caption="non-security bit for APB Slave k, k=0..31" mask="0x800" />
          <bitfield name="NONSEC12" caption="non-security bit for APB Slave k, k=0..31" mask="0x1000" />
          <bitfield name="NONSEC13" caption="non-security bit for APB Slave k, k=0..31" mask="0x2000" />
          <bitfield name="NONSEC14" caption="non-security bit for APB Slave k, k=0..31" mask="0x4000" />
          <bitfield name="NONSEC15" caption="non-security bit for APB Slave k, k=0..31" mask="0x8000" />
          <bitfield name="NONSEC16" caption="non-security bit for APB Slave k, k=0..31" mask="0x10000" />
          <bitfield name="NONSEC17" caption="non-security bit for APB Slave k, k=0..31" mask="0x20000" />
          <bitfield name="NONSEC18" caption="non-security bit for APB Slave k, k=0..31" mask="0x40000" />
          <bitfield name="NONSEC19" caption="non-security bit for APB Slave k, k=0..31" mask="0x80000" />
          <bitfield name="NONSEC20" caption="non-security bit for APB Slave k, k=0..31" mask="0x100000" />
          <bitfield name="NONSEC21" caption="non-security bit for APB Slave k, k=0..31" mask="0x200000" />
          <bitfield name="NONSEC22" caption="non-security bit for APB Slave k, k=0..31" mask="0x400000" />
          <bitfield name="NONSEC23" caption="non-security bit for APB Slave k, k=0..31" mask="0x800000" />
          <bitfield name="NONSEC24" caption="non-security bit for APB Slave k, k=0..31" mask="0x1000000" />
          <bitfield name="NONSEC25" caption="non-security bit for APB Slave k, k=0..31" mask="0x2000000" />
          <bitfield name="NONSEC26" caption="non-security bit for APB Slave k, k=0..31" mask="0x4000000" />
          <bitfield name="NONSEC27" caption="non-security bit for APB Slave k, k=0..31" mask="0x8000000" />
          <bitfield name="NONSEC28" caption="non-security bit for APB Slave k, k=0..31" mask="0x10000000" />
          <bitfield name="NONSEC29" caption="non-security bit for APB Slave k, k=0..31" mask="0x20000000" />
          <bitfield name="NONSEC30" caption="non-security bit for APB Slave k, k=0..31" mask="0x40000000" />
          <bitfield name="NONSEC31" caption="non-security bit for APB Slave k, k=0..31" mask="0x80000000" />
        </register>
