zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_sg_gc/pic32cm_sg00/atdf/PIC32CM5112SG00064.atdf
        <register name="NONSECSETA" offset="0xC" rw="RW" size="4" atomic-op="set:NONSECSETA" initval="0x00000000" caption="Non-Security SET Register A">
          <bitfield name="NONSEC0" caption="non-security bit for APB Slave k, k=0..31" mask="0x1" />
          <bitfield name="NONSEC1" caption="non-security bit for APB Slave k, k=0..31" mask="0x2" />
          <bitfield name="NONSEC2" caption="non-security bit for APB Slave k, k=0..31" mask="0x4" />
          <bitfield name="NONSEC3" caption="non-security bit for APB Slave k, k=0..31" mask="0x8" />
          <bitfield name="NONSEC4" caption="non-security bit for APB Slave k, k=0..31" mask="0x10" />
          <bitfield name="NONSEC5" caption="non-security bit for APB Slave k, k=0..31" mask="0x20" />
          <bitfield name="NONSEC6" caption="non-security bit for APB Slave k, k=0..31" mask="0x40" />
          <bitfield name="NONSEC7" caption="non-security bit for APB Slave k, k=0..31" mask="0x80" />
          <bitfield name="NONSEC8" caption="non-security bit for APB Slave k, k=0..31" mask="0x100" />
          <bitfield name="NONSEC9" caption="non-security bit for APB Slave k, k=0..31" mask="0x200" />
          <bitfield name="NONSEC10" caption="non-security bit for APB Slave k, k=0..31" mask="0x400" />
          <bitfield name="NONSEC11" caption="non-security bit for APB Slave k, k=0..31" mask="0x800" />
          <bitfield name="NONSEC12" caption="non-security bit for APB Slave k, k=0..31" mask="0x1000" />
          <bitfield name="NONSEC13" caption="non-security bit for APB Slave k, k=0..31" mask="0x2000" />
          <bitfield name="NONSEC14" caption="non-security bit for APB Slave k, k=0..31" mask="0x4000" />
          <bitfield name="NONSEC15" caption="non-security bit for APB Slave k, k=0..31" mask="0x8000" />
          <bitfield name="NONSEC16" caption="non-security bit for APB Slave k, k=0..31" mask="0x10000" />
          <bitfield name="NONSEC17" caption="non-security bit for APB Slave k, k=0..31" mask="0x20000" />
          <bitfield name="NONSEC18" caption="non-security bit for APB Slave k, k=0..31" mask="0x40000" />
          <bitfield name="NONSEC19" caption="non-security bit for APB Slave k, k=0..31" mask="0x80000" />
          <bitfield name="NONSEC20" caption="non-security bit for APB Slave k, k=0..31" mask="0x100000" />
          <bitfield name="NONSEC21" caption="non-security bit for APB Slave k, k=0..31" mask="0x200000" />
          <bitfield name="NONSEC22" caption="non-security bit for APB Slave k, k=0..31" mask="0x400000" />
          <bitfield name="NONSEC23" caption="non-security bit for APB Slave k, k=0..31" mask="0x800000" />
          <bitfield name="NONSEC24" caption="non-security bit for APB Slave k, k=0..31" mask="0x1000000" />
          <bitfield name="NONSEC25" caption="non-security bit for APB Slave k, k=0..31" mask="0x2000000" />
          <bitfield name="NONSEC26" caption="non-security bit for APB Slave k, k=0..31" mask="0x4000000" />
          <bitfield name="NONSEC27" caption="non-security bit for APB Slave k, k=0..31" mask="0x8000000" />
          <bitfield name="NONSEC28" caption="non-security bit for APB Slave k, k=0..31" mask="0x10000000" />
          <bitfield name="NONSEC29" caption="non-security bit for APB Slave k, k=0..31" mask="0x20000000" />
          <bitfield name="NONSEC30" caption="non-security bit for APB Slave k, k=0..31" mask="0x40000000" />
          <bitfield name="NONSEC31" caption="non-security bit for APB Slave k, k=0..31" mask="0x80000000" />
        </register>
      </register-group>
    </module>
    <module name="HMATRIX2" id="bus_hmatrix2_v5" name2="bus_hmatrix2_v5" version="5f0" caption="HSB Matrix">
      <register-group name="PRS" size="0x8">
        <register name="PRAS" offset="0x0" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Priority A for Slave">
          <bitfield name="M0PR" caption="Master 0 Priority" mask="0x3" />
          <bitfield name="LQOSEN0" caption="Latency Quality Of Service Enable for Master 0" mask="0x4" />
          <bitfield name="M1PR" caption="Master 1 Priority" mask="0x30" />
          <bitfield name="LQOSEN1" caption="Latency Quality Of Service Enable for Master 1" mask="0x40" />
          <bitfield name="M2PR" caption="Master 2 Priority" mask="0x300" />
          <bitfield name="LQOSEN2" caption="Latency Quality Of Service Enable for Master 2" mask="0x400" />
          <bitfield name="M3PR" caption="Master 3 Priority" mask="0x3000" />
          <bitfield name="LQOSEN3" caption="Latency Quality Of Service Enable for Master 3" mask="0x4000" />
          <bitfield name="M4PR" caption="Master 4 Priority" mask="0x30000" />
          <bitfield name="LQOSEN4" caption="Latency Quality Of Service Enable for Master 4" mask="0x40000" />
          <bitfield name="M5PR" caption="Master 5 Priority" mask="0x300000" />
          <bitfield name="LQOSEN5" caption="Latency Quality Of Service Enable for Master 5" mask="0x400000" />
        </register>
      </register-group>
      <register-group name="HMATRIX2" caption="HSB Matrix">
        <register name="MCFG" offset="0x0" rw="RW" size="4" access-size="4" count="6" initval="0x00000002" caption="Master Configuration">
          <bitfield name="ULBT" caption="Undefined Length Burst Type" mask="0x7" values="MCFG__ULBT" />
        </register>
        <register name="SCFG" offset="0x40" rw="RW" size="4" access-size="4" count="9" initval="0x00000010" caption="Slave Configuration">
          <bitfield name="SLOT_CYCLE" caption="Maximum Number of Allowed Cycles for a Burst" mask="0x1FF" />
          <bitfield name="DEFMSTR_TYPE" caption="Default Master Type" mask="0x30000" values="SCFG__DEFMSTR_TYPE" />
          <bitfield name="FIXED_DEFMSTR" caption="Fixed Index of Default Master" mask="0x3C0000" />
        </register>
        <register-group name="PRS" name-in-module="PRS" offset="0x080" size="0x8" count="9" />
        <register name="MRCR" offset="0x100" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Master Remap Control">
          <bitfield name="RCB0" caption="Remap Command Bit for Master 0" mask="0x1" values="MRCR__RCB" />
          <bitfield name="RCB1" caption="Remap Command Bit for Master 1" mask="0x2" values="MRCR__RCB" />
          <bitfield name="RCB2" caption="Remap Command Bit for Master 2" mask="0x4" values="MRCR__RCB" />
          <bitfield name="RCB3" caption="Remap Command Bit for Master 3" mask="0x8" values="MRCR__RCB" />
          <bitfield name="RCB4" caption="Remap Command Bit for Master 4" mask="0x10" values="MRCR__RCB" />
          <bitfield name="RCB5" caption="Remap Command Bit for Master 5" mask="0x20" values="MRCR__RCB" />
        </register>
        <register name="SFR" offset="0x110" rw="RW" size="4" access-size="4" count="9" initval="0x00000000" caption="Special Function">
          <bitfield name="SFR" caption="Special Function Register" mask="0xFFFFFFFF" />
        </register>
        <register name="MEIER" offset="0x150" rw="W" size="4" access-size="4" atomic-op="set:MEIMR" caption="Master Error Interrupt Enable">
          <bitfield name="MERR0" caption="Master 0 Access Error" mask="0x1" />
          <bitfield name="MERR1" caption="Master 1 Access Error" mask="0x2" />
          <bitfield name="MERR2" caption="Master 2 Access Error" mask="0x4" />
          <bitfield name="MERR3" caption="Master 3 Access Error" mask="0x8" />
          <bitfield name="MERR4" caption="Master 4 Access Error" mask="0x10" />
          <bitfield name="MERR5" caption="Master 5 Access Error" mask="0x20" />
        </register>
        <register name="MEIDR" offset="0x154" rw="W" size="4" access-size="4" atomic-op="clear:MEIMR" caption="Master Error Interrupt Disable">
          <bitfield name="MERR0" caption="Master 0 Access Error" mask="0x1" />
          <bitfield name="MERR1" caption="Master 1 Access Error" mask="0x2" />
          <bitfield name="MERR2" caption="Master 2 Access Error" mask="0x4" />
          <bitfield name="MERR3" caption="Master 3 Access Error" mask="0x8" />
          <bitfield name="MERR4" caption="Master 4 Access Error" mask="0x10" />
          <bitfield name="MERR5" caption="Master 5 Access Error" mask="0x20" />
        </register>
        <register name="MEIMR" offset="0x158" rw="R" size="4" access-size="4" caption="Master Error Interrupt Mask">
          <bitfield name="MERR0" caption="Master 0 Access Error" mask="0x1" />
          <bitfield name="MERR1" caption="Master 1 Access Error" mask="0x2" />
          <bitfield name="MERR2" caption="Master 2 Access Error" mask="0x4" />
          <bitfield name="MERR3" caption="Master 3 Access Error" mask="0x8" />
          <bitfield name="MERR4" caption="Master 4 Access Error" mask="0x10" />
          <bitfield name="MERR5" caption="Master 5 Access Error" mask="0x20" />
        </register>
        <register name="MESR" offset="0x15C" rw="R" size="4" access-size="4" atomic-op="clear:MESR" caption="Master Error Status">
          <bitfield name="MERR0" caption="Master 0 Access Error" mask="0x1" />
          <bitfield name="MERR1" caption="Master 1 Access Error" mask="0x2" />
          <bitfield name="MERR2" caption="Master 2 Access Error" mask="0x4" />
          <bitfield name="MERR3" caption="Master 3 Access Error" mask="0x8" />
          <bitfield name="MERR4" caption="Master 4 Access Error" mask="0x10" />
          <bitfield name="MERR5" caption="Master 5 Access Error" mask="0x20" />
        </register>
