zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_sg_gc/pic32cm_sg00/atdf/PIC32CM5112SG00064.atdf
        <register name="MEAR" offset="0x160" rw="R" size="4" access-size="4" count="6" caption="Master Error Address" />
      </register-group>
      <value-group name="MCFG__ULBT">
        <value name="INFINITE" caption="Infinite Length" value="0" />
        <value name="SINGLE" caption="Single Access" value="1" />
        <value name="FOUR_BEAT" caption="Four Beat Burst" value="2" />
        <value name="EIGHT_BEAT" caption="Eight Beat Burst" value="3" />
        <value name="SIXTEEN_BEAT" caption="Sixteen Beat Burst" value="4" />
      </value-group>
      <value-group name="SCFG__DEFMSTR_TYPE">
        <value name="NO_DEFAULT" caption="No Default Master. At the end of current slave access, if no other master request is pending, the slave is deconnected from all masters. This resusts in having a one cycle latency for the first transfer of a burst." value="0" />
        <value name="LAST_DEFAULT" caption="Last Default Master At the end of current slave access, if no other master request is pending, the slave stay connected with the last master havingaccessed it.This resusts in not having the one cycle latency when the last master re-trying access on the slave." value="1" />
        <value name="FIXED_DEFAULT" caption="Fixed Default Master At the end of current slave access, if no other master request is pending, the slave connects with fixed master which numberis in FIXED_DEFMSTR register.This resusts in not having the one cycle latency when the fixed master re-trying access on the slave." value="2" />
      </value-group>
      <value-group name="MRCR__RCB">
        <value name="DIS" caption="Disable remapped address decoding for master" value="0" />
        <value name="ENA" caption="Enable remapped address decoding for master" value="1" />
      </value-group>
    </module>
    <module name="HSM" id="04777" name2="sec_cam_lite_v1" version="1a0" caption="Cryptographic Acceleration Module Lite">
      <register-group name="HSM" caption="Cryptographic Acceleration Module Lite">
        <register name="CTRLA" offset="0x0" rw="RW" size="4" initval="0x00000000" caption="Control Register A">
          <bitfield name="SWRST" caption="Software Reset1 = Reset registers and internal state0 = No effect" mask="0x1" />
          <bitfield name="ENABLE" caption="Macro/Clock Enable bit" mask="0x2" values="CTRLA__ENABLE" />
          <bitfield name="PRIV" caption="Privileged Access Only - This bit affects all Wrapper and EIP registers." mask="0x4" values="CTRLA__PRIV" />
          <bitfield name="RUNSTDBY" caption="Run In Standby bit" mask="0x40" values="CTRLA__RUNSTDBY" />
        </register>
        <register name="STATUSA" offset="0x38" rw="R" size="4" initval="0x00000000" caption="STATUS Register A">
          <bitfield name="OTPLOCK" caption="OTP Lock bit" mask="0x1" values="STATUSA__OTPLOCK" />
        </register>
        <register name="SYNCBUSY" offset="0x5C" rw="R" size="4" initval="0x00000000" caption="SYNCBUSY Register">
          <bitfield name="SWRST" caption="Software Reset Synchronization Busy1 = SWRST synchronization is busy0 = SWRST synchronization is NOT busy" mask="0x1" />
          <bitfield name="ENABLE" caption="Macro Enable Synchronization Busy" mask="0x2" values="SYNCBUSY__ENABLE" />
        </register>
        <register name="CryptoMaster_DMA_Registers__FETCH_ADDR_LSB" offset="0x10000" rw="RW" size="4" initval="0x00000000" caption="">
          <bitfield name="FETCH_ADDR_LSB" caption="" mask="0xFFFFFFFF" />
        </register>
        <register name="CryptoMaster_DMA_Registers__FETCH_ADDR_MSB" offset="0x10004" rw="RW" size="4" initval="0x00000000" caption="">
          <bitfield name="FETCH_ADDR_MSB" caption="" mask="0xFFFFFFFF" />
        </register>
        <register name="CryptoMaster_DMA_Registers__FETCH_LEN" offset="0x10008" rw="RW" size="4" initval="0x00000000" caption="">
          <bitfield name="FETCH_LEN" caption="" mask="0xFFFFFFF" />
          <bitfield name="FETCH_CSTADDR" caption="" mask="0x10000000" />
          <bitfield name="FETCH_REALIGN" caption="" mask="0x20000000" />
          <bitfield name="FETCH_ZPADDING" caption="" mask="0x40000000" />
        </register>
        <register name="CryptoMaster_DMA_Registers__FETCH_TAG" offset="0x1000C" rw="RW" size="4" initval="0x00000000" caption="">
          <bitfield name="FETCH_TAG" caption="" mask="0xFFFFFFFF" />
        </register>
        <register name="CryptoMaster_DMA_Registers__PUSH_ADDR_LSB" offset="0x10010" rw="RW" size="4" initval="0x00000000" caption="">
          <bitfield name="PUSH_ADDR_LSB" caption="" mask="0xFFFFFFFF" />
        </register>
        <register name="CryptoMaster_DMA_Registers__PUSH_ADDR_MSB" offset="0x10014" rw="RW" size="4" initval="0x00000000" caption="">
          <bitfield name="PUSH_ADDR_MSB" caption="" mask="0xFFFFFFFF" />
        </register>
        <register name="CryptoMaster_DMA_Registers__PUSH_LEN" offset="0x10018" rw="RW" size="4" initval="0x00000000" caption="">
          <bitfield name="PUSH_LEN" caption="" mask="0xFFFFFFF" />
          <bitfield name="PUSH_CSTADDR" caption="" mask="0x10000000" />
          <bitfield name="PUSH_REALIGN" caption="" mask="0x20000000" />
          <bitfield name="PUSH_DISCARD" caption="" mask="0x40000000" />
        </register>
        <register name="CryptoMaster_DMA_Registers__INT_EN" offset="0x1001C" rw="RW" size="4" initval="0x00000000" caption="">
          <bitfield name="INT_EN" caption="" mask="0x3F" />
        </register>
        <register name="CryptoMaster_DMA_Registers__INT_ENSET" offset="0x10020" rw="W" size="4" atomic-op="set:CryptoMaster_DMA_Registers__INT_EN" initval="0x00000000" caption="">
          <bitfield name="INT_ENSET" caption="" mask="0x3F" />
        </register>
        <register name="CryptoMaster_DMA_Registers__INT_ENCLR" offset="0x10024" rw="W" size="4" atomic-op="clear:CryptoMaster_DMA_Registers__INT_EN" initval="0x00000000" caption="">
          <bitfield name="INT_ENCLR" caption="" mask="0x3F" />
        </register>
