zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_sg_gc/pic32cm_sg00/atdf/PIC32CM5112SG00064.atdf
        <register name="CryptoMaster_DMA_Registers__INT_STATRAW" offset="0x10028" rw="R" size="4" initval="0x00000000" caption="">
          <bitfield name="INT_STATRAW" caption="" mask="0x3F" />
        </register>
        <register name="CryptoMaster_DMA_Registers__INT_STAT" offset="0x1002C" rw="R" size="4" initval="0x00000000" caption="">
          <bitfield name="INT_STAT" caption="" mask="0x3F" />
        </register>
        <register name="CryptoMaster_DMA_Registers__INT_STATCLR" offset="0x10030" rw="W" size="4" atomic-op="clear:CryptoMaster_DMA_Registers__INT_STAT" initval="0x00000000" caption="">
          <bitfield name="INT_STATCLR" caption="" mask="0x3F" />
        </register>
        <register name="CryptoMaster_DMA_Registers__CONFIG" offset="0x10034" rw="RW" size="4" initval="0x00000000" caption="">
          <bitfield name="FETCH_CTRL_INDIRECT" caption="" mask="0x1" />
          <bitfield name="PUSH_CTRL_INDIRECT" caption="" mask="0x2" />
          <bitfield name="FETCH_STOP" caption="" mask="0x4" />
          <bitfield name="PUSH_STOP" caption="" mask="0x8" />
          <bitfield name="SOFT_RST" caption="" mask="0x10" />
        </register>
        <register name="CryptoMaster_DMA_Registers__START" offset="0x10038" rw="W" size="4" initval="0x00000000" caption="">
          <bitfield name="START_FETCH" caption="" mask="0x1" />
          <bitfield name="START_PUSH" caption="" mask="0x2" />
        </register>
        <register name="CryptoMaster_DMA_Registers__STATUS" offset="0x1003C" rw="R" size="4" initval="0x00000000" caption="">
          <bitfield name="FETCH_BUSY" caption="" mask="0x1" />
          <bitfield name="PUSH_BUSY" caption="" mask="0x2" />
          <bitfield name="FETCH_NOT_EMPTY" caption="" mask="0x10" />
          <bitfield name="PUSH_WAITINGFIFO" caption="" mask="0x20" />
          <bitfield name="SOFT_RST_BUSY" caption="" mask="0x40" />
          <bitfield name="PUSH_NBDATA" caption="" mask="0xFFFF0000" />
        </register>
        <register name="CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG" offset="0x10400" rw="R" size="4" initval="0x00000611" caption="">
          <bitfield name="BA411_AES_INCLUDED" caption="Generic g_IncludeAES value. BA411E-AES IP included if set" mask="0x1" />
          <bitfield name="BA415_HP_AES_GCM_INCLUDED" caption="Generic g_IncludeAESGCM value. BA415-HP-AES-GCM IP included if set" mask="0x2" />
          <bitfield name="BA416_HP_AES_XTS_INCLUDED" caption="Generic g_IncludeAESXTS value. BA416-HP-AES-XTS IP included if set" mask="0x4" />
          <bitfield name="BA412_DES_INCLUDED" caption="Generic g_IncludeDES value. BA412-3DES IP included if set" mask="0x8" />
          <bitfield name="BA413_HASH_INCLUDED" caption="Generic g_IncludeHASH value. BA413-HASH IP included if set" mask="0x10" />
          <bitfield name="BA417_CHACHAPOLY_INCLUDED" caption="Generic g_IncludeChachaPoly value. BA417-ChaChaPoly IP included if set" mask="0x20" />
          <bitfield name="BA418_SHA3_INCLUDED" caption="Generic g_IncludeSHA3  value. BA418-SHA3 IP included if set" mask="0x40" />
          <bitfield name="BA421_ZUC_INCLUDED" caption="Generic g_IncludeZUC  value. BA421-ZUC IP included if set" mask="0x80" />
          <bitfield name="BA419_SM4_INCLUDED" caption="Generic g_IncludeSM4  value. BA419-SM4 IP included if set" mask="0x100" />
          <bitfield name="BA414EP_PKE_INCLUDED" caption="Generic g_IncludePKE  value. BA414EP-PKE IP included if set" mask="0x200" />
          <bitfield name="BA431_NDRNG_INCLUDED" caption="Generic g_IncludeNDRNG  value. BA431-NDRNG IP included if set" mask="0x400" />
          <bitfield name="BA420_HP_CHACHAPOLY_INCLUDED" caption="Generic g_IncludeHPChachaPoly  value. BA420-HP-ChaChaPoly IP included if set" mask="0x800" />
          <bitfield name="BA423_SNOW3G_INCLUDED" caption="Generic g_IncludeSnow3G  value. BA423-Snow3G IP included if set" mask="0x1000" />
          <bitfield name="BA422_KASUMI_INCLUDED" caption="Generic g_IncludeKasumi  value. BA422-Kasumi IP included if set" mask="0x2000" />
        </register>
        <register name="CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_1" offset="0x10404" rw="R" size="4" initval="0x1F0301FF" caption="">
          <bitfield name="BA411E_AES_HW_CFG_MODE" caption="Generic g_AesModesPoss value. BA411E-AES engine configuration." mask="0x1FF" />
          <bitfield name="BA411E_AES_HW_CFG_CS" caption="Generic g_CS value. BA411E-AES engine configuration." mask="0x10000" />
          <bitfield name="BA411E_AES_HW_CFG_MASKING" caption="Generic g_UseMasking value. BA411E-AES engine configuration." mask="0x20000" />
          <bitfield name="BA411E_AES_HW_CFG_KEYSIZE" caption="Generic g_Keysize value. BA411E-AES engine configuration." mask="0x7000000" />
          <bitfield name="BA411E_AES_HW_CFG_CXSWITCH" caption="Generic g_CxSwitch value. BA411E-AES engine configuration." mask="0x8000000" />
          <bitfield name="BA411E_AES_HW_CFG_GLITCHPROTECTION" caption="Generic g_GlitchProtection value. BA411E-AES engine configuration." mask="0x10000000" />
        </register>
        <register name="CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_2" offset="0x10408" rw="R" size="4" initval="0x00200080" caption="Generic g_CtrSize value. BA411E-AES engine configuration.">
          <bitfield name="BA411E_AES_HW_CFG_2_CTRSIZE" caption="Generic g_CtrSize value. BA411E-AES engine configuration." mask="0xFFFF" />
          <bitfield name="BA411E_AES_HW_CFG_2_EXTKEYS" caption="Generic g_Ext_nb_AES_keys value. BA411E-AES engine configuration." mask="0xF00000" />
          <bitfield name="BA411E_AES_HW_CFG_2_IKGKEYS" caption="Generic  g_IKG_nb_AES_keys value. BA411E-AES engine configuration." mask="0xF000000" />
        </register>
        <register name="CryptoMaster_HWConf_Registers__BA413_HASH_HW_CFG" offset="0x1040C" rw="R" size="4" initval="0x0013003E" caption="">
          <bitfield name="BA413_HASH_HW_CFG_MASK" caption="Generic g_HashMaskFunc value. BA413-Hash engine configuration." mask="0x7F" />
          <bitfield name="BA413_HASH_HW_CFG_PADDING" caption="Generic g_HashPadding value. BA413-Hash engine configuration." mask="0x10000" />
          <bitfield name="BA413_HASH_HW_CFG_HMAC" caption="Generic g_HMAC_enabled value. BA413-Hash engine configuration." mask="0x20000" />
          <bitfield name="BA413_HASH_HW_CFG_VERIFYDIGEST" caption="Generic g_HashVerifyDigest value. BA413-Hash engine configuration." mask="0x40000" />
          <bitfield name="BA413_HASH_HW_CFG_EXTKEYS" caption="Generic g_Ext_nb_Hash_keys value. BA413-Hash engine configuration." mask="0xF00000" />
          <bitfield name="BA413_HASH_HW_CFG_IKGKEYS" caption="Generic g_IKG_nb_Hash_keys value. BA413-Hash engine configuration." mask="0xF000000" />
        </register>
