zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_sg_gc/pic32cm_sg00/atdf/PIC32CM5112SG00064.atdf
        <register name="PK_Registers__MemOffset" offset="0x12020" rw="RW" size="4" initval="0x00000000" caption="Memory offset register.">
          <bitfield name="MemOffset" caption="Memory offset for AHB Master" mask="0xFFFFFFFF" />
        </register>
        <register name="PK_Registers__MicroCodeOffset" offset="0x12024" rw="RW" size="4" initval="0x00000000" caption="MicroCode offset register.">
          <bitfield name="MicroCodeOffset" caption="MicroCode offset for AHB Master" mask="0xFFFFFFFF" />
        </register>
      </register-group>
      <value-group name="CTRLA__ENABLE">
        <value name="0" caption="HSM clock is not requested and macros is disabled." value="0" />
        <value name="1" caption="HSM clock is requested and macro is enabled." value="1" />
      </value-group>
      <value-group name="CTRLA__PRIV">
        <value name="0" caption="HSM registers accessible in privileged and unprivileged modes. Master Requests are NOT privileged" value="0" />
        <value name="1" caption="HSM registers only accessible in privileged mode.  Master Requests are also privileged." value="1" />
      </value-group>
      <value-group name="CTRLA__RUNSTDBY">
        <value name="0" caption="HSM clock is disabled in Standby Sleep mode, clock requests are de-asserted after any pending bus transactions or requests are completed." value="0" />
        <value name="1" caption="If enabled, the HSM clock remains requested in Standby Sleep mode." value="1" />
      </value-group>
      <value-group name="STATUSA__OTPLOCK">
        <value name="1" caption="OTP lock bit set. Device not in IC manufacturing." value="1" />
      </value-group>
      <value-group name="SYNCBUSY__ENABLE">
        <value name="0" caption="ENABLE synchronization is NOT busy." value="0" />
        <value name="1" caption="ENABLE synchronization is busy." value="1" />
      </value-group>
    </module>
    <module name="ICB" id="SYSTEM_IP" version="1.0.0" caption="Implementation Control Block">
      <register-group name="ICB" caption="Implementation Control Block">
        <register name="ICTR" offset="0x4" rw="R" size="4" access-size="4" caption="Interrupt Controller Type Register">
          <bitfield name="INTLINESNUM" caption="Interrupt line set number" mask="0xF" />
        </register>
        <register name="ACTLR" offset="0x8" rw="RW" size="4" access-size="4" caption="Auxiliary Control Register" />
      </register-group>
    </module>
    <module name="IDAU" id="04250" name2="sec_idau_v3" version="3a0" caption="Implementation Defined Attribution Unit">
      <register-group name="REGIONS" size="0x10">
        <register name="RCTRL" offset="0x0" rw="W" size="4" initval="0x00000000" caption="Region Control">
          <mode name="BLOCK" caption="Block Based Region" />
          <mode name="WATERMARK" caption="Watermark Based Region" />
          <bitfield modes="BLOCK" name="ARG" caption="Command Argument (Block ID)" mask="0x1F" />
          <bitfield modes="WATERMARK" name="ARG" caption="Command Argument (Watermark)" mask="0xFFFFFF" />
          <bitfield modes="BLOCK" name="CMD" caption="Command" mask="0xFF000000" values="RCTRL_BLOCK__CMD" />
          <bitfield modes="WATERMARK" name="CMD" caption="Command" mask="0xFF000000" values="RCTRL_WATERMARK__CMD" />
        </register>
        <register name="RSTATUSA" offset="0x4" rw="R" size="4" initval="0x00000000" caption="Region Status A">
          <bitfield name="TYPE" caption="IDAU Region Type" mask="0xF" values="RSTATUSA__TYPE" />
          <bitfield name="GRAN" caption="Region Granularity" mask="0x3F00" values="RSTATUSA__GRAN" />
          <bitfield name="MAXSZ" caption="Command Argument Maximum Size" mask="0x3F0000" />
        </register>
        <register name="RSTATUSB" offset="0x8" rw="R" size="4" initval="0x00000000" caption="Region Status B">
          <mode name="BLOCK" caption="Block Based Region" />
          <mode name="WATERMARK" caption="Watermark Based Region" />
          <bitfield modes="BLOCK" name="NONSEC" caption="Block Based Region Non-Secure State" mask="0xFFFFFFFF" />
          <bitfield modes="WATERMARK" name="SIZE" caption="Watermark Based Region Size in Bytes" mask="0xFFFFFFFF" />
        </register>
        <register name="RSTATUSC" offset="0xC" rw="R" size="4" initval="0x00000000" caption="Region Status C">
          <mode name="BLOCK" />
          <mode name="LINK" />
          <bitfield modes="LINK" name="RGN" caption="Linked IDAU Region ID" mask="0xFF" />
          <bitfield modes="LINK" name="BLK" caption="Linked IDAU Region Block ID" mask="0x1F00" />
          <bitfield modes="BLOCK" name="CST" caption="Constant Block Configuration" mask="0xFFFFFFFF" />
        </register>
      </register-group>
      <register-group name="IDAU" caption="Implementation Defined Attribution Unit">
        <register name="CTRL" offset="0x0" rw="W" size="4" initval="0x00000000" caption="Control">
          <bitfield name="CMD" caption="Command Register" mask="0xFFFF0000" values="CTRL__CMD" />
        </register>
        <register name="STATUSA" offset="0x4" rw="R" size="4" caption="Status A">
          <bitfield name="ENABLE" caption="Enable" mask="0x1" />
          <bitfield name="WLCK" caption="Write Lock" mask="0x2" />
          <bitfield name="NBRG" caption="Number Of IDAU Regions" mask="0x1FF00" />
        </register>
        <register name="STATUSB" offset="0x8" rw="RW" size="4" atomic-op="clear:STATUSB" initval="0x00000000" caption="Status B">
          <bitfield name="CFGERR" caption="Configuration Error" mask="0x1" />
        </register>
        <register-group name="REGIONS" name-in-module="REGIONS" offset="0x1000" size="0x10" count="256" />
      </register-group>
      <value-group name="RCTRL_BLOCK__CMD">
        <value name="CLRNONSEC" caption="Clear IDAU region x Non-Secure State of block ARG (RSTATUSB[x].NONSEC[ARG]=0)" value="0x5A" />
        <value name="SETNONSEC" caption="Set IDAU region x Non-Secure State of block ARG (RSTATUSB[x].NONSEC[ARG]=1)" value="0x5B" />
      </value-group>
      <value-group name="RCTRL_WATERMARK__CMD">
        <value name="WRSZ" caption="Write IDAU region x Size (RSTATUSB[x].SIZE=ARG)" value="0x5C" />
      </value-group>
