zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_sg_gc/pic32cm_sg00/atdf/PIC32CM5112SG00064.atdf
    <module name="OSC32KCTRL" id="03717" name2="osc_osc32kctrl_u2400_v2" version="2a0" caption="32kHz Oscillators Control">
      <register-group name="OSC32KCTRL" caption="32kHz Oscillators Control">
        <register name="INTENCLR" offset="0x0" rw="RW" size="4" atomic-op="clear:INTENCLR" initval="0x00000000" caption="Interrupt Enable Clear">
          <bitfield name="XOSC32KRDY" caption="XOSC32K Ready Interrupt Enable" mask="0x1" />
          <bitfield name="XOSC32KFAIL" caption="XOSC32K Clock Failure Detector Interrupt Enable" mask="0x4" />
        </register>
        <register name="INTENSET" offset="0x4" rw="RW" size="4" atomic-op="set:INTENSET" initval="0x00000000" caption="Interrupt Enable Set">
          <bitfield name="XOSC32KRDY" caption="XOSC32K Ready Interrupt Enable" mask="0x1" />
          <bitfield name="XOSC32KFAIL" caption="XOSC32K Clock Failure Detector Interrupt Enable" mask="0x4" />
        </register>
        <register name="INTFLAG" offset="0x8" rw="RW" size="4" atomic-op="clear:INTFLAG" initval="0x00000000" caption="Interrupt Flag Status and Clear">
          <bitfield name="XOSC32KRDY" caption="XOSC32K Ready" mask="0x1" />
          <bitfield name="XOSC32KFAIL" caption="XOSC32K Clock Failure Detector" mask="0x4" />
        </register>
        <register name="STATUS" offset="0xC" rw="R" size="4" initval="0x00000000" caption="Power and Clocks Status">
          <bitfield name="XOSC32KRDY" caption="XOSC32K Ready" mask="0x1" />
          <bitfield name="XOSC32KFAIL" caption="XOSC32K Clock Failure Detector" mask="0x4" />
          <bitfield name="XOSC32KSW" caption="XOSC32K Clock switch" mask="0x8" />
        </register>
        <register name="CLKSELCTRL" offset="0x10" rw="RW" size="4" initval="0x00000000" caption="Clock Selection Control">
          <bitfield name="RTCSEL" caption="RTC Clock Selection" mask="0x3" values="CLKSELCTRL__RTCSEL" />
          <bitfield name="HSMSEL" caption="HSM Clock Selection" mask="0x30" values="CLKSELCTRL__HSMSEL" />
        </register>
        <register name="CFDCTRL" offset="0x14" rw="RW" size="4" initval="0x00000000" caption="Clock Failure Detector Control">
          <bitfield name="CFDEN" caption="Clock Failure Detector Enable" mask="0x1" />
          <bitfield name="SWBACK" caption="Clock Switch Back" mask="0x2" />
          <bitfield name="CFDPRESC" caption="Clock Failure Detector Prescaler" mask="0x4" />
        </register>
        <register name="EVCTRL" offset="0x18" rw="RW" size="4" initval="0x00000000" caption="Event Control">
          <bitfield name="CFDEO" caption="Clock Failure Detector Event Output Enable" mask="0x1" />
        </register>
        <register name="XOSC32K" offset="0x1C" rw="RW" size="4" initval="0x00200080" caption="32kHz External Crystal Oscillator (XOSC32K) Control">
          <bitfield name="ENABLE" caption="Oscillator Enable" mask="0x2" />
          <bitfield name="XTALEN" caption="Crystal Oscillator Enable" mask="0x4" />
          <bitfield name="ONDEMAND" caption="On Demand Mode" mask="0x80" />
          <bitfield name="STARTUP" caption="Startup Mode" mask="0xF00" values="XOSC32K__STARTUP" />
          <bitfield name="ENSL" caption="Enable Servo Loop" mask="0x10000" />
          <bitfield name="BOOST" caption="Gain Boost" mask="0x20000" />
          <bitfield name="CGM" caption="Control Gain Mode" mask="0x3C0000" values="XOSC32K__CGM" />
          <bitfield name="CTRLX" caption="Extended Control" mask="0xF000000" />
        </register>
      </register-group>
      <value-group name="CLKSELCTRL__RTCSEL">
        <value name="ULP32K" caption="32.768kHz from 32kHz internal ULP oscillator" value="0x0" />
        <value name="ULP1K" caption="1.024kHz from 32kHz internal ULP oscillator" value="0x1" />
        <value name="XOSC32K" caption="32.768kHz from 32.768kHz external crystal oscillator" value="0x2" />
        <value name="XOSC1K" caption="1.024kHz from 32.768kHz internal oscillator" value="0x3" />
      </value-group>
      <value-group name="CLKSELCTRL__HSMSEL">
        <value name="ULP32K" caption="32.768kHz from 32kHz internal ULP oscillator" value="0x0" />
        <value name="XOSC32K" caption="32.768kHz from 32.768kHz external crystal oscillator" value="0x2" />
      </value-group>
      <value-group name="XOSC32K__STARTUP">
        <value name="1CYCLE" caption="1 ULP clock cycle" value="0x0" />
        <value name="16CYCLES" caption="16 ULP clock cycles" value="0x1" />
        <value name="32CYCLES" caption="32 ULP clock cycles" value="0x2" />
        <value name="2048CYCLES" caption="2048 ULP clock cycles" value="0x3" />
        <value name="4096CYCLES" caption="4096 ULP clock cycles" value="0x4" />
        <value name="8192CYCLES" caption="8192 ULP clock cycles" value="0x5" />
        <value name="16384CYCLES" caption="16384 ULP clock cycles" value="0x6" />
        <value name="32768CYCLES" caption="32768 ULP clock cycles" value="0x7" />
        <value name="65536CYCLES" caption="65536 ULP clock cycles" value="0x8" />
        <value name="131072CYCLES" caption="131072 ULP clock cycles" value="0x9" />
        <value name="262144CYCLES" caption="262144 ULP clock cycles" value="0xA" />
      </value-group>
      <value-group name="XOSC32K__CGM">
        <value name="CGM0" caption="The lower Control Gain Mode value" value="0x0" />
        <value name="CGM1" caption="A higher Control Gain Mode value than CGM0" value="0x1" />
        <value name="CGM2" caption="A higher Control Gain Mode value than CGM1" value="0x2" />
        <value name="CGM3" caption="A higher Control Gain Mode value than CGM2" value="0x3" />
        <value name="CGM4" caption="A higher Control Gain Mode value than CGM3" value="0x4" />
        <value name="CGM5" caption="A higher Control Gain Mode value than CGM4" value="0x5" />
        <value name="CGM6" caption="A higher Control Gain Mode value than CGM5" value="0x6" />
        <value name="CGM7" caption="A higher Control Gain Mode value than CGM6" value="0x7" />
        <value name="CGM8" caption="A higher Control Gain Mode value than CGM7" value="0x8" />
        <value name="CGM9" caption="A higher Control Gain Mode value than CGM8" value="0x9" />
        <value name="CGM10" caption="A higher Control Gain Mode value than CGM9" value="0xA" />
        <value name="CGM11" caption="A higher Control Gain Mode value than CGM10" value="0xB" />
        <value name="CGM12" caption="A higher Control Gain Mode value than CGM11" value="0xC" />
        <value name="CGM13" caption="A higher Control Gain Mode value than CGM12" value="0xD" />
        <value name="CGM14" caption="A higher Control Gain Mode value than CGM13" value="0xE" />
        <value name="CGM15" caption="The highest Control Gain Mode value" value="0xF" />
      </value-group>
    </module>
    <module name="OSCCTRL" id="03718" name2="osc_oscctrl_u2401_v2" version="2b0" caption="Oscillators Control">
      <register-group name="OSCCTRL" caption="Oscillators Control">
        <register name="EVCTRL" offset="0x0" rw="RW" size="4" initval="0x00000000" caption="Event Control">
          <bitfield name="CFDEO" caption="Clock Failure Detector Event Output Enable" mask="0x1" />
        </register>
        <register name="INTENCLR" offset="0x4" rw="RW" size="4" atomic-op="clear:INTENCLR" initval="0x00000000" caption="Interrupt Enable Clear">
          <bitfield name="XOSCRDY" caption="XOSC Ready Interrupt Enable" mask="0x1" />
          <bitfield name="XOSCFAIL" caption="XOSC Startup Failure Interrupt Enable" mask="0x2" />
          <bitfield name="CLKFAIL" caption="XOSC Clock Failure Interrupt Enable" mask="0x4" />
          <bitfield name="DFLLRDY" caption="DFLL Ready Interrupt Enable" mask="0x100" />
          <bitfield name="DFLLLOCK" caption="DFLL Lock Interrupt Enable" mask="0x200" />
          <bitfield name="DFLLOVF" caption="DFLL Tuner Overflow Interrupt Enable" mask="0x400" />
          <bitfield name="DFLLUNF" caption="DFLL Tuner Underflow Interrupt Enable" mask="0x800" />
          <bitfield name="DFLLRCS" caption="DFLL Reference Clock Stopped Interrupt Enable" mask="0x1000" />
          <bitfield name="DFLLFAIL" caption="DFLL Startup Failure Interrupt Enable" mask="0x2000" />
          <bitfield name="PLL0LOCKR" caption="PLL 0 Lock Rise Interrupt Enable" mask="0x1000000" />
          <bitfield name="PLL0LOCKF" caption="PLL 0 Lock Fall Interrupt Enable" mask="0x2000000" />
        </register>
        <register name="INTENSET" offset="0x8" rw="RW" size="4" atomic-op="set:INTENSET" initval="0x00000000" caption="Interrupt Enable Set">
          <bitfield name="XOSCRDY" caption="XOSC Ready Interrupt Enable" mask="0x1" />
          <bitfield name="XOSCFAIL" caption="XOSC Startup Failure Interrupt Enable" mask="0x2" />
          <bitfield name="CLKFAIL" caption="XOSC Clock Failure Interrupt Enable" mask="0x4" />
          <bitfield name="DFLLRDY" caption="DFLL Ready Interrupt Enable" mask="0x100" />
          <bitfield name="DFLLLOCK" caption="DFLL Lock Interrupt Enable" mask="0x200" />
          <bitfield name="DFLLOVF" caption="DFLL Tuner Overflow Interrupt Enable" mask="0x400" />
          <bitfield name="DFLLUNF" caption="DFLL Tuner Underflow Interrupt Enable" mask="0x800" />
          <bitfield name="DFLLRCS" caption="DFLL Reference Clock Stopped Interrupt Enable" mask="0x1000" />
          <bitfield name="DFLLFAIL" caption="DFLL Startup Failure Interrupt Enable" mask="0x2000" />
          <bitfield name="PLL0LOCKR" caption="PLL 0 Lock Rise Interrupt Enable" mask="0x1000000" />
          <bitfield name="PLL0LOCKF" caption="PLL 0 Lock Fall Interrupt Enable" mask="0x2000000" />
        </register>
        <register name="INTFLAG" offset="0xC" rw="RW" size="4" atomic-op="clear:INTFLAG" initval="0x00000000" caption="Interrupt Flag Status and Clear">
          <bitfield name="XOSCRDY" caption="XOSC Ready" mask="0x1" />
          <bitfield name="XOSCFAIL" caption="XOSC Startup Failure" mask="0x2" />
          <bitfield name="CLKFAIL" caption="XOSC Clock Failure" mask="0x4" />
          <bitfield name="DFLLRDY" caption="DFLL Ready" mask="0x100" />
          <bitfield name="DFLLLOCK" caption="DFLL Lock" mask="0x200" />
          <bitfield name="DFLLOVF" caption="DFLL Tuner Overflow" mask="0x400" />
          <bitfield name="DFLLUNF" caption="DFLL Tuner Underflow" mask="0x800" />
          <bitfield name="DFLLRCS" caption="DFLL Reference Clock Stopped" mask="0x1000" />
          <bitfield name="DFLLFAIL" caption="DFLL Startup Failure" mask="0x2000" />
          <bitfield name="PLL0LOCKR" caption="PLL 0 Lock Rise" mask="0x1000000" />
          <bitfield name="PLL0LOCKF" caption="PLL 0 Lock Fall" mask="0x2000000" />
        </register>
        <register name="STATUS" offset="0x10" rw="R" size="4" initval="0x00000000" caption="Status">
          <bitfield name="XOSCRDY" caption="XOSC Ready" mask="0x1" />
          <bitfield name="XOSCFAIL" caption="XOSC Startup Failure" mask="0x2" />
          <bitfield name="CLKFAIL" caption="XOSC Clock Failure" mask="0x4" />
          <bitfield name="XOSCCKSW" caption="XOSC Clock Switch" mask="0x8" />
          <bitfield name="DFLLRDY" caption="DFLL Ready" mask="0x100" />
          <bitfield name="DFLLLOCK" caption="DFLL Lock" mask="0x200" />
          <bitfield name="DFLLOVF" caption="DFLL Tuner Overflow" mask="0x400" />
          <bitfield name="DFLLUNF" caption="DFLL Tuner Underflow" mask="0x800" />
          <bitfield name="DFLLRCS" caption="DFLL Reference Clock Stopped" mask="0x1000" />
          <bitfield name="DFLLFAIL" caption="DFLL Startup Failure" mask="0x2000" />
          <bitfield name="PLL0LOCK" caption="PLL 0 Lock" mask="0x1000000" />
        </register>
        <register name="XOSCCTRLA" offset="0x14" rw="RW" size="4" initval="0x00000D00" caption="External Multipurpose Crystal Oscillator Control A">
          <bitfield name="ENABLE" caption="Oscillator Enable" mask="0x2" />
          <bitfield name="AGC" caption="Auto Gain Control Loop Enable" mask="0x4" />
          <bitfield name="XTALEN" caption="Crystal Oscillator Enable" mask="0x8" />
          <bitfield name="CFDEN" caption="Clock Failure Detector Enable" mask="0x10" />
          <bitfield name="SWBEN" caption="Xosc Clock Switch Back Enable" mask="0x20" />
          <bitfield name="ONDEMAND" caption="On Demand Control" mask="0x80" />
          <bitfield name="STARTUP" caption="Start-Up Time" mask="0xF00" values="XOSCCTRLA__STARTUP" />
          <bitfield name="CFDPRESC" caption="Clock Failure Detector Prescaler" mask="0xF0000" values="XOSCCTRLA__CFDPRESC" />
          <bitfield name="USBHSDIV" caption="USBHS Referrence Clock Division" mask="0x3000000" values="XOSCCTRLA__USBHSDIV" />
          <bitfield name="WRTLOCK" caption="Write Lock for CTRLA register" mask="0x80000000" />
        </register>
