zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_sg_gc/pic32cm_sg00/atdf/PIC32CM5112SG00064.atdf
        <register name="XOSCCTRLB" offset="0x18" rw="RW" size="4" initval="0x00000000" caption="External Multipurpose Crystal Oscillator Control B">
          <bitfield name="USRCFG" caption="User Configuration Control Bits" mask="0xFF" />
          <bitfield name="WRTLOCK" caption="Write Lock for CTRLB register" mask="0x80000000" />
        </register>
        <register name="DFLLCTRLA" offset="0x2C" rw="RW" size="4" initval="0x00000082" caption="DFLL48M Control A">
          <bitfield name="ENABLE" caption="DFLL Enable" mask="0x2" />
          <bitfield name="WRTLOCK" caption="Write Lock" mask="0x4" />
          <bitfield name="LOWFREQ" caption="Low Frequency Mode" mask="0x8" />
          <bitfield name="ONDEMAND" caption="On Demand Control" mask="0x80" />
        </register>
        <register name="DFLLCTRLB" offset="0x30" rw="RW" access="WSYNC" size="4" initval="0x00000000" caption="DFLL48M Control B">
          <bitfield name="LOOPEN" caption="Operating Mode Selection" mask="0x1" />
          <bitfield name="STABLE" caption="Stable DFLL Frequency" mask="0x2" />
          <bitfield name="LLAW" caption="Lose Lock After Wake" mask="0x4" />
          <bitfield name="USBCRM" caption="USB Clock Recovery Mode" mask="0x8" />
          <bitfield name="CCDIS" caption="Chill Cycle Disable" mask="0x10" />
          <bitfield name="QLDIS" caption="Quick Lock Disable" mask="0x20" />
          <bitfield name="WAITLOCK" caption="Wait Lock" mask="0x80" />
        </register>
        <register name="DFLLTUNE" offset="0x34" rw="RW" access="RWSYNC" size="4" initval="0x00000000" caption="DFLL48M Tune">
          <bitfield name="TUNE" caption="Tune Value" mask="0x7F" />
        </register>
        <register name="DFLLDIFF" offset="0x38" rw="R" access="RSYNC" size="4" initval="0x00000000" caption="DFLL48M Diff">
          <bitfield name="DIFF" caption="Multiplication Ratio Difference" mask="0xFFFF" />
        </register>
        <register name="DFLLMUL" offset="0x3C" rw="RW" access="WSYNC" size="4" initval="0x00000000" caption="DFLL48M Multiplier">
          <bitfield name="MUL" caption="DFLL Multiply Factor" mask="0xFFFF" />
          <bitfield name="STEP" caption="Tune Maximum Step" mask="0x7F0000" />
        </register>
        <register name="PLL0CTRL" offset="0x40" rw="RW" size="4" initval="0x00000000" caption="PLL Control">
          <bitfield name="ENABLE" caption="PLL Enable" mask="0x2" />
          <bitfield name="WRTLOCK" caption="Write Lock" mask="0x4" />
          <bitfield name="ONDEMAND" caption="On Demand Control" mask="0x80" />
          <bitfield name="REFSEL" caption="Reference selection" mask="0x700" values="PLL0CTRL__REFSEL" />
          <bitfield name="BWSEL" caption="Bandwidth selection" mask="0x3800" values="PLL0CTRL__BWSEL" />
        </register>
        <register name="PLL0FBDIV" offset="0x44" rw="RW" size="4" initval="0x00000000" caption="PLL Feed-Back Divider">
          <bitfield name="FBDIV" caption="PLL Feed-Back Divider Factor" mask="0x3FF" />
        </register>
        <register name="PLL0REFDIV" offset="0x48" rw="RW" size="4" initval="0x00000000" caption="PLL reference divider">
          <bitfield name="REFDIV" caption="PLL reference division factor" mask="0x3F" />
        </register>
        <register name="PLL0POSTDIVA" offset="0x4C" rw="RW" size="4" initval="0x20202020" caption="PLL output clock divider A">
          <bitfield name="POSTDIV0" caption="PLL output 0 clock division factor" mask="0x3F" />
          <bitfield name="OUTEN0" caption="PLL output 0 enable" mask="0x80" />
          <bitfield name="POSTDIV1" caption="PLL output 0 clock division factor" mask="0x3F00" />
          <bitfield name="OUTEN1" caption="PLL output 0 enable" mask="0x8000" />
          <bitfield name="POSTDIV2" caption="PLL output 0 clock division factor" mask="0x3F0000" />
          <bitfield name="OUTEN2" caption="PLL output 0 enable" mask="0x800000" />
          <bitfield name="POSTDIV3" caption="PLL output 0 clock division factor" mask="0x3F000000" />
          <bitfield name="OUTEN3" caption="PLL output 0 enable" mask="0x80000000" />
        </register>
        <register name="PLL0POSTDIVB" offset="0x50" rw="RW" size="4" initval="0x00000020" caption="PLL output clock divider B">
          <bitfield name="POSTDIV4" caption="PLL output 4 clock division factor" mask="0x3F" />
          <bitfield name="OUTEN4" caption="PLL output 4 enable" mask="0x80" />
        </register>
        <register name="SYNCBUSY" offset="0x78" rw="R" size="4" initval="0x00000000" caption="Synchronization Busy">
          <bitfield name="DFLLENABLE" caption="DFLL48M ENABLE Synchronization Busy" mask="0x2" />
          <bitfield name="DFLLCTRLB" caption="DFLLCTRLB Synchronization Busy" mask="0x4" />
          <bitfield name="DFLLTUNE" caption="DFLLTUNE Synchronization Busy" mask="0x8" />
          <bitfield name="DFLLDIFF" caption="DFLLDIFF Synchronization Busy" mask="0x10" />
          <bitfield name="DFLLMUL" caption="DFLLMUL Synchronization Busy" mask="0x20" />
          <bitfield name="FRACDIV0" caption="FRACDIV0 Synchronization Busy" mask="0x40" />
          <bitfield name="FRACDIV1" caption="FRACDIV1 Synchronization Busy" mask="0x80" />
        </register>
        <register name="XOSCCAL" offset="0x80" rw="RW" size="4" initval="0x00000000" caption="XOSC Calibration Register">
          <mode name="DEFAULT" />
          <mode name="FUSES_OSC_XTAL_HF_AGC_V2" />
          <bitfield modes="FUSES_OSC_XTAL_HF_AGC_V2" name="FTRANS" caption="Fine Transconductance programmability for Oscillator" mask="0x3" />
          <bitfield modes="FUSES_OSC_XTAL_HF_AGC_V2" name="KICKEREN" caption="Kicker enable" mask="0x4" />
          <bitfield modes="FUSES_OSC_XTAL_HF_AGC_V2" name="ENVAMP" caption="envelope amplitude at osci" mask="0x8" />
          <bitfield modes="FUSES_OSC_XTAL_HF_AGC_V2" name="HYST" caption="loop hysteresis control" mask="0x10" />
          <bitfield modes="FUSES_OSC_XTAL_HF_AGC_V2" name="CMSEL" caption="clock buffer common mode selection" mask="0x20" />
          <bitfield modes="FUSES_OSC_XTAL_HF_AGC_V2" name="FLIPPOL" caption="flip output clock polarity" mask="0x40" />
          <bitfield modes="FUSES_OSC_XTAL_HF_AGC_V2" name="REDGAIN" caption="reduce gain control timer" mask="0x100" />
          <bitfield modes="FUSES_OSC_XTAL_HF_AGC_V2" name="REDOSC" caption="reduce oscillation debug counter" mask="0x200" />
          <bitfield modes="FUSES_OSC_XTAL_HF_AGC_V2" name="SPARES" caption="Spare bits" mask="0xFC00" />
          <bitfield modes="DEFAULT" name="CAL" caption="XOSC Calibration" mask="0xFFFF" />
        </register>
        <register name="RC48MCAL0" offset="0x88" rw="RW" size="4" initval="0x00000000" caption="RC48M Calibration 0">
          <mode name="DEFAULT" />
          <mode name="FUSES_OSC_RC48MHZ_V1" />
          <bitfield modes="FUSES_OSC_RC48MHZ_V1" name="temp_trim_mv" caption="Temp trim value" mask="0x3F" />
          <bitfield modes="FUSES_OSC_RC48MHZ_V1" name="proc_trim_mv" caption="Proc trim value" mask="0x3FC0" />
          <bitfield modes="FUSES_OSC_RC48MHZ_V1" name="iosc_boost" caption="IOSC boost" mask="0x10000" />
          <bitfield modes="FUSES_OSC_RC48MHZ_V1" name="out_buf_sel" caption="Output buffer select" mask="0x20000" />
          <bitfield modes="FUSES_OSC_RC48MHZ_V1" name="ldo_vout_boost" caption="LDO VOUT boost" mask="0x40000" />
          <bitfield modes="FUSES_OSC_RC48MHZ_V1" name="cmp_8m_lp" caption="Comparator 8MHz low-power" mask="0x80000" />
          <bitfield modes="FUSES_OSC_RC48MHZ_V1" name="cmp_pwr_ctrl" caption="Comparator power control" mask="0x700000" />
          <bitfield modes="DEFAULT" name="CAL" caption="RC48M Calibration" mask="0xFFFFFFFF" />
        </register>
      </register-group>
      <value-group name="XOSCCTRLA__STARTUP">
        <value name="CYCLE1" caption="31 us" value="0" />
        <value name="CYCLE2" caption="61 us" value="1" />
        <value name="CYCLE4" caption="122 us" value="2" />
        <value name="CYCLE8" caption="244 us" value="3" />
        <value name="CYCLE16" caption="488 us" value="4" />
        <value name="CYCLE32" caption="977 us" value="5" />
        <value name="CYCLE64" caption="1953 us" value="6" />
        <value name="CYCLE128" caption="3906 us" value="7" />
        <value name="CYCLE256" caption="7813 us" value="8" />
        <value name="CYCLE512" caption="15625 us" value="9" />
        <value name="CYCLE1024" caption="31250 us" value="10" />
        <value name="CYCLE2048" caption="62500 us" value="11" />
        <value name="CYCLE4096" caption="125000 us" value="12" />
        <value name="CYCLE8192" caption="250000 us" value="13" />
        <value name="CYCLE16384" caption="500000 us" value="14" />
        <value name="CYCLE32768" caption="1000000 us" value="15" />
      </value-group>
