zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_sg_gc/pic32cm_sg00/atdf/PIC32CM5112SG00064.atdf
        <register modes="USART" name="RXPL" offset="0xE" rw="RW" size="1" initval="0x00" caption="USART Receive Pulse Length">
          <bitfield name="RXPL" caption="Receive Pulse Length" mask="0xFF" />
        </register>
        <register modes="I2CM" name="INTENCLR" offset="0x14" rw="RW" size="1" atomic-op="clear:INTENCLR" initval="0x00" caption="I2CM Interrupt Enable Clear">
          <bitfield name="MB" caption="Master On Bus Interrupt Disable" mask="0x1" />
          <bitfield name="SB" caption="Slave On Bus Interrupt Disable" mask="0x2" />
          <bitfield name="TXFE" caption="Tx FIFO Empty Interrupt Disable" mask="0x8" />
          <bitfield name="RXFF" caption="Rx FIFO Full Interrupt Disable" mask="0x10" />
          <bitfield name="ERROR" caption="Combined Error Interrupt Disable" mask="0x80" />
        </register>
        <register modes="I2CS" name="INTENCLR" offset="0x14" rw="RW" size="1" atomic-op="clear:INTENCLR" initval="0x00" caption="I2CS Interrupt Enable Clear">
          <bitfield name="PREC" caption="Stop Received Interrupt Disable" mask="0x1" />
          <bitfield name="AMATCH" caption="Address Match Interrupt Disable" mask="0x2" />
          <bitfield name="DRDY" caption="Data Interrupt Disable" mask="0x4" />
          <bitfield name="TXFE" caption="Tx FIFO Empty Interrupt Disable" mask="0x8" />
          <bitfield name="RXFF" caption="Rx FIFO Full Interrupt Disable" mask="0x10" />
          <bitfield name="ERROR" caption="Combined Error Interrupt Disable" mask="0x80" />
        </register>
        <register modes="SPI" name="INTENCLR" offset="0x14" rw="RW" size="1" atomic-op="clear:INTENCLR" initval="0x00" caption="SPI Interrupt Enable Clear">
          <bitfield name="DRE" caption="Data Register Empty Interrupt Disable" mask="0x1" />
          <bitfield name="TXC" caption="Transmit Complete Interrupt Disable" mask="0x2" />
          <bitfield name="RXC" caption="Receive Complete Interrupt Disable" mask="0x4" />
          <bitfield name="SSL" caption="Slave Select Low Interrupt Disable" mask="0x8" />
          <bitfield name="ERROR" caption="Combined Error Interrupt Disable" mask="0x80" />
        </register>
        <register modes="USART" name="INTENCLR" offset="0x14" rw="RW" size="1" atomic-op="clear:INTENCLR" initval="0x00" caption="USART Interrupt Enable Clear">
          <bitfield name="DRE" caption="Data Register Empty Interrupt Disable" mask="0x1" />
          <bitfield name="TXC" caption="Transmit Complete Interrupt Disable" mask="0x2" />
          <bitfield name="RXC" caption="Receive Complete Interrupt Disable" mask="0x4" />
          <bitfield name="RXS" caption="Receive Start Interrupt Disable" mask="0x8" />
          <bitfield name="CTSIC" caption="Clear To Send Input Change Interrupt Disable" mask="0x10" />
          <bitfield name="RXBRK" caption="Break Received Interrupt Disable" mask="0x20" />
          <bitfield name="ERROR" caption="Combined Error Interrupt Disable" mask="0x80" />
        </register>
        <register modes="I2CM" name="INTENSET" offset="0x16" rw="RW" size="1" atomic-op="set:INTENSET" initval="0x00" caption="I2CM Interrupt Enable Set">
          <bitfield name="MB" caption="Master On Bus Interrupt Enable" mask="0x1" />
          <bitfield name="SB" caption="Slave On Bus Interrupt Enable" mask="0x2" />
          <bitfield name="TXFE" caption="Tx FIFO Empty Interrupt Enable" mask="0x8" />
          <bitfield name="RXFF" caption="Rx FIFO Full Interrupt Enable" mask="0x10" />
          <bitfield name="ERROR" caption="Combined Error Interrupt Enable" mask="0x80" />
        </register>
        <register modes="I2CS" name="INTENSET" offset="0x16" rw="RW" size="1" atomic-op="set:INTENSET" initval="0x00" caption="I2CS Interrupt Enable Set">
          <bitfield name="PREC" caption="Stop Received Interrupt Enable" mask="0x1" />
          <bitfield name="AMATCH" caption="Address Match Interrupt Enable" mask="0x2" />
          <bitfield name="DRDY" caption="Data Interrupt Enable" mask="0x4" />
          <bitfield name="TXFE" caption="Tx FIFO Empty Interrupt Enable" mask="0x8" />
          <bitfield name="RXFF" caption="Rx FIFO Full Interrupt Enable" mask="0x10" />
          <bitfield name="ERROR" caption="Combined Error Interrupt Enable" mask="0x80" />
        </register>
        <register modes="SPI" name="INTENSET" offset="0x16" rw="RW" size="1" atomic-op="set:INTENSET" initval="0x00" caption="SPI Interrupt Enable Set">
          <bitfield name="DRE" caption="Data Register Empty Interrupt Enable" mask="0x1" />
          <bitfield name="TXC" caption="Transmit Complete Interrupt Enable" mask="0x2" />
          <bitfield name="RXC" caption="Receive Complete Interrupt Enable" mask="0x4" />
          <bitfield name="SSL" caption="Slave Select Low Interrupt Enable" mask="0x8" />
          <bitfield name="ERROR" caption="Combined Error Interrupt Enable" mask="0x80" />
        </register>
        <register modes="USART" name="INTENSET" offset="0x16" rw="RW" size="1" atomic-op="set:INTENSET" initval="0x00" caption="USART Interrupt Enable Set">
          <bitfield name="DRE" caption="Data Register Empty Interrupt Enable" mask="0x1" />
          <bitfield name="TXC" caption="Transmit Complete Interrupt Enable" mask="0x2" />
          <bitfield name="RXC" caption="Receive Complete Interrupt Enable" mask="0x4" />
          <bitfield name="RXS" caption="Receive Start Interrupt Enable" mask="0x8" />
          <bitfield name="CTSIC" caption="Clear To Send Input Change Interrupt Enable" mask="0x10" />
          <bitfield name="RXBRK" caption="Break Received Interrupt Enable" mask="0x20" />
          <bitfield name="ERROR" caption="Combined Error Interrupt Enable" mask="0x80" />
        </register>
        <register modes="I2CM" name="INTFLAG" offset="0x18" rw="RW" size="1" atomic-op="clear:INTFLAG" initval="0x00" caption="I2CM Interrupt Flag Status and Clear">
          <bitfield name="MB" caption="Master On Bus Interrupt" mask="0x1" />
          <bitfield name="SB" caption="Slave On Bus Interrupt" mask="0x2" />
          <bitfield name="TXFE" caption="Tx FIFO Empty Interrupt" mask="0x8" />
          <bitfield name="RXFF" caption="Rx FIFO Full Interrupt" mask="0x10" />
          <bitfield name="ERROR" caption="Combined Error Interrupt" mask="0x80" />
        </register>
        <register modes="I2CS" name="INTFLAG" offset="0x18" rw="RW" size="1" atomic-op="clear:INTFLAG" initval="0x00" caption="I2CS Interrupt Flag Status and Clear">
          <bitfield name="PREC" caption="Stop Received Interrupt" mask="0x1" />
          <bitfield name="AMATCH" caption="Address Match Interrupt" mask="0x2" />
          <bitfield name="DRDY" caption="Data Interrupt" mask="0x4" />
          <bitfield name="TXFE" caption="Tx FIFO Empty Interrupt" mask="0x8" />
          <bitfield name="RXFF" caption="Rx FIFO Full Interrupt" mask="0x10" />
          <bitfield name="ERROR" caption="Combined Error Interrupt" mask="0x80" />
        </register>
        <register modes="SPI" name="INTFLAG" offset="0x18" rw="RW" size="1" atomic-op="clear:INTFLAG" initval="0x00" caption="SPI Interrupt Flag Status and Clear">
          <bitfield name="DRE" caption="Data Register Empty Interrupt" mask="0x1" />
          <bitfield name="TXC" caption="Transmit Complete Interrupt" mask="0x2" />
          <bitfield name="RXC" caption="Receive Complete Interrupt" mask="0x4" />
          <bitfield name="SSL" caption="Slave Select Low Interrupt Flag" mask="0x8" />
          <bitfield name="ERROR" caption="Combined Error Interrupt" mask="0x80" />
        </register>
        <register modes="USART" name="INTFLAG" offset="0x18" rw="RW" size="1" atomic-op="clear:INTFLAG" initval="0x00" caption="USART Interrupt Flag Status and Clear">
          <bitfield name="DRE" caption="Data Register Empty Interrupt" mask="0x1" />
          <bitfield name="TXC" caption="Transmit Complete Interrupt" mask="0x2" />
          <bitfield name="RXC" caption="Receive Complete Interrupt" mask="0x4" />
          <bitfield name="RXS" caption="Receive Start Interrupt" mask="0x8" />
          <bitfield name="CTSIC" caption="Clear To Send Input Change Interrupt" mask="0x10" />
          <bitfield name="RXBRK" caption="Break Received Interrupt" mask="0x20" />
          <bitfield name="ERROR" caption="Combined Error Interrupt" mask="0x80" />
        </register>
        <register modes="I2CM" name="STATUS" offset="0x1A" rw="RW" access="WSYNC" size="2" initval="0x0000" caption="I2CM Status">
          <bitfield name="BUSERR" caption="Bus Error" mask="0x1" />
          <bitfield name="ARBLOST" caption="Arbitration Lost" mask="0x2" />
          <bitfield name="RXNACK" caption="Received Not Acknowledge" mask="0x4" />
          <bitfield name="BUSSTATE" caption="Bus State" mask="0x30" />
          <bitfield name="LOWTOUT" caption="SCL Low Timeout" mask="0x40" />
          <bitfield name="CLKHOLD" caption="Clock Hold" mask="0x80" />
          <bitfield name="MEXTTOUT" caption="Master SCL Low Extend Timeout" mask="0x100" />
          <bitfield name="SEXTTOUT" caption="Slave SCL Low Extend Timeout" mask="0x200" />
          <bitfield name="LENERR" caption="Length Error" mask="0x400" />
        </register>
        <register modes="I2CS" name="STATUS" offset="0x1A" rw="RW" size="2" initval="0x0000" caption="I2CS Status">
          <bitfield name="BUSERR" caption="Bus Error" mask="0x1" />
          <bitfield name="COLL" caption="Transmit Collision" mask="0x2" />
          <bitfield name="RXNACK" caption="Received Not Acknowledge" mask="0x4" />
          <bitfield name="DIR" caption="Read/Write Direction" mask="0x8" />
          <bitfield name="SR" caption="Repeated Start" mask="0x10" />
          <bitfield name="LOWTOUT" caption="SCL Low Timeout" mask="0x40" />
          <bitfield name="CLKHOLD" caption="Clock Hold" mask="0x80" />
          <bitfield name="SEXTTOUT" caption="Slave SCL Low Extend Timeout" mask="0x200" />
          <bitfield name="HS" caption="High Speed" mask="0x400" />
          <bitfield name="LENERR" caption="Transaction Length Error" mask="0x800" />
        </register>
