zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_sg_gc/pic32cm_sg00/atdf/PIC32CM5112SG00064.atdf
        <register modes="SPI" name="STATUS" offset="0x1A" rw="RW" size="2" initval="0x0000" caption="SPI Status">
          <bitfield name="BUFOVF" caption="Buffer Overflow" mask="0x4" />
          <bitfield name="TUR" caption="Frame Transmit Underrun" mask="0x8" />
          <bitfield name="LENERR" caption="Transaction Length Error" mask="0x800" />
        </register>
        <register modes="USART" name="STATUS" offset="0x1A" rw="RW" size="2" initval="0x0000" caption="USART Status">
          <bitfield name="PERR" caption="Parity Error" mask="0x1" />
          <bitfield name="FERR" caption="Frame Error" mask="0x2" />
          <bitfield name="BUFOVF" caption="Buffer Overflow" mask="0x4" />
          <bitfield name="CTS" caption="Clear To Send" mask="0x8" />
          <bitfield name="ISF" caption="Inconsistent Sync Field" mask="0x10" />
          <bitfield name="COLL" caption="Collision Detected" mask="0x20" />
          <bitfield name="TXE" caption="Transmitter Empty" mask="0x40" />
          <bitfield name="ITER" caption="Maximum Number of Repetitions Reached" mask="0x80" />
        </register>
        <register modes="I2CM" name="SYNCBUSY" offset="0x1C" rw="R" size="4" initval="0x00000000" caption="I2CM Synchronization Busy">
          <bitfield name="SWRST" caption="Software Reset Synchronization Busy" mask="0x1" />
          <bitfield name="ENABLE" caption="SERCOM Enable Synchronization Busy" mask="0x2" />
          <bitfield name="SYSOP" caption="System Operation Synchronization Busy" mask="0x4" />
          <bitfield name="LENGTH" caption="Length Synchronization Busy" mask="0x10" />
        </register>
        <register modes="I2CS" name="SYNCBUSY" offset="0x1C" rw="R" size="4" initval="0x00000000" caption="I2CS Synchronization Busy">
          <bitfield name="SWRST" caption="Software Reset Synchronization Busy" mask="0x1" />
          <bitfield name="ENABLE" caption="SERCOM Enable Synchronization Busy" mask="0x2" />
          <bitfield name="SYSOP" caption="System Operation Synchronization Busy" mask="0x4" />
          <bitfield name="LENGTH" caption="Length Synchronization Busy" mask="0x10" />
        </register>
        <register modes="SPI" name="SYNCBUSY" offset="0x1C" rw="R" size="4" initval="0x00000000" caption="SPI Synchronization Busy">
          <bitfield name="SWRST" caption="Software Reset Synchronization Busy" mask="0x1" />
          <bitfield name="ENABLE" caption="SERCOM Enable Synchronization Busy" mask="0x2" />
          <bitfield name="CTRLB" caption="CTRLB Synchronization Busy" mask="0x4" />
          <bitfield name="LENGTH" caption="LENGTH Synchronization Busy" mask="0x10" />
        </register>
        <register modes="USART" name="SYNCBUSY" offset="0x1C" rw="R" size="4" initval="0x00000000" caption="USART Synchronization Busy">
          <bitfield name="SWRST" caption="Software Reset Synchronization Busy" mask="0x1" />
          <bitfield name="ENABLE" caption="SERCOM Enable Synchronization Busy" mask="0x2" />
          <bitfield name="CTRLB" caption="CTRLB Synchronization Busy" mask="0x4" />
          <bitfield name="RXERRCNT" caption="RXERRCNT Synchronization Busy" mask="0x8" />
          <bitfield name="LENGTH" caption="LENGTH Synchronization Busy" mask="0x10" />
        </register>
        <register modes="USART" name="RXERRCNT" offset="0x20" rw="R" access="RSYNC" size="1" initval="0x00" caption="USART Receive Error Count" />
        <register modes="I2CS" name="LENGTH" offset="0x22" rw="RW" access="WSYNC" size="2" initval="0x0000" caption="I2CS Length">
          <bitfield name="LEN" caption="Data Length" mask="0xFF" />
          <bitfield name="LENEN" caption="Data Length Enable" mask="0x100" />
        </register>
        <register modes="SPI" name="LENGTH" offset="0x22" rw="RW" access="WSYNC" size="2" initval="0x0000" caption="SPI Length">
          <bitfield name="LEN" caption="Data Length" mask="0xFF" />
          <bitfield name="LENEN" caption="Data Length Enable" mask="0x100" />
        </register>
        <register modes="USART" name="LENGTH" offset="0x22" rw="RW" access="WSYNC" size="2" initval="0x0000" caption="USART Length">
          <bitfield name="LEN" caption="Data Length" mask="0xFF" />
          <bitfield name="LENEN" caption="Data Length Enable" mask="0x300" values="USART_LENGTH__LENEN" />
        </register>
        <register modes="I2CM" name="ADDR" offset="0x24" rw="RW" access="WSYNC" size="4" initval="0x00000000" caption="I2CM Address">
          <bitfield name="ADDR" caption="Address Value" mask="0x7FF" />
          <bitfield name="LENEN" caption="Length Enable" mask="0x2000" />
          <bitfield name="HS" caption="High Speed Mode" mask="0x4000" />
          <bitfield name="TENBITEN" caption="Ten Bit Addressing Enable" mask="0x8000" />
          <bitfield name="LEN" caption="Length" mask="0xFF0000" />
        </register>
        <register modes="I2CS" name="ADDR" offset="0x24" rw="RW" size="4" initval="0x00000000" caption="I2CS Address">
          <bitfield name="GENCEN" caption="General Call Address Enable" mask="0x1" />
          <bitfield name="ADDR" caption="Address Value" mask="0x7FE" />
          <bitfield name="TENBITEN" caption="Ten Bit Addressing Enable" mask="0x8000" />
          <bitfield name="ADDRMASK" caption="Address Mask" mask="0x7FE0000" />
        </register>
        <register modes="SPI" name="ADDR" offset="0x24" rw="RW" size="4" initval="0x00000000" caption="SPI Address">
          <bitfield name="ADDR" caption="Address Value" mask="0xFF" />
          <bitfield name="ADDRMASK" caption="Address Mask" mask="0xFF0000" />
        </register>
        <register modes="I2CM" name="DATA" offset="0x28" rw="RW" access="RWSYNC" size="4" initval="0x00000000" caption="I2CM Data">
          <bitfield name="DATA" caption="Data Value" mask="0xFFFFFFFF" />
        </register>
        <register modes="I2CS" name="DATA" offset="0x28" rw="RW" size="4" initval="0x00000000" caption="I2CS Data">
          <bitfield name="DATA" caption="Data Value" mask="0xFFFFFFFF" />
        </register>
        <register modes="SPI" name="DATA" offset="0x28" rw="RW" size="4" initval="0x00000000" caption="SPI Data">
          <bitfield name="DATA" caption="Data Value" mask="0xFFFFFFFF" />
        </register>
        <register modes="USART" name="DATA" offset="0x28" rw="RW" size="4" initval="0x00000000" caption="USART Data">
          <bitfield name="DATA" caption="Data Value" mask="0xFFFFFFFF" />
        </register>
        <register modes="I2CM" name="DBGCTRL" offset="0x30" rw="RW" size="1" initval="0x00" caption="I2CM Debug Control">
          <bitfield name="DBGSTOP" caption="Debug Mode" mask="0x1" />
        </register>
        <register modes="SPI" name="DBGCTRL" offset="0x30" rw="RW" size="1" initval="0x00" caption="SPI Debug Control">
          <bitfield name="DBGSTOP" caption="Debug Mode" mask="0x1" />
        </register>
        <register modes="USART" name="DBGCTRL" offset="0x30" rw="RW" size="1" initval="0x00" caption="USART Debug Control">
          <bitfield name="DBGSTOP" caption="Debug Mode" mask="0x1" />
        </register>
